#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetailsGodOverviewWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodDetailsGodOverviewWidget.WBP_C_GodDetailsGodOverviewWidget_C.ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget) == 0x000004, "Wrong alignment on WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget");
static_assert(sizeof(WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget) == 0x000008, "Wrong size on WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget, EntryPoint) == 0x000000, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_ExecuteUbergraph_WBP_C_GodDetailsGodOverviewWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_C_GodDetailsGodOverviewWidget.WBP_C_GodDetailsGodOverviewWidget_C.OnGodSet
// 0x0428 (0x0428 - 0x0000)
struct WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0018)()
	bool                                          Temp_bool_Variable_5;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0080(0x0020)()
	class FText                                   CallFunc_ConstructPlaystyleDescriptorText_OutPlaystyleDescriptorText; // 0x00A0(0x0018)()
	bool                                          CallFunc_ConstructPlaystyleDescriptorText_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00C0(0x0018)()
	bool                                          CallFunc_IsInRotation_ReturnValue;                 // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWDataDisplay_Keyword                 CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData; // 0x00E0(0x00F0)()
	bool                                          CallFunc_GetKeywordDataFromPotentialTags_ReturnValue; // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x01D8(0x0018)()
	struct FHWDataDisplay_Keyword                 CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData_1; // 0x01F0(0x00F0)()
	bool                                          CallFunc_GetKeywordDataFromPotentialTags_ReturnValue_1; // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x02E8(0x0018)()
	struct FHWDataDisplay_Keyword                 CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData_2; // 0x0300(0x00F0)()
	bool                                          CallFunc_GetKeywordDataFromPotentialTags_ReturnValue_2; // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_5;                           // 0x03F8(0x0018)()
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x0410(0x0018)()
};
static_assert(alignof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet");
static_assert(sizeof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet) == 0x000428, "Wrong size on WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_text_Variable) == 0x000000, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_bool_Variable) == 0x000018, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_byte_Variable) == 0x000019, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_bool_Variable_1) == 0x00001B, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_byte_Variable_2) == 0x00001C, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_byte_Variable_3) == 0x00001D, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_bool_Variable_2) == 0x00001E, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_text_Variable_1) == 0x000020, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_bool_Variable_3) == 0x000038, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_text_Variable_2) == 0x000040, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_bool_Variable_4) == 0x000058, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_text_Variable_3) == 0x000060, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, Temp_bool_Variable_5) == 0x000078, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000080, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_ConstructPlaystyleDescriptorText_OutPlaystyleDescriptorText) == 0x0000A0, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_ConstructPlaystyleDescriptorText_OutPlaystyleDescriptorText' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_ConstructPlaystyleDescriptorText_ReturnValue) == 0x0000B8, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_ConstructPlaystyleDescriptorText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, K2Node_Select_Default) == 0x0000C0, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_IsInRotation_ReturnValue) == 0x0000D8, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_IsInRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, K2Node_Select_Default_1) == 0x0000D9, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_HasTag_ReturnValue) == 0x0000DA, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData) == 0x0000E0, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_GetKeywordDataFromPotentialTags_ReturnValue) == 0x0001D0, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_GetKeywordDataFromPotentialTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, K2Node_Select_Default_2) == 0x0001D1, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, K2Node_Select_Default_3) == 0x0001D8, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData_1) == 0x0001F0, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_GetKeywordDataFromPotentialTags_ReturnValue_1) == 0x0002E0, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_GetKeywordDataFromPotentialTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, K2Node_Select_Default_4) == 0x0002E8, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData_2) == 0x000300, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_GetKeywordDataFromPotentialTags_OutKeywordData_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_GetKeywordDataFromPotentialTags_ReturnValue_2) == 0x0003F0, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_GetKeywordDataFromPotentialTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, K2Node_Select_Default_5) == 0x0003F8, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet, CallFunc_GetItemDescription_ReturnValue) == 0x000410, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnGodSet::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsGodOverviewWidget.WBP_C_GodDetailsGodOverviewWidget_C.OnHide
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDetailsGodOverviewWidget_C_OnHide final
{
public:
	class UHWStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodOverviewWidget_C_OnHide) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodOverviewWidget_C_OnHide");
static_assert(sizeof(WBP_C_GodDetailsGodOverviewWidget_C_OnHide) == 0x000008, "Wrong size on WBP_C_GodDetailsGodOverviewWidget_C_OnHide");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnHide, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnHide::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsGodOverviewWidget.WBP_C_GodDetailsGodOverviewWidget_C.OnShown
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodDetailsGodOverviewWidget_C_OnShown final
{
public:
	class UHWStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWPlayerInfo*                          CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHWFoundersOwnershipLevel                     CallFunc_GetPlayerFoundersOwnershipLevel_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodOverviewWidget_C_OnShown) == 0x000008, "Wrong alignment on WBP_C_GodDetailsGodOverviewWidget_C_OnShown");
static_assert(sizeof(WBP_C_GodDetailsGodOverviewWidget_C_OnShown) == 0x000018, "Wrong size on WBP_C_GodDetailsGodOverviewWidget_C_OnShown");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnShown, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnShown::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnShown, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000008, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnShown::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnShown, CallFunc_GetPlayerFoundersOwnershipLevel_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnShown::CallFunc_GetPlayerFoundersOwnershipLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_OnShown, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_OnShown::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsGodOverviewWidget.WBP_C_GodDetailsGodOverviewWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodDetailsGodOverviewWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsGodOverviewWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_GodDetailsGodOverviewWidget_C_PreConstruct");
static_assert(sizeof(WBP_C_GodDetailsGodOverviewWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_GodDetailsGodOverviewWidget_C_PreConstruct");
static_assert(offsetof(WBP_C_GodDetailsGodOverviewWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_GodDetailsGodOverviewWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

