#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_LobbyModelPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_LobbyModelPlayer.WBP_S_LobbyModelPlayer_C
// 0x0170 (0x0830 - 0x06C0)
class UWBP_S_LobbyModelPlayer_C final : public UHWModelPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               HitAreaImage;                                      // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 PreviewActorClass;                                 // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_6D8[0x8];                                      // 0x06D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PreviewActorSpawnTransform;                        // 0x06E0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UClass*                                 DefaultPreviewActorClass;                          // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHWSkinnablePreviewActor*               God_Preview_Actor;                                 // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          UsingParamPreviewActor;                            // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkinItem*                            CurrentSkinItem;                                   // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UHWCharacterItem*                       CurrentGodItem;                                    // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsPlaying;                                         // 0x0768(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWCollectionItem*                      CurrentPreviewItem;                                // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class AHWSkeletalMeshActor*                   ItemSkeletalMesh;                                  // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsMouseDown;                                       // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_781[0x7];                                      // 0x0781(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EHWCollectionItemType, struct FTransform> OffsetTransform;                                  // 0x0788(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNiagaraComponent*                      NiagaraParticle;                                   // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FTimerHandle                           EffectTimerHandle;                                 // 0x07E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                        TeleportCompletionDelay;                           // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TeleportReplayDelay;                               // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        JumpStampReplayDelay;                              // 0x07F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GlobalEmoteReplayDelay;                            // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GlobalEmoteScale;                                  // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TeleporterModelOffset;                             // 0x0810(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnchorComponentToPedestal(class USceneComponent* SceneComponent);
	void Construct();
	void DestoryActors(bool PlayerModel, bool ItemPreview, bool NiagaraParticle_0);
	void Destruct();
	void ExecuteUbergraph_WBP_S_LobbyModelPlayer(int32 EntryPoint);
	void GetPreviewActorLocation(class FName PreviewActorTagName, bool* FoundActor);
	void HandleMouseMoveRotation(float Direction);
	void HandleRotatePreviewAction();
	void HandleRotatePreviewActionHeld(float HoldPercent, int32 Direction);
	void HideItemMesh();
	void LoadAndPlayModel();
	void LoadSkinnableActor(class UHWSkinItem* SkinItem, class FName LobbyLocation, bool* NeedsToLoadSkins);
	void OnNewApparelApplicationFinished();
	void OnSelectedCharacterSkinLoaded();
	void OnSelectedItemSkinLoaded();
	void PlayGlobalEmoteVFX();
	void PlayJumpStampVFX();
	void PlayPreview(class UHWCollectionItem* PreviewCollectionItem, class FName PreviewActorLocationTagName, class AHWSkinnablePreviewActor* SkinnablePreviewActor, class FName LobbyLocationTag);
	void PlayTeleportComplete();
	void PlayTeleportVFX();
	void PlayWard();
	void PreviewRotate(double Direction);
	void StopPreview();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_LobbyModelPlayer_C">();
	}
	static class UWBP_S_LobbyModelPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_LobbyModelPlayer_C>();
	}
};
static_assert(alignof(UWBP_S_LobbyModelPlayer_C) == 0x000010, "Wrong alignment on UWBP_S_LobbyModelPlayer_C");
static_assert(sizeof(UWBP_S_LobbyModelPlayer_C) == 0x000830, "Wrong size on UWBP_S_LobbyModelPlayer_C");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, UberGraphFrame) == 0x0006C0, "Member 'UWBP_S_LobbyModelPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, HitAreaImage) == 0x0006C8, "Member 'UWBP_S_LobbyModelPlayer_C::HitAreaImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, PreviewActorClass) == 0x0006D0, "Member 'UWBP_S_LobbyModelPlayer_C::PreviewActorClass' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, PreviewActorSpawnTransform) == 0x0006E0, "Member 'UWBP_S_LobbyModelPlayer_C::PreviewActorSpawnTransform' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, DefaultPreviewActorClass) == 0x000740, "Member 'UWBP_S_LobbyModelPlayer_C::DefaultPreviewActorClass' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, God_Preview_Actor) == 0x000748, "Member 'UWBP_S_LobbyModelPlayer_C::God_Preview_Actor' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, UsingParamPreviewActor) == 0x000750, "Member 'UWBP_S_LobbyModelPlayer_C::UsingParamPreviewActor' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, CurrentSkinItem) == 0x000758, "Member 'UWBP_S_LobbyModelPlayer_C::CurrentSkinItem' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, CurrentGodItem) == 0x000760, "Member 'UWBP_S_LobbyModelPlayer_C::CurrentGodItem' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, IsPlaying) == 0x000768, "Member 'UWBP_S_LobbyModelPlayer_C::IsPlaying' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, CurrentPreviewItem) == 0x000770, "Member 'UWBP_S_LobbyModelPlayer_C::CurrentPreviewItem' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, ItemSkeletalMesh) == 0x000778, "Member 'UWBP_S_LobbyModelPlayer_C::ItemSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, IsMouseDown) == 0x000780, "Member 'UWBP_S_LobbyModelPlayer_C::IsMouseDown' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, OffsetTransform) == 0x000788, "Member 'UWBP_S_LobbyModelPlayer_C::OffsetTransform' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, NiagaraParticle) == 0x0007D8, "Member 'UWBP_S_LobbyModelPlayer_C::NiagaraParticle' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, EffectTimerHandle) == 0x0007E0, "Member 'UWBP_S_LobbyModelPlayer_C::EffectTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, TeleportCompletionDelay) == 0x0007E8, "Member 'UWBP_S_LobbyModelPlayer_C::TeleportCompletionDelay' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, TeleportReplayDelay) == 0x0007F0, "Member 'UWBP_S_LobbyModelPlayer_C::TeleportReplayDelay' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, JumpStampReplayDelay) == 0x0007F8, "Member 'UWBP_S_LobbyModelPlayer_C::JumpStampReplayDelay' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, GlobalEmoteReplayDelay) == 0x000800, "Member 'UWBP_S_LobbyModelPlayer_C::GlobalEmoteReplayDelay' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, GlobalEmoteScale) == 0x000808, "Member 'UWBP_S_LobbyModelPlayer_C::GlobalEmoteScale' has a wrong offset!");
static_assert(offsetof(UWBP_S_LobbyModelPlayer_C, TeleporterModelOffset) == 0x000810, "Member 'UWBP_S_LobbyModelPlayer_C::TeleporterModelOffset' has a wrong offset!");

}

