#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_RoleFilterWidget

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStore_RoleFilterWidget.WBP_G_V2_ItemStore_RoleFilterWidget_C.ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget");
static_assert(sizeof(WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget) == 0x000020, "Wrong size on WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_G_V2_ItemStore_RoleFilterWidget.WBP_G_V2_ItemStore_RoleFilterWidget_C.Update Keybind Display
// 0x0007 (0x0007 - 0x0000)
struct WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display");
static_assert(sizeof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display) == 0x000007, "Wrong size on WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display, InputState) == 0x000000, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display::InputState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display, Temp_byte_Variable_4) == 0x000005, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display, K2Node_Select_Default) == 0x000006, "Member 'WBP_G_V2_ItemStore_RoleFilterWidget_C_Update_Keybind_Display::K2Node_Select_Default' has a wrong offset!");

}

