#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_TooltipItem_Stat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V1_TooltipItem_Stat.WBP_G_V1_TooltipItem_Stat_C.DisplayStatIcon
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V1_TooltipItem_Stat_C_DisplayStatIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              StatIcon_0;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatIcon) == 0x000008, "Wrong alignment on WBP_G_V1_TooltipItem_Stat_C_DisplayStatIcon");
static_assert(sizeof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatIcon) == 0x000028, "Wrong size on WBP_G_V1_TooltipItem_Stat_C_DisplayStatIcon");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatIcon, StatIcon_0) == 0x000000, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatIcon::StatIcon_0' has a wrong offset!");

// Function WBP_G_V1_TooltipItem_Stat.WBP_G_V1_TooltipItem_Stat_C.DisplayStatTags
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V1_TooltipItem_Stat_C_DisplayStatTags final
{
public:
	struct FGameplayTagContainer                  StatTags;                                          // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatTags) == 0x000008, "Wrong alignment on WBP_G_V1_TooltipItem_Stat_C_DisplayStatTags");
static_assert(sizeof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatTags) == 0x000020, "Wrong size on WBP_G_V1_TooltipItem_Stat_C_DisplayStatTags");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatTags, StatTags) == 0x000000, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatTags::StatTags' has a wrong offset!");

// Function WBP_G_V1_TooltipItem_Stat.WBP_G_V1_TooltipItem_Stat_C.DisplayStatText
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V1_TooltipItem_Stat_C_DisplayStatText final
{
public:
	class FText                                   StatText;                                          // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatText) == 0x000008, "Wrong alignment on WBP_G_V1_TooltipItem_Stat_C_DisplayStatText");
static_assert(sizeof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatText) == 0x000018, "Wrong size on WBP_G_V1_TooltipItem_Stat_C_DisplayStatText");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatText, StatText) == 0x000000, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatText::StatText' has a wrong offset!");

// Function WBP_G_V1_TooltipItem_Stat.WBP_G_V1_TooltipItem_Stat_C.DisplayStatValue
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue final
{
public:
	float                                         StatValue_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ValueText;                                         // 0x0008(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue) == 0x000008, "Wrong alignment on WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue");
static_assert(sizeof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue) == 0x0000B8, "Wrong size on WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue, StatValue_0) == 0x000000, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue::StatValue_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue, ValueText) == 0x000008, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue::ValueText' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000020, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0000B0, "Member 'WBP_G_V1_TooltipItem_Stat_C_DisplayStatValue::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

}

