#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerContextMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C
// 0x00A0 (0x06C8 - 0x0628)
class UWBP_S_PlayerContextMenu_C final : public UHWPlayerContextMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0628(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_PlayerContextMenuEntry_C*        ActivateBoostEntry;                                // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        BackEntry;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         ContentBox;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        MuteAllEntry;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        MutePingsEntry;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        MuteTextEntry;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        MuteVGSEntry;                                      // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        MuteVoiceEntry;                                    // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        ReportPlayerEntry;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        TradeGodsEntry;                                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        TradeRolesEntry;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerContextMenuEntry_C*        ViewProfileEntry;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            BackgroundColorEven;                               // 0x0698(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            BackgroundColorOdd;                                // 0x06AC(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             SFXGameMenuOpen;                                   // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WBP_S_PlayerContextMenu(int32 EntryPoint);
	void InitializeEntryWidgets();
	void InitializeWidget();
	void OnHide();
	void OnShown();
	void PlayMenuOpenSFX();
	void PreConstruct(bool IsDesignTime);
	void SetEntryBackgroundColors();
	void SetupEntryBindings();
	void ShowContextMenu(class URH_PlayerInfo* PlayerInfo, const struct FGeometry& ReferenceGeometry);
	void UpdateEntryVisibility();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PlayerContextMenu_C">();
	}
	static class UWBP_S_PlayerContextMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PlayerContextMenu_C>();
	}
};
static_assert(alignof(UWBP_S_PlayerContextMenu_C) == 0x000008, "Wrong alignment on UWBP_S_PlayerContextMenu_C");
static_assert(sizeof(UWBP_S_PlayerContextMenu_C) == 0x0006C8, "Wrong size on UWBP_S_PlayerContextMenu_C");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, UberGraphFrame) == 0x000628, "Member 'UWBP_S_PlayerContextMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, ActivateBoostEntry) == 0x000630, "Member 'UWBP_S_PlayerContextMenu_C::ActivateBoostEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, BackEntry) == 0x000638, "Member 'UWBP_S_PlayerContextMenu_C::BackEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, ContentBox) == 0x000640, "Member 'UWBP_S_PlayerContextMenu_C::ContentBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, MuteAllEntry) == 0x000648, "Member 'UWBP_S_PlayerContextMenu_C::MuteAllEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, MutePingsEntry) == 0x000650, "Member 'UWBP_S_PlayerContextMenu_C::MutePingsEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, MuteTextEntry) == 0x000658, "Member 'UWBP_S_PlayerContextMenu_C::MuteTextEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, MuteVGSEntry) == 0x000660, "Member 'UWBP_S_PlayerContextMenu_C::MuteVGSEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, MuteVoiceEntry) == 0x000668, "Member 'UWBP_S_PlayerContextMenu_C::MuteVoiceEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, PlayerNameDisplay) == 0x000670, "Member 'UWBP_S_PlayerContextMenu_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, ReportPlayerEntry) == 0x000678, "Member 'UWBP_S_PlayerContextMenu_C::ReportPlayerEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, TradeGodsEntry) == 0x000680, "Member 'UWBP_S_PlayerContextMenu_C::TradeGodsEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, TradeRolesEntry) == 0x000688, "Member 'UWBP_S_PlayerContextMenu_C::TradeRolesEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, ViewProfileEntry) == 0x000690, "Member 'UWBP_S_PlayerContextMenu_C::ViewProfileEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, BackgroundColorEven) == 0x000698, "Member 'UWBP_S_PlayerContextMenu_C::BackgroundColorEven' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, BackgroundColorOdd) == 0x0006AC, "Member 'UWBP_S_PlayerContextMenu_C::BackgroundColorOdd' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerContextMenu_C, SFXGameMenuOpen) == 0x0006C0, "Member 'UWBP_S_PlayerContextMenu_C::SFXGameMenuOpen' has a wrong offset!");

}

