#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RegionSelect

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RegionSelect.WBP_RegionSelect_C
// 0x0080 (0x0638 - 0x05B8)
class UWBP_RegionSelect_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnShow;                                            // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Decro;                                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             RegionScrollBox;                                   // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title_2;                                           // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModalPopupContainer_C*             WBP_ModalPopupContainer;                           // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnRegionSelected;                                  // 0x05F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRegionSelectEntriesCreated;                      // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UWBP_RegionSelect_Entry_C*>      Region_Select_Array;                               // 0x0610(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bForceSelection;                                   // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ShowSFX;                                           // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEmbeddedScreen;                                   // 0x0634(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ModalPopupContainer_K2Node_ComponentBoundEvent_0_CloseButtonClicked__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_RegionSelect(int32 EntryPoint);
	void GetRegionSelectEntries(TArray<class UWBP_RegionSelect_Entry_C*>* RegionSelectEntries);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	bool IsCustomLobbyRegionSelect();
	void LoginState(ERHLoginState LoginState_0);
	bool NavigateBack();
	void OnChildButtonSelectedRegion(const class FString& RegionId);
	void OnShown();
	void Populate_Regions();
	void PreConstruct(bool IsDesignTime);
	void SetAllowCloseButton(bool bAllow);
	void SetUpStandaloneNavigation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_RegionSelect_C">();
	}
	static class UWBP_RegionSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RegionSelect_C>();
	}
};
static_assert(alignof(UWBP_RegionSelect_C) == 0x000008, "Wrong alignment on UWBP_RegionSelect_C");
static_assert(sizeof(UWBP_RegionSelect_C) == 0x000638, "Wrong size on UWBP_RegionSelect_C");
static_assert(offsetof(UWBP_RegionSelect_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_RegionSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, OnShow) == 0x0005C0, "Member 'UWBP_RegionSelect_C::OnShow' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, Decro) == 0x0005C8, "Member 'UWBP_RegionSelect_C::Decro' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, RegionScrollBox) == 0x0005D0, "Member 'UWBP_RegionSelect_C::RegionScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, Title) == 0x0005D8, "Member 'UWBP_RegionSelect_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, Title_2) == 0x0005E0, "Member 'UWBP_RegionSelect_C::Title_2' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, WBP_ModalPopupContainer) == 0x0005E8, "Member 'UWBP_RegionSelect_C::WBP_ModalPopupContainer' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, OnRegionSelected) == 0x0005F0, "Member 'UWBP_RegionSelect_C::OnRegionSelected' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, OnRegionSelectEntriesCreated) == 0x000600, "Member 'UWBP_RegionSelect_C::OnRegionSelectEntriesCreated' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, Region_Select_Array) == 0x000610, "Member 'UWBP_RegionSelect_C::Region_Select_Array' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, bForceSelection) == 0x000620, "Member 'UWBP_RegionSelect_C::bForceSelection' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, ShowSFX) == 0x000628, "Member 'UWBP_RegionSelect_C::ShowSFX' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, NewVar_0) == 0x000630, "Member 'UWBP_RegionSelect_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_RegionSelect_C, bEmbeddedScreen) == 0x000634, "Member 'UWBP_RegionSelect_C::bEmbeddedScreen' has a wrong offset!");

}

