#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommandButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CommandButton.WBP_CommandButton_C.ExecuteUbergraph_WBP_CommandButton
// 0x0004 (0x0004 - 0x0000)
struct WBP_CommandButton_C_ExecuteUbergraph_WBP_CommandButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommandButton_C_ExecuteUbergraph_WBP_CommandButton) == 0x000004, "Wrong alignment on WBP_CommandButton_C_ExecuteUbergraph_WBP_CommandButton");
static_assert(sizeof(WBP_CommandButton_C_ExecuteUbergraph_WBP_CommandButton) == 0x000004, "Wrong size on WBP_CommandButton_C_ExecuteUbergraph_WBP_CommandButton");
static_assert(offsetof(WBP_CommandButton_C_ExecuteUbergraph_WBP_CommandButton, EntryPoint) == 0x000000, "Member 'WBP_CommandButton_C_ExecuteUbergraph_WBP_CommandButton::EntryPoint' has a wrong offset!");

// Function WBP_CommandButton.WBP_CommandButton_C.Initialize
// 0x0038 (0x0038 - 0x0000)
struct WBP_CommandButton_C_Initialize final
{
public:
	class FString                                 CommandName_0;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Command_0;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(WBP_CommandButton_C_Initialize) == 0x000008, "Wrong alignment on WBP_CommandButton_C_Initialize");
static_assert(sizeof(WBP_CommandButton_C_Initialize) == 0x000038, "Wrong size on WBP_CommandButton_C_Initialize");
static_assert(offsetof(WBP_CommandButton_C_Initialize, CommandName_0) == 0x000000, "Member 'WBP_CommandButton_C_Initialize::CommandName_0' has a wrong offset!");
static_assert(offsetof(WBP_CommandButton_C_Initialize, Command_0) == 0x000010, "Member 'WBP_CommandButton_C_Initialize::Command_0' has a wrong offset!");
static_assert(offsetof(WBP_CommandButton_C_Initialize, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_CommandButton_C_Initialize::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

