#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_AccoladePortrait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_AccoladePortrait.WBP_G_V2_AccoladePortrait_C
// 0x0090 (0x0688 - 0x05F8)
class UWBP_G_V2_AccoladePortrait_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               InnerStroke;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               KilledSlash;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               KillerIcon;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             MainWrapper;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OutlineStroke;                                     // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PortraitCircle;                                    // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Width;                                             // 0x0630(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Height;                                            // 0x0638(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FHWEventCharacter                      CachedEventCharacter;                              // 0x0640(0x003C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               IconMI;                                            // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_G_V2_AccoladePortrait(int32 EntryPoint);
	void OnCharacterItemLoaded(const struct FPrimaryAssetId& PrimaryAssetId, const class UHWCharacterItem* CharacterItem);
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void SetDisplayEventCharacter(const struct FHWEventCharacter& EventCharacter, bool bKilled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_AccoladePortrait_C">();
	}
	static class UWBP_G_V2_AccoladePortrait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_AccoladePortrait_C>();
	}
};
static_assert(alignof(UWBP_G_V2_AccoladePortrait_C) == 0x000008, "Wrong alignment on UWBP_G_V2_AccoladePortrait_C");
static_assert(sizeof(UWBP_G_V2_AccoladePortrait_C) == 0x000688, "Wrong size on UWBP_G_V2_AccoladePortrait_C");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_V2_AccoladePortrait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, InnerStroke) == 0x000600, "Member 'UWBP_G_V2_AccoladePortrait_C::InnerStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, KilledSlash) == 0x000608, "Member 'UWBP_G_V2_AccoladePortrait_C::KilledSlash' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, KillerIcon) == 0x000610, "Member 'UWBP_G_V2_AccoladePortrait_C::KillerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, MainWrapper) == 0x000618, "Member 'UWBP_G_V2_AccoladePortrait_C::MainWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, OutlineStroke) == 0x000620, "Member 'UWBP_G_V2_AccoladePortrait_C::OutlineStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, PortraitCircle) == 0x000628, "Member 'UWBP_G_V2_AccoladePortrait_C::PortraitCircle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, Width) == 0x000630, "Member 'UWBP_G_V2_AccoladePortrait_C::Width' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, Height) == 0x000638, "Member 'UWBP_G_V2_AccoladePortrait_C::Height' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, CachedEventCharacter) == 0x000640, "Member 'UWBP_G_V2_AccoladePortrait_C::CachedEventCharacter' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_AccoladePortrait_C, IconMI) == 0x000680, "Member 'UWBP_G_V2_AccoladePortrait_C::IconMI' has a wrong offset!");

}

