#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodStats_GodStatEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodStats_GodStatEntry.WBP_G_V2_GodStats_GodStatEntry_C.ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry) == 0x000004, "Wrong alignment on WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry");
static_assert(sizeof(WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry) == 0x000008, "Wrong size on WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry, K2Node_Event_bShow) == 0x000004, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_ExecuteUbergraph_WBP_G_V2_GodStats_GodStatEntry::K2Node_Event_bShow' has a wrong offset!");

// Function WBP_G_V2_GodStats_GodStatEntry.WBP_G_V2_GodStats_GodStatEntry_C.InitializeStat
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat final
{
public:
	TArray<struct FGameplayAttribute>             GameplayAttributes;                                // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FSlateBrush                            StatIcon;                                          // 0x0010(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         MinimumFractionalDigitsToDisplay;                  // 0x00E0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaximumFractionalDigitsToDisplay;                  // 0x00E4(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat) == 0x000010, "Wrong alignment on WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat");
static_assert(sizeof(WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat) == 0x0000F0, "Wrong size on WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat, GameplayAttributes) == 0x000000, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat::GameplayAttributes' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat, StatIcon) == 0x000010, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat::StatIcon' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat, MinimumFractionalDigitsToDisplay) == 0x0000E0, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat::MinimumFractionalDigitsToDisplay' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat, MaximumFractionalDigitsToDisplay) == 0x0000E4, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_InitializeStat::MaximumFractionalDigitsToDisplay' has a wrong offset!");

// Function WBP_G_V2_GodStats_GodStatEntry.WBP_G_V2_GodStats_GodStatEntry_C.SetDisplayValue
// 0x0090 (0x0090 - 0x0000)
struct WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCharacterStatBuffStatus                    BuffStatus;                                        // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCharacterStatBuffStatus                    Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCharacterStatBuffStatus                    Temp_byte_Variable_4;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCharacterStatBuffStatus                    Temp_byte_Variable_8;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0048(0x0018)()
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0070(0x0014)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue) == 0x000008, "Wrong alignment on WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue");
static_assert(sizeof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue) == 0x000090, "Wrong size on WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, NewValue) == 0x000000, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, BuffStatus) == 0x000004, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::BuffStatus' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_struct_Variable) == 0x000008, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable) == 0x000028, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable_1) == 0x000029, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable_2) == 0x00002A, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable_3) == 0x00002B, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable_4) == 0x00002C, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable_5) == 0x00002D, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable_6) == 0x00002E, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable_7) == 0x00002F, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_struct_Variable_2) == 0x000030, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, Temp_byte_Variable_8) == 0x000040, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000048, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, K2Node_Select_Default) == 0x000060, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, K2Node_MakeStruct_SlateColor) == 0x000070, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, K2Node_Select_Default_1) == 0x000084, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, K2Node_Select_Default_2) == 0x000085, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000088, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_SetDisplayValue::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_GodStats_GodStatEntry.WBP_G_V2_GodStats_GodStatEntry_C.UpdateStatNameDisplay
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodStats_GodStatEntry_C_UpdateStatNameDisplay final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodStats_GodStatEntry_C_UpdateStatNameDisplay) == 0x000001, "Wrong alignment on WBP_G_V2_GodStats_GodStatEntry_C_UpdateStatNameDisplay");
static_assert(sizeof(WBP_G_V2_GodStats_GodStatEntry_C_UpdateStatNameDisplay) == 0x000001, "Wrong size on WBP_G_V2_GodStats_GodStatEntry_C_UpdateStatNameDisplay");
static_assert(offsetof(WBP_G_V2_GodStats_GodStatEntry_C_UpdateStatNameDisplay, bShow) == 0x000000, "Member 'WBP_G_V2_GodStats_GodStatEntry_C_UpdateStatNameDisplay::bShow' has a wrong offset!");

}

