#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_EquipmentPopupDisplayWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_EquipmentPopupDisplayWidget.WBP_G_V2_EquipmentPopupDisplayWidget_C.DisplayWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget final
{
public:
	class UHWEquipmentPopupWidget*                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget) == 0x000008, "Wrong alignment on WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget");
static_assert(sizeof(WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget) == 0x000028, "Wrong size on WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget");
static_assert(offsetof(WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget, Widget) == 0x000000, "Member 'WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000020, "Member 'WBP_G_V2_EquipmentPopupDisplayWidget_C_DisplayWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

}

