#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_Store_CurrencyPurchase

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_C_Store_CurrencyPurchase.WBP_C_Store_CurrencyPurchase_C.BP_OnHandleBackAction
// 0x0002 (0x0002 - 0x0000)
struct WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction) == 0x000002, "Wrong size on WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction, CallFunc_RemoveViewRoute_ReturnValue) == 0x000001, "Member 'WBP_C_Store_CurrencyPurchase_C_BP_OnHandleBackAction::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_C_Store_CurrencyPurchase.WBP_C_Store_CurrencyPurchase_C.OnAddedEntryWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_Store_CurrencyPurchase_C_OnAddedEntryWidget final
{
public:
	class UHWCurrencyPurchaseEntryWidget*         EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_Store_CurrencyPurchase_C_OnAddedEntryWidget) == 0x000008, "Wrong alignment on WBP_C_Store_CurrencyPurchase_C_OnAddedEntryWidget");
static_assert(sizeof(WBP_C_Store_CurrencyPurchase_C_OnAddedEntryWidget) == 0x000008, "Wrong size on WBP_C_Store_CurrencyPurchase_C_OnAddedEntryWidget");
static_assert(offsetof(WBP_C_Store_CurrencyPurchase_C_OnAddedEntryWidget, EntryWidget) == 0x000000, "Member 'WBP_C_Store_CurrencyPurchase_C_OnAddedEntryWidget::EntryWidget' has a wrong offset!");

// Function WBP_C_Store_CurrencyPurchase.WBP_C_Store_CurrencyPurchase_C.OnEntriesPopulated
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_Store_CurrencyPurchase_C_OnEntriesPopulated final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_Store_CurrencyPurchase_C_OnEntriesPopulated) == 0x000001, "Wrong alignment on WBP_C_Store_CurrencyPurchase_C_OnEntriesPopulated");
static_assert(sizeof(WBP_C_Store_CurrencyPurchase_C_OnEntriesPopulated) == 0x000001, "Wrong size on WBP_C_Store_CurrencyPurchase_C_OnEntriesPopulated");
static_assert(offsetof(WBP_C_Store_CurrencyPurchase_C_OnEntriesPopulated, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'WBP_C_Store_CurrencyPurchase_C_OnEntriesPopulated::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_C_Store_CurrencyPurchase.WBP_C_Store_CurrencyPurchase_C.OnRemovedEntryWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_Store_CurrencyPurchase_C_OnRemovedEntryWidget final
{
public:
	class UHWCurrencyPurchaseEntryWidget*         EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_Store_CurrencyPurchase_C_OnRemovedEntryWidget) == 0x000008, "Wrong alignment on WBP_C_Store_CurrencyPurchase_C_OnRemovedEntryWidget");
static_assert(sizeof(WBP_C_Store_CurrencyPurchase_C_OnRemovedEntryWidget) == 0x000008, "Wrong size on WBP_C_Store_CurrencyPurchase_C_OnRemovedEntryWidget");
static_assert(offsetof(WBP_C_Store_CurrencyPurchase_C_OnRemovedEntryWidget, EntryWidget) == 0x000000, "Member 'WBP_C_Store_CurrencyPurchase_C_OnRemovedEntryWidget::EntryWidget' has a wrong offset!");

// Function WBP_C_Store_CurrencyPurchase.WBP_C_Store_CurrencyPurchase_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetContainerDesiredFocusTarget_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget, CallFunc_GetContainerDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_Store_CurrencyPurchase_C_BP_GetDesiredFocusTarget::CallFunc_GetContainerDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

