#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchResultsEntry_Ranked

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.AnimateCurrentRank
// 0x02E8 (0x02E8 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank final
{
public:
	double                                        EndingProgressPercentage;                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0050)(HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0078(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00F0(0x0018)()
	struct FHWSkillRatingDivision                 CallFunc_Array_Get_Item;                           // 0x0108(0x0048)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x01B8(0x0018)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x01E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0200(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0258(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0268(0x0018)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_1;      // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast_2;      // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2;   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2;   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3;   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3;   // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank) == 0x0002E8, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, EndingProgressPercentage) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::EndingProgressPercentage' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000060, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, K2Node_MakeStruct_FormatArgumentData_1) == 0x000078, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Format_ReturnValue) == 0x0000C8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, K2Node_MakeArray_Array_1) == 0x0000E0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Format_ReturnValue_1) == 0x0000F0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Array_Get_Item) == 0x000108, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, K2Node_MakeStruct_FormatArgumentData_2) == 0x000158, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, K2Node_MakeArray_Array_2) == 0x0001A8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Format_ReturnValue_2) == 0x0001B8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x0001D0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0001D8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0001E0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0001E8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, K2Node_MakeStruct_FormatArgumentData_3) == 0x000200, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000250, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, K2Node_MakeArray_Array_3) == 0x000258, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Format_ReturnValue_3) == 0x000268, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000280, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_SetPercent_InPercent_ImplicitCast_1) == 0x000284, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_SetPercent_InPercent_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000288, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000290, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_SetPercent_InPercent_ImplicitCast_2) == 0x000298, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_SetPercent_InPercent_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0002A0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x0002A8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x0002B0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x0002B8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0002C0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2) == 0x0002C8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2) == 0x0002D0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3) == 0x0002D8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3) == 0x0002E0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateCurrentRank::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.AnimateDivisionChanged
// 0x0014 (0x0014 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged) == 0x000004, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged) == 0x000014, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged, Temp_int_Variable) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged, Temp_int_Variable_1) == 0x000004, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000009, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateDivisionChanged::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.AnimateRankUp
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateRankUp final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateRankUp) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateRankUp");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateRankUp) == 0x000008, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateRankUp");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateRankUp, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_AnimateRankUp::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.DisplayProgress
// 0x0048 (0x0048 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress) == 0x000048, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, Temp_bool_Variable) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, Temp_real_Variable) == 0x000008, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, Temp_real_Variable_1) == 0x000010, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, Temp_real_Variable_2) == 0x000020, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, Temp_real_Variable_3) == 0x000028, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, K2Node_Select_Default) == 0x000030, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, K2Node_Select_Default_1) == 0x000038, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, CallFunc_BooleanOR_ReturnValue) == 0x000040, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000044, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_DisplayProgress::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked
// 0x0024 (0x0024 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked) == 0x000004, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked) == 0x000024, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked, EntryPoint) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_ExecuteUbergraph_WBP_GS_EndOfMatchResultsEntry_Ranked::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.PopulateRankedProgress
// 0x0548 (0x0548 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress final
{
public:
	struct FHWEndOfMatchRankedProgressSource      RankedProgress;                                    // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWSkillRatingDivision                 Temp_struct_Variable;                              // 0x0140(0x0048)()
	bool                                          Temp_bool_Variable_1;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWSkillRatingDivision                 CallFunc_Array_Get_Item;                           // 0x0190(0x0048)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01F0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0240(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0290(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x02A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02B0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x02C8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x02E0(0x0018)()
	struct FHWSkillRatingDivision                 CallFunc_Array_Get_Item_1;                         // 0x02F8(0x0048)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWSkillRatingDivision                 CallFunc_Array_Get_Item_2;                         // 0x0360(0x0048)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWSkillRatingDivision                 K2Node_Select_Default_1;                           // 0x03B8(0x0048)()
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWSkillRatingDivision                 K2Node_Select_Default_2;                           // 0x0408(0x0048)()
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0458(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x04A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x04B8(0x0018)()
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_B_ImplicitCast;      // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotEqual_DoubleDouble_B_ImplicitCast;     // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotEqual_DoubleDouble_A_ImplicitCast;     // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1;   // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2;   // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2;   // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3;   // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3;   // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_4;   // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast_4;   // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress) == 0x000548, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, RankedProgress) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::RankedProgress' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000138, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000139, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x00013A, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, Temp_bool_Variable) == 0x00013B, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, Temp_struct_Variable) == 0x000140, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, Temp_bool_Variable_1) == 0x000188, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, Temp_bool_Variable_2) == 0x000189, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Array_Get_Item) == 0x000190, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001D8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x0001E4, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Abs_ReturnValue) == 0x0001E8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_MakeStruct_FormatArgumentData) == 0x0001F0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_MakeStruct_FormatArgumentData_1) == 0x000240, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_MakeArray_Array) == 0x000290, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_MakeArray_Array_1) == 0x0002A0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Format_ReturnValue) == 0x0002B0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Format_ReturnValue_1) == 0x0002C8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_Select_Default) == 0x0002E0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Array_Get_Item_1) == 0x0002F8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000340, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000348, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000350, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000358, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Array_Get_Item_2) == 0x000360, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0003A8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0003B0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_Select_Default_1) == 0x0003B8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x000400, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_Select_Default_2) == 0x000408, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000450, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_MakeStruct_FormatArgumentData_2) == 0x000458, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, K2Node_MakeArray_Array_2) == 0x0004A8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Format_ReturnValue_2) == 0x0004B8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0004D0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Greater_DoubleDouble_B_ImplicitCast) == 0x0004D8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Greater_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0004E0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_NotEqual_DoubleDouble_B_ImplicitCast) == 0x0004E8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_NotEqual_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_NotEqual_DoubleDouble_A_ImplicitCast) == 0x0004F0, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_NotEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0004F8, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1) == 0x000500, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2) == 0x000508, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000510, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x000518, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2) == 0x000520, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3) == 0x000528, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3) == 0x000530, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_4) == 0x000538, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress, CallFunc_Subtract_DoubleDouble_A_ImplicitCast_4) == 0x000540, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_PopulateRankedProgress::CallFunc_Subtract_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.SFXStartProgress
// 0x0018 (0x0018 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress) == 0x000018, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress, CallFunc_IsPlaying_ReturnValue) == 0x000010, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStartProgress::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.SFXStopProgress
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStopProgress final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStopProgress) == 0x000001, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStopProgress");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStopProgress) == 0x000001, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStopProgress");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStopProgress, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_SFXStopProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchResultsEntry_Ranked.WBP_GS_EndOfMatchResultsEntry_Ranked_C.UpdateDisplay
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay final
{
public:
	struct FHWSkillRatingDivision                 StartingDivision;                                  // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FHWSkillRatingDivision                 TargetDivision;                                    // 0x0048(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0090(0x0018)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay");
static_assert(sizeof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay) == 0x0000B0, "Wrong size on WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay, StartingDivision) == 0x000000, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay::StartingDivision' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay, TargetDivision) == 0x000048, "Member 'WBP_GS_EndOfMatchResultsEntry_Ranked_C_UpdateDisplay::TargetDivision' has a wrong offset!");
