#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_HUDEditor_EntryDropDown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_HUDEditor_EntryDropDown.WBP_G_V1_HUDEditor_EntryDropDown_C
// 0x0058 (0x0660 - 0x0608)
class UWBP_G_V1_HUDEditor_EntryDropDown_C final : public UHWHUDEditorEditableEntryDropDown
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           CustomFieldText;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DisplayTextBlock;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HighlightImage;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Left_Button;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LeftArrow;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Right_Button;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RightArrow;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           Options;                                           // 0x0648(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentSelection;                                  // 0x0658(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V1_HUDEditor_EntryDropDown_Left_Button_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_HUDEditor_EntryDropDown_Left_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_HUDEditor_EntryDropDown_Left_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_HUDEditor_EntryDropDown_Right_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_HUDEditor_EntryDropDown_Right_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V1_HUDEditor_EntryDropDown_Right_Button_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void DisplayedSelectedOptionIndex(int32 SelectedOptionIndex);
	void DisplayFieldName(const class FText& FieldName);
	void DisplayOptions(const TArray<class FText>& Options_0);
	void ExecuteUbergraph_WBP_G_V1_HUDEditor_EntryDropDown(int32 EntryPoint);
	class UWidget* LeftNavigationFromRightButton(EUINavigation Navigation_0);
	class UWidget* RightNavigationFromRightButton(EUINavigation Navigation_0);
	void UpdateSelection(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_HUDEditor_EntryDropDown_C">();
	}
	static class UWBP_G_V1_HUDEditor_EntryDropDown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_HUDEditor_EntryDropDown_C>();
	}
};
static_assert(alignof(UWBP_G_V1_HUDEditor_EntryDropDown_C) == 0x000008, "Wrong alignment on UWBP_G_V1_HUDEditor_EntryDropDown_C");
static_assert(sizeof(UWBP_G_V1_HUDEditor_EntryDropDown_C) == 0x000660, "Wrong size on UWBP_G_V1_HUDEditor_EntryDropDown_C");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, UberGraphFrame) == 0x000608, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, CustomFieldText) == 0x000610, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::CustomFieldText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, DisplayTextBlock) == 0x000618, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::DisplayTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, HighlightImage) == 0x000620, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::HighlightImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, Left_Button) == 0x000628, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::Left_Button' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, LeftArrow) == 0x000630, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, Right_Button) == 0x000638, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::Right_Button' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, RightArrow) == 0x000640, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, Options) == 0x000648, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::Options' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntryDropDown_C, CurrentSelection) == 0x000658, "Member 'UWBP_G_V1_HUDEditor_EntryDropDown_C::CurrentSelection' has a wrong offset!");

}

