#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetailsScreenWidget

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DataTableSkinsCommon_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.AsyncLoadEmoteNiagara
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_AsyncLoadEmoteNiagara final
{
public:
	TSoftObjectPtr<class UNiagaraSystem>          NewParam;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_AsyncLoadEmoteNiagara) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_AsyncLoadEmoteNiagara");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_AsyncLoadEmoteNiagara) == 0x000028, "Wrong size on WBP_C_GodDetailsScreenWidget_C_AsyncLoadEmoteNiagara");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_AsyncLoadEmoteNiagara, NewParam) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_AsyncLoadEmoteNiagara::NewParam' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.AsyncLoadMaterialInstance
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_AsyncLoadMaterialInstance final
{
public:
	TSoftObjectPtr<class UMaterialInstance>       Asset;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_AsyncLoadMaterialInstance) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_AsyncLoadMaterialInstance");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_AsyncLoadMaterialInstance) == 0x000028, "Wrong size on WBP_C_GodDetailsScreenWidget_C_AsyncLoadMaterialInstance");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_AsyncLoadMaterialInstance, Asset) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_AsyncLoadMaterialInstance::Asset' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature final
{
public:
	class UHWWidget*                              Button_Widget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature, Button_Widget) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature::Button_Widget' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.BufferTransitionPlate
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate) == 0x000020, "Wrong size on WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000018, "Member 'WBP_C_GodDetailsScreenWidget_C_BufferTransitionPlate::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.CreateAnimPreviewActorFromSkin
// 0x0068 (0x0068 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin final
{
public:
	class UHWSkinItem*                            SkinItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PreviewActorClass;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_GetPreviewActor_ReturnValue;              // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsHWSkinnable_Preview_Actor; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWSkinnablePreviewActor*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin) == 0x000068, "Wrong size on WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, SkinItem) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::SkinItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, PreviewActorClass) == 0x000008, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::PreviewActorClass' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, CallFunc_IsValid_ReturnValue_2) == 0x000012, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, CallFunc_GetPreviewActor_ReturnValue) == 0x000018, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::CallFunc_GetPreviewActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000040, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, K2Node_ClassDynamicCast_AsHWSkinnable_Preview_Actor) == 0x000048, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::K2Node_ClassDynamicCast_AsHWSkinnable_Preview_Actor' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, K2Node_ClassDynamicCast_bSuccess) == 0x000050, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, CallFunc_IsValidClass_ReturnValue) == 0x000051, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000058, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin, CallFunc_FinishSpawningActor_ReturnValue) == 0x000060, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateAnimPreviewActorFromSkin::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.CreateGodPreviewActorFromSkin
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin final
{
public:
	class UHWSkinItem*                            SkinItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PreviewActorClass;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWApparelComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsApparelApplicationPending_ReturnValue;  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IHWInterface_Skinnable> CallFunc_GetCurrentSkin_self_CastInput;           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UHWSkinItem*                      CallFunc_GetCurrentSkin_ReturnValue;               // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_GetPreviewActor_ReturnValue;              // 0x0060(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class AHWSkinnablePreviewActor*               CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsHWSkinnable_Preview_Actor; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin) == 0x0000A8, "Wrong size on WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, SkinItem) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::SkinItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, PreviewActorClass) == 0x000008, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::PreviewActorClass' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_IsApparelApplicationPending_ReturnValue) == 0x000020, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_IsApparelApplicationPending_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_GetCurrentSkin_self_CastInput) == 0x000028, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_GetCurrentSkin_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_GetCurrentSkin_ReturnValue) == 0x000038, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_GetCurrentSkin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_IsValid_ReturnValue_2) == 0x000051, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x000052, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_IsValidClass_ReturnValue) == 0x000053, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000058, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_GetPreviewActor_ReturnValue) == 0x000060, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_GetPreviewActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000090, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, K2Node_ClassDynamicCast_AsHWSkinnable_Preview_Actor) == 0x000098, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::K2Node_ClassDynamicCast_AsHWSkinnable_Preview_Actor' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin, K2Node_ClassDynamicCast_bSuccess) == 0x0000A0, "Member 'WBP_C_GodDetailsScreenWidget_C_CreateGodPreviewActorFromSkin::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.DelayTickSetCamera
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera) == 0x000018, "Wrong size on WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.DelayTickSetCamera1
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1 final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1) == 0x000018, "Wrong size on WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera1::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.DelayTickSetCamera2
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2 final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue; // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2) == 0x000018, "Wrong size on WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2, CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTickSetCamera2::CallFunc_K2_SetTimerForNextTickDelegate_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.DelayTransitionPlate
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate) == 0x000020, "Wrong size on WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000018, "Member 'WBP_C_GodDetailsScreenWidget_C_DelayTransitionPlate::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");

// Function WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C.ExecuteUbergraph_WBP_C_GodDetailsScreenWidget
// 0x0280 (0x0280 - 0x0000)
struct WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      K2Node_DynamicCast_AsMaterial_Instance;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCollectionItemType                         Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x003C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0044(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x004C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x0054(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x005C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_8;                              // 0x0064(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_9;                              // 0x006C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_10;                             // 0x0074(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_11;                             // 0x007C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_12;                             // 0x0084(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_13;                             // 0x008C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_14;                             // 0x0094(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_15;                             // 0x009C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_16;                             // 0x00A4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_17;                             // 0x00AC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_18;                             // 0x00B4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_19;                             // 0x00BC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_20;                             // 0x00C4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_21;                             // 0x00CC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_22;                             // 0x00D4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_23;                             // 0x00DC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       K2Node_DynamicCast_AsCine_Camera_Actor;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          K2Node_CustomEvent_NewParam;                       // 0x0108(0x0028)(HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWTabBarWidget*                        K2Node_Event_TabBarWidget;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWTabChangeCause                             K2Node_Event_Cause;                                // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0150(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_GodDetailsGodAscensionWidget_C*  K2Node_DynamicCast_AsWBP_C_God_Details_God_Ascension_Widget; // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_GodDetailsGodAscensionWidget_C*  K2Node_DynamicCast_AsWBP_C_God_Details_God_Ascension_Widget_1; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget_1;        // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWSkinItem*                            K2Node_DynamicCast_AsHWSkin_Item;                  // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              K2Node_ComponentBoundEvent_Button_Widget;          // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         K2Node_DynamicCast_AsNiagara_System;               // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01D4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       K2Node_CustomEvent_Asset;                          // 0x0210(0x0028)(HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraSystem>          CallFunc_GetCosmeticNiagaraSystem_ReturnValue;     // 0x0238(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftObjectReference_ReturnValue; // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2; // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWSkinItem*                            K2Node_DynamicCast_AsHWSkin_Item_1;                // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget) == 0x000008, "Wrong alignment on WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget");
static_assert(sizeof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget) == 0x000280, "Wrong size on WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, EntryPoint) == 0x000000, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_object_Variable) == 0x000010, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_AsMaterial_Instance) == 0x000018, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_AsMaterial_Instance' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_byte_Variable) == 0x000021, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable) == 0x000024, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_1) == 0x00002C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_2) == 0x000034, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_3) == 0x00003C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_4) == 0x000044, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_5) == 0x00004C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_6) == 0x000054, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_7) == 0x00005C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_8) == 0x000064, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_9) == 0x00006C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_10) == 0x000074, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_11) == 0x00007C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_12) == 0x000084, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_13) == 0x00008C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_14) == 0x000094, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_15) == 0x00009C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_16) == 0x0000A4, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_17) == 0x0000AC, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_18) == 0x0000B4, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_19) == 0x0000BC, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_20) == 0x0000C4, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_20' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_21) == 0x0000CC, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_21' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_22) == 0x0000D4, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_22' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_name_Variable_23) == 0x0000DC, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_name_Variable_23' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000E8, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0000F0, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_AsCine_Camera_Actor) == 0x0000F8, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_AsCine_Camera_Actor' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_CustomEvent_NewParam) == 0x000108, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000130, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_Event_TabBarWidget) == 0x000140, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_Event_TabBarWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_Event_Index) == 0x000148, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_Event_Cause) == 0x00014C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_Event_Cause' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00014D, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_Select_Default) == 0x000150, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_SwitchInteger_CmpSuccess) == 0x000158, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00015C, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_AsWBP_C_God_Details_God_Ascension_Widget) == 0x000170, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_AsWBP_C_God_Details_God_Ascension_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_bSuccess_2) == 0x000178, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_AsWBP_C_God_Details_God_Ascension_Widget_1) == 0x000180, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_AsWBP_C_God_Details_God_Ascension_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_bSuccess_3) == 0x000188, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, CallFunc_IsValid_ReturnValue) == 0x000189, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x000190, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_ComponentBoundEvent_Button_Widget_1) == 0x000198, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_ComponentBoundEvent_Button_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_AsHWSkin_Item) == 0x0001A0, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_AsHWSkin_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_DynamicCast_bSuccess_4) == 0x0001A8, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, CallFunc_IsValid_ReturnValue_1) == 0x0001A9, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, K2Node_ComponentBoundEvent_Button_Widget) == 0x0001B0, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::K2Node_ComponentBoundEvent_Button_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget, Temp_object_Variable_1) == 0x0001B8, "Member 'WBP_C_GodDetailsScreenWidget_C_ExecuteUbergraph_WBP_C_GodDetailsScreenWidget::Temp_object_Variable_1' has a wrong offset!");
