#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_PlayerProfileScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.BP_OnHandleBackAction
// 0x0003 (0x0003 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_OnHandleBackAction_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction) == 0x000003, "Wrong size on WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction, CallFunc_IsActivated_ReturnValue) == 0x000001, "Member 'WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction, CallFunc_BP_OnHandleBackAction_ReturnValue) == 0x000002, "Member 'WBP_C_PlayerProfileScreen_C_BP_OnHandleBackAction::CallFunc_BP_OnHandleBackAction_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.ExecuteUbergraph_WBP_C_PlayerProfileScreen
// 0x0078 (0x0078 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue_1;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue_2;               // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCollectionItem*                K2Node_Event_TitleItem;                            // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0040(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0058(0x0018)()
	bool                                          CallFunc_AddViewRoute_ReturnValue_3;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen) == 0x000008, "Wrong alignment on WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen) == 0x000078, "Wrong size on WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, EntryPoint) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, Temp_bool_Variable) == 0x000004, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, Temp_text_Variable) == 0x000008, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, CallFunc_AddViewRoute_ReturnValue) == 0x000020, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, CallFunc_AddViewRoute_ReturnValue_1) == 0x000021, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::CallFunc_AddViewRoute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, CallFunc_AddViewRoute_ReturnValue_2) == 0x000022, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::CallFunc_AddViewRoute_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, K2Node_Event_TitleItem) == 0x000028, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::K2Node_Event_TitleItem' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000030, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, CallFunc_GetItemName_ReturnValue) == 0x000040, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, K2Node_Select_Default) == 0x000058, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen, CallFunc_AddViewRoute_ReturnValue_3) == 0x000070, "Member 'WBP_C_PlayerProfileScreen_C_ExecuteUbergraph_WBP_C_PlayerProfileScreen::CallFunc_AddViewRoute_ReturnValue_3' has a wrong offset!");

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.InitializeWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_InitializeWidget final
{
public:
	TArray<EHWCallToActionAffixPath>              K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_GetCTAAffixPaths_ReturnValue;             // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_C_PlayerProfileScreen_C_InitializeWidget");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_InitializeWidget) == 0x000020, "Wrong size on WBP_C_PlayerProfileScreen_C_InitializeWidget");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_InitializeWidget, K2Node_MakeArray_Array) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_InitializeWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_InitializeWidget, CallFunc_GetCTAAffixPaths_ReturnValue) == 0x000010, "Member 'WBP_C_PlayerProfileScreen_C_InitializeWidget::CallFunc_GetCTAAffixPaths_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.OnHide
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_OnHide final
{
public:
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_OnHide) == 0x000001, "Wrong alignment on WBP_C_PlayerProfileScreen_C_OnHide");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_OnHide) == 0x000001, "Wrong size on WBP_C_PlayerProfileScreen_C_OnHide");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnHide, CallFunc_IsActivated_ReturnValue) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_OnHide::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.OnUpdateTitleItem
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_OnUpdateTitleItem final
{
public:
	const class UHWCollectionItem*                TitleItem;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_OnUpdateTitleItem) == 0x000008, "Wrong alignment on WBP_C_PlayerProfileScreen_C_OnUpdateTitleItem");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_OnUpdateTitleItem) == 0x000008, "Wrong size on WBP_C_PlayerProfileScreen_C_OnUpdateTitleItem");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateTitleItem, TitleItem) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateTitleItem::TitleItem' has a wrong offset!");

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.OnUpdateXPProgress
// 0x0158 (0x0158 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress final
{
public:
	int32                                         CurrentProgress;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartValue;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextValue;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevel;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevelNeeded;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevelProgress;                              // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0050)(HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress) == 0x000008, "Wrong alignment on WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress) == 0x000158, "Wrong size on WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CurrentProgress) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CurrentProgress' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, StartValue) == 0x000004, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::StartValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, NextValue) == 0x000008, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::NextValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CurrentLevel) == 0x00000C, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CurrentLevel' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CurrentLevelNeeded) == 0x000010, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CurrentLevelNeeded' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CurrentLevelProgress) == 0x000014, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CurrentLevelProgress' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000020, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000030, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000068, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Subtract_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000070, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000078, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x0000D0, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000D8, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, K2Node_MakeArray_Array) == 0x000128, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_Format_ReturnValue) == 0x000138, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000150, "Member 'WBP_C_PlayerProfileScreen_C_OnUpdateXPProgress::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.OnWalletFocusAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_OnWalletFocusAction final
{
public:
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_OnWalletFocusAction) == 0x000001, "Wrong alignment on WBP_C_PlayerProfileScreen_C_OnWalletFocusAction");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_OnWalletFocusAction) == 0x000001, "Wrong size on WBP_C_PlayerProfileScreen_C_OnWalletFocusAction");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_OnWalletFocusAction, CallFunc_IsActivated_ReturnValue) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_OnWalletFocusAction::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_PlayerProfileScreen_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_PlayerProfileScreen_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

// Function WBP_C_PlayerProfileScreen.WBP_C_PlayerProfileScreen_C.GetViewRedirectOnBackTag
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_PlayerProfileScreen_C_GetViewRedirectOnBackTag final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_PlayerProfileScreen_C_GetViewRedirectOnBackTag) == 0x000004, "Wrong alignment on WBP_C_PlayerProfileScreen_C_GetViewRedirectOnBackTag");
static_assert(sizeof(WBP_C_PlayerProfileScreen_C_GetViewRedirectOnBackTag) == 0x000008, "Wrong size on WBP_C_PlayerProfileScreen_C_GetViewRedirectOnBackTag");
static_assert(offsetof(WBP_C_PlayerProfileScreen_C_GetViewRedirectOnBackTag, ReturnValue) == 0x000000, "Member 'WBP_C_PlayerProfileScreen_C_GetViewRedirectOnBackTag::ReturnValue' has a wrong offset!");

}

