#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodManaBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodManaBar.WBP_G_V2_GodManaBar_C
// 0x0028 (0x0660 - 0x0638)
class UWBP_G_V2_GodManaBar_C final : public UHWCharacterWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2_GodManaAttribute_C*           ManaAttribute;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ManaBarSB;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              SizeOverride;                                      // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_GodManaBar(int32 EntryPoint);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);

	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodManaBar_C">();
	}
	static class UWBP_G_V2_GodManaBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodManaBar_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodManaBar_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodManaBar_C");
static_assert(sizeof(UWBP_G_V2_GodManaBar_C) == 0x000660, "Wrong size on UWBP_G_V2_GodManaBar_C");
static_assert(offsetof(UWBP_G_V2_GodManaBar_C, UberGraphFrame) == 0x000638, "Member 'UWBP_G_V2_GodManaBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodManaBar_C, ManaAttribute) == 0x000640, "Member 'UWBP_G_V2_GodManaBar_C::ManaAttribute' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodManaBar_C, ManaBarSB) == 0x000648, "Member 'UWBP_G_V2_GodManaBar_C::ManaBarSB' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodManaBar_C, SizeOverride) == 0x000650, "Member 'UWBP_G_V2_GodManaBar_C::SizeOverride' has a wrong offset!");

}

