#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_CopyToPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_CopyToPopup.WBP_S_GodBuilder_CopyToPopup_C.BP_OnHandleBackAction
// 0x0002 (0x0002 - 0x0000)
struct WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction) == 0x000002, "Wrong size on WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction, CallFunc_RemoveViewRoute_ReturnValue) == 0x000001, "Member 'WBP_S_GodBuilder_CopyToPopup_C_BP_OnHandleBackAction::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_CopyToPopup.WBP_S_GodBuilder_CopyToPopup_C.DisplayedBuildUpdated
// 0x0090 (0x0090 - 0x0000)
struct WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated final
{
public:
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0000(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated");
static_assert(sizeof(WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated) == 0x000090, "Wrong size on WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated, CallFunc_Conv_StringToText_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated, CallFunc_Format_ReturnValue) == 0x000078, "Member 'WBP_S_GodBuilder_CopyToPopup_C_DisplayedBuildUpdated::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_CopyToPopup.WBP_S_GodBuilder_CopyToPopup_C.ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup");
static_assert(sizeof(WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup) == 0x000018, "Wrong size on WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup, CallFunc_RemoveViewRoute_ReturnValue) == 0x000004, "Member 'WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup, CallFunc_RemoveViewRoute_ReturnValue_1) == 0x000005, "Member 'WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup::CallFunc_RemoveViewRoute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_S_GodBuilder_CopyToPopup_C_ExecuteUbergraph_WBP_S_GodBuilder_CopyToPopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_S_GodBuilder_CopyToPopup.WBP_S_GodBuilder_CopyToPopup_C.HandleGodSelectionChanged
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged final
{
public:
	TArray<class UHWCharacterItem*>               CallFunc_BP_GetCurrentSelectedGods_OutSelectedGods; // 0x0000(0x0010)(ReferenceParm)
	const class UHWCharacterItem*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0088(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0098(0x0018)()
};
static_assert(alignof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged");
static_assert(sizeof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged) == 0x0000B0, "Wrong size on WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged, CallFunc_BP_GetCurrentSelectedGods_OutSelectedGods) == 0x000000, "Member 'WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged::CallFunc_BP_GetCurrentSelectedGods_OutSelectedGods' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged, CallFunc_Array_IsEmpty_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged, CallFunc_GetItemName_ReturnValue) == 0x000020, "Member 'WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged, K2Node_MakeArray_Array) == 0x000088, "Member 'WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged, CallFunc_Format_ReturnValue) == 0x000098, "Member 'WBP_S_GodBuilder_CopyToPopup_C_HandleGodSelectionChanged::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_CopyToPopup.WBP_S_GodBuilder_CopyToPopup_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_CopyToPopup_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

