#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StoreScreenTabEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_StoreScreenTabEntry.WBP_C_StoreScreenTabEntry_C.DisplayIsSelected
// 0x0048 (0x0048 - 0x0000)
struct WBP_C_StoreScreenTabEntry_C_DisplayIsSelected final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWCallToActionDisplayWidget*           CallFunc_GetCTADisplayWidget_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected) == 0x000008, "Wrong alignment on WBP_C_StoreScreenTabEntry_C_DisplayIsSelected");
static_assert(sizeof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected) == 0x000048, "Wrong size on WBP_C_StoreScreenTabEntry_C_DisplayIsSelected");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, Temp_bool_Variable) == 0x000000, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, Temp_struct_Variable) == 0x000004, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, Temp_struct_Variable_1) == 0x00000C, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, CallFunc_GetCTADisplayWidget_ReturnValue) == 0x000018, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::CallFunc_GetCTADisplayWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, K2Node_Select_Default) == 0x000020, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, K2Node_Select_Default_1) == 0x000030, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000038, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_DisplayIsSelected, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000040, "Member 'WBP_C_StoreScreenTabEntry_C_DisplayIsSelected::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function WBP_C_StoreScreenTabEntry.WBP_C_StoreScreenTabEntry_C.ExecuteUbergraph_WBP_C_StoreScreenTabEntry
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry) == 0x000008, "Wrong alignment on WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry");
static_assert(sizeof(WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry) == 0x000018, "Wrong size on WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry, EntryPoint) == 0x000000, "Member 'WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_C_StoreScreenTabEntry_C_ExecuteUbergraph_WBP_C_StoreScreenTabEntry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

