#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Tutorial_ProgressBar_QuestPip

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Prototype_Tutorial_ProgressBar_QuestPip.WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C.ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_QuestNumber;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFinalQuest;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x000C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0020(0x0014)()
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0038(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0090(0x0058)(HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip");
static_assert(sizeof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip) == 0x0000F0, "Wrong size on WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip, EntryPoint) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip, K2Node_CustomEvent_QuestNumber) == 0x000004, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip::K2Node_CustomEvent_QuestNumber' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip, K2Node_CustomEvent_IsFinalQuest) == 0x000008, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip::K2Node_CustomEvent_IsFinalQuest' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip, K2Node_MakeStruct_SlateColor) == 0x00000C, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip, K2Node_MakeStruct_SlateColor_1) == 0x000020, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip, K2Node_MakeStruct_SlateFontInfo) == 0x000038, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip, K2Node_MakeStruct_SlateFontInfo_1) == 0x000090, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_ExecuteUbergraph_WBP_G_Prototype_Tutorial_ProgressBar_QuestPip::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_ProgressBar_QuestPip.WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C.UpdateQuestIcon
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon final
{
public:
	int32                                         QuestNumber_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinalQuest;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetRomanNumeralFromInt_ReturnValue;       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon");
static_assert(sizeof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon) == 0x000040, "Wrong size on WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, QuestNumber_0) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::QuestNumber_0' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, IsFinalQuest) == 0x000004, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::IsFinalQuest' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, Temp_byte_Variable) == 0x000005, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, Temp_byte_Variable_1) == 0x00000C, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, CallFunc_GetRomanNumeralFromInt_ReturnValue) == 0x000010, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::CallFunc_GetRomanNumeralFromInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, Temp_bool_Variable) == 0x000038, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon, K2Node_Select_Default) == 0x000039, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestIcon::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_ProgressBar_QuestPip.WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C.UpdateQuestNumber
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber final
{
public:
	int32                                         QuestNumber_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinalQuest;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber) == 0x000004, "Wrong alignment on WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber");
static_assert(sizeof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber) == 0x000008, "Wrong size on WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber, QuestNumber_0) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber::QuestNumber_0' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber, IsFinalQuest) == 0x000004, "Member 'WBP_G_Prototype_Tutorial_ProgressBar_QuestPip_C_UpdateQuestNumber::IsFinalQuest' has a wrong offset!");

}

