#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonShopPageButton

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_SeasonShopPageButton.WBP_C_SeasonShopPageButton_C.ExecuteUbergraph_WBP_C_SeasonShopPageButton
// 0x0004 (0x0004 - 0x0000)
struct WBP_C_SeasonShopPageButton_C_ExecuteUbergraph_WBP_C_SeasonShopPageButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopPageButton_C_ExecuteUbergraph_WBP_C_SeasonShopPageButton) == 0x000004, "Wrong alignment on WBP_C_SeasonShopPageButton_C_ExecuteUbergraph_WBP_C_SeasonShopPageButton");
static_assert(sizeof(WBP_C_SeasonShopPageButton_C_ExecuteUbergraph_WBP_C_SeasonShopPageButton) == 0x000004, "Wrong size on WBP_C_SeasonShopPageButton_C_ExecuteUbergraph_WBP_C_SeasonShopPageButton");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_ExecuteUbergraph_WBP_C_SeasonShopPageButton, EntryPoint) == 0x000000, "Member 'WBP_C_SeasonShopPageButton_C_ExecuteUbergraph_WBP_C_SeasonShopPageButton::EntryPoint' has a wrong offset!");

// Function WBP_C_SeasonShopPageButton.WBP_C_SeasonShopPageButton_C.Set Selected
// 0x0048 (0x0048 - 0x0000)
struct WBP_C_SeasonShopPageButton_C_Set_Selected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopPageButton_C_Set_Selected) == 0x000008, "Wrong alignment on WBP_C_SeasonShopPageButton_C_Set_Selected");
static_assert(sizeof(WBP_C_SeasonShopPageButton_C_Set_Selected) == 0x000048, "Wrong size on WBP_C_SeasonShopPageButton_C_Set_Selected");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, Selected) == 0x000000, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::Selected' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, Temp_struct_Variable) == 0x000004, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, Temp_struct_Variable_1) == 0x00000C, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, Temp_bool_Variable) == 0x000014, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, Temp_byte_Variable) == 0x000015, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, Temp_byte_Variable_1) == 0x000016, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, K2Node_Select_Default) == 0x000017, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, Temp_bool_Variable_1) == 0x000038, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopPageButton_C_Set_Selected, K2Node_Select_Default_1) == 0x00003C, "Member 'WBP_C_SeasonShopPageButton_C_Set_Selected::K2Node_Select_Default_1' has a wrong offset!");

}

