#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JY_Prototype_PointsDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_JY_Prototype_PointsDetails.WBP_JY_Prototype_PointsDetails_C.ExecuteUbergraph_WBP_JY_Prototype_PointsDetails
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0050)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00B8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0184(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0194(0x0014)()
};
static_assert(alignof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails) == 0x000008, "Wrong alignment on WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails");
static_assert(sizeof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails) == 0x0001A8, "Wrong size on WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, EntryPoint) == 0x000000, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, Temp_bool_Variable) == 0x000004, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, Temp_text_Variable) == 0x000008, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, Temp_text_Variable_1) == 0x000020, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, Temp_bool_Variable_1) == 0x000038, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, Temp_struct_Variable) == 0x00003C, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, Temp_struct_Variable_1) == 0x00004C, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, CallFunc_Greater_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000060, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, K2Node_Select_Default) == 0x0000B8, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, CallFunc_MakeLiteralText_ReturnValue) == 0x0000D0, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000E8, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, K2Node_MakeArray_Array) == 0x000138, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000148, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, CallFunc_Format_ReturnValue) == 0x000158, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000170, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, CallFunc_PlayAnimation_ReturnValue) == 0x000178, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000180, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, K2Node_Select_Default_1) == 0x000184, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails, K2Node_MakeStruct_SlateColor) == 0x000194, "Member 'WBP_JY_Prototype_PointsDetails_C_ExecuteUbergraph_WBP_JY_Prototype_PointsDetails::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_JY_Prototype_PointsDetails.WBP_JY_Prototype_PointsDetails_C.RemoveSelf
// 0x0028 (0x0028 - 0x0000)
struct WBP_JY_Prototype_PointsDetails_C_RemoveSelf final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JY_Prototype_PointsDetails_C_RemoveSelf) == 0x000008, "Wrong alignment on WBP_JY_Prototype_PointsDetails_C_RemoveSelf");
static_assert(sizeof(WBP_JY_Prototype_PointsDetails_C_RemoveSelf) == 0x000028, "Wrong size on WBP_JY_Prototype_PointsDetails_C_RemoveSelf");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_RemoveSelf, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_JY_Prototype_PointsDetails_C_RemoveSelf::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_RemoveSelf, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_JY_Prototype_PointsDetails_C_RemoveSelf::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_RemoveSelf, CallFunc_GetEndTime_ReturnValue) == 0x000018, "Member 'WBP_JY_Prototype_PointsDetails_C_RemoveSelf::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JY_Prototype_PointsDetails_C_RemoveSelf, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_JY_Prototype_PointsDetails_C_RemoveSelf::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

