#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_BuildsList

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "HemingwayUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_BuildsList.WBP_S_GodBuilder_BuildsList_C.ExecuteUbergraph_WBP_S_GodBuilder_BuildsList
// 0x0008 (0x0008 - 0x0000)
struct WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList");
static_assert(sizeof(WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList) == 0x000008, "Wrong size on WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_GodBuilder_BuildsList_C_ExecuteUbergraph_WBP_S_GodBuilder_BuildsList::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildsList.WBP_S_GodBuilder_BuildsList_C.InitDesignLayout
// 0x0030 (0x0030 - 0x0000)
struct WBP_S_GodBuilder_BuildsList_C_InitDesignLayout final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuilderBuildsListEntryWidget*     CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildsList_C_InitDesignLayout");
static_assert(sizeof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout) == 0x000030, "Wrong size on WBP_S_GodBuilder_BuildsList_C_InitDesignLayout");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_BuildsList_C_InitDesignLayout::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout, Temp_int_Variable) == 0x000008, "Member 'WBP_S_GodBuilder_BuildsList_C_InitDesignLayout::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_S_GodBuilder_BuildsList_C_InitDesignLayout::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_BuildsList_C_InitDesignLayout::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_S_GodBuilder_BuildsList_C_InitDesignLayout::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_S_GodBuilder_BuildsList_C_InitDesignLayout::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_InitDesignLayout, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_S_GodBuilder_BuildsList_C_InitDesignLayout::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildsList.WBP_S_GodBuilder_BuildsList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GodBuilder_BuildsList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildsList_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_BuildsList_C_PreConstruct");
static_assert(sizeof(WBP_S_GodBuilder_BuildsList_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_GodBuilder_BuildsList_C_PreConstruct");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_GodBuilder_BuildsList_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildsList.WBP_S_GodBuilder_BuildsList_C.UpdateListDisplay
// 0x0058 (0x0058 - 0x0000)
struct WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay final
{
public:
	EHWBuildsListDisplayType                      BuildsType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWBuildsListDisplayType                      Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWBuildsListDisplayType                      Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay");
static_assert(sizeof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay) == 0x000058, "Wrong size on WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, BuildsType) == 0x000000, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::BuildsType' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, Temp_text_Variable) == 0x000008, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, Temp_text_Variable_1) == 0x000020, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, K2Node_Select_Default) == 0x000038, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay, K2Node_Select_Default_1) == 0x000050, "Member 'WBP_S_GodBuilder_BuildsList_C_UpdateListDisplay::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_S_GodBuilder_BuildsList.WBP_S_GodBuilder_BuildsList_C.BP_GetDesiredFocusTarget
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetContainerDesiredFocusTarget_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget) == 0x000020, "Wrong size on WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget, Temp_bool_Variable) == 0x000008, "Member 'WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget, CallFunc_GetContainerDesiredFocusTarget_ReturnValue) == 0x000010, "Member 'WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget::CallFunc_GetContainerDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget, K2Node_Select_Default) == 0x000018, "Member 'WBP_S_GodBuilder_BuildsList_C_BP_GetDesiredFocusTarget::K2Node_Select_Default' has a wrong offset!");

}

