#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_RewardPopUpDisplayWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GS_RewardPopUpDisplayWidget.WBP_GS_RewardPopUpDisplayWidget_C
// 0x0028 (0x0620 - 0x05F8)
class UWBP_GS_RewardPopUpDisplayWidget_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               HWImage_195;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           INFOtoDisplay;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RewardIcon;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           REWARDTYPECallout;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_GS_RewardPopUpDisplayWidget(int32 EntryPoint);
	void InitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GS_RewardPopUpDisplayWidget_C">();
	}
	static class UWBP_GS_RewardPopUpDisplayWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GS_RewardPopUpDisplayWidget_C>();
	}
};
static_assert(alignof(UWBP_GS_RewardPopUpDisplayWidget_C) == 0x000008, "Wrong alignment on UWBP_GS_RewardPopUpDisplayWidget_C");
static_assert(sizeof(UWBP_GS_RewardPopUpDisplayWidget_C) == 0x000620, "Wrong size on UWBP_GS_RewardPopUpDisplayWidget_C");
static_assert(offsetof(UWBP_GS_RewardPopUpDisplayWidget_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_GS_RewardPopUpDisplayWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GS_RewardPopUpDisplayWidget_C, HWImage_195) == 0x000600, "Member 'UWBP_GS_RewardPopUpDisplayWidget_C::HWImage_195' has a wrong offset!");
static_assert(offsetof(UWBP_GS_RewardPopUpDisplayWidget_C, INFOtoDisplay) == 0x000608, "Member 'UWBP_GS_RewardPopUpDisplayWidget_C::INFOtoDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_GS_RewardPopUpDisplayWidget_C, RewardIcon) == 0x000610, "Member 'UWBP_GS_RewardPopUpDisplayWidget_C::RewardIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GS_RewardPopUpDisplayWidget_C, REWARDTYPECallout) == 0x000618, "Member 'UWBP_GS_RewardPopUpDisplayWidget_C::REWARDTYPECallout' has a wrong offset!");

}

