#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spec_HUDScoreboard_Player_Enemy

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Spec_HUDScoreboard_Player_Enemy.WBP_G_Spec_HUDScoreboard_Player_Enemy_C
// 0x0050 (0x06E0 - 0x0690)
class UWBP_G_Spec_HUDScoreboard_Player_Enemy_C final : public UHWScoreboardPlayerWidget
{
public:
	class UWBP_G_Spec_HUDScoreboard_InventoryGrid_C* ConsumableItems;                                // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodIcon;                                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spec_HUDScoreboard_InventoryGrid_C* Items;                                          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spec_HUDScoreboard_PlayerKDA_C*  KDA;                                               // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_V1_GANumberListener_C*          LevelListener;                                     // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           LevelText;                                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spec_HUDScoreboard_InventoryGrid_C* RelicItem;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spec_HUDScoreboard_InventoryGrid_C* StarterItem;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_Spec_HUDScoreboard_InventoryGrid_C* Talent;                                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      GodIconMI;                                         // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CharacterItemChanged(const class UHWCharacterItem* NewCharacterItem);
	void DisplayCharacterRespawnState(bool bIsAlive, float RemainingRespawnTime);
	void InitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;
	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;
	TArray<class UHWCharacterWidget*> GetCharacterWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Spec_HUDScoreboard_Player_Enemy_C">();
	}
	static class UWBP_G_Spec_HUDScoreboard_Player_Enemy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Spec_HUDScoreboard_Player_Enemy_C>();
	}
};
static_assert(alignof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C) == 0x000008, "Wrong alignment on UWBP_G_Spec_HUDScoreboard_Player_Enemy_C");
static_assert(sizeof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C) == 0x0006E0, "Wrong size on UWBP_G_Spec_HUDScoreboard_Player_Enemy_C");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, ConsumableItems) == 0x000690, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::ConsumableItems' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, GodIcon) == 0x000698, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::GodIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, Items) == 0x0006A0, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::Items' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, KDA) == 0x0006A8, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::KDA' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, LevelListener) == 0x0006B0, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::LevelListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, LevelText) == 0x0006B8, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, RelicItem) == 0x0006C0, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::RelicItem' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, StarterItem) == 0x0006C8, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::StarterItem' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, Talent) == 0x0006D0, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::Talent' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_Player_Enemy_C, GodIconMI) == 0x0006D8, "Member 'UWBP_G_Spec_HUDScoreboard_Player_Enemy_C::GodIconMI' has a wrong offset!");

}

