#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodOmiAttribute

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodOmiAttribute.WBP_G_V2_GodOmiAttribute_C.InitializeWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodOmiAttribute_C_InitializeWidget final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodOmiAttribute_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_G_V2_GodOmiAttribute_C_InitializeWidget");
static_assert(sizeof(WBP_G_V2_GodOmiAttribute_C_InitializeWidget) == 0x000008, "Wrong size on WBP_G_V2_GodOmiAttribute_C_InitializeWidget");
static_assert(offsetof(WBP_G_V2_GodOmiAttribute_C_InitializeWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodOmiAttribute_C_InitializeWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodOmiAttribute.WBP_G_V2_GodOmiAttribute_C.UpdateMaxOmi
// 0x000C (0x000C - 0x0000)
struct WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi final
{
public:
	float                                         OldMaxMana;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewMaxMana;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldAnimate;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi) == 0x000004, "Wrong alignment on WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi");
static_assert(sizeof(WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi) == 0x00000C, "Wrong size on WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi");
static_assert(offsetof(WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi, OldMaxMana) == 0x000000, "Member 'WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi::OldMaxMana' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi, NewMaxMana) == 0x000004, "Member 'WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi::NewMaxMana' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi, bShouldAnimate) == 0x000008, "Member 'WBP_G_V2_GodOmiAttribute_C_UpdateMaxOmi::bShouldAnimate' has a wrong offset!");

}

