#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchDetailsTeam

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GS_EndOfMatchDetailsTeam.WBP_GS_EndOfMatchDetailsTeam_C.ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam
// 0x0060 (0x0060 - 0x0000)
struct WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEndOfMatchLobbyDetailsPlayer*        CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEndOfMatchLobbyDetailsPlayer*        K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Player; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam) == 0x000060, "Wrong size on WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, EntryPoint) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_Less_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_GetAllChildren_ReturnValue) == 0x000030, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Player) == 0x000050, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Player' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_Less_IntInt_ReturnValue_1) == 0x000059, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsTeam::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetailsTeam.WBP_GS_EndOfMatchDetailsTeam_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndOfMatchDetailsTeam_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsTeam_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GS_EndOfMatchDetailsTeam_C_PreConstruct");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsTeam_C_PreConstruct) == 0x000001, "Wrong size on WBP_GS_EndOfMatchDetailsTeam_C_PreConstruct");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetailsTeam.WBP_GS_EndOfMatchDetailsTeam_C.BP_GetDesiredFocusTarget
// 0x0040 (0x0040 - 0x0000)
struct WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GS_EndOfMatchDetailsPlayer_C*      K2Node_DynamicCast_AsWBP_GS_End_Of_Match_Details_Player; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget) == 0x000040, "Wrong size on WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000018, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsWBP_GS_End_Of_Match_Details_Player) == 0x000028, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsWBP_GS_End_Of_Match_Details_Player' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000038, "Member 'WBP_GS_EndOfMatchDetailsTeam_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

