#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_TreeViewWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStore_TreeViewWidget.WBP_G_V2_ItemStore_TreeViewWidget_C.GetIsRootSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ItemStore_TreeViewWidget_C_GetIsRootSelected final
{
public:
	bool                                          bIsRootSelected;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_TreeViewWidget_C_GetIsRootSelected) == 0x000001, "Wrong alignment on WBP_G_V2_ItemStore_TreeViewWidget_C_GetIsRootSelected");
static_assert(sizeof(WBP_G_V2_ItemStore_TreeViewWidget_C_GetIsRootSelected) == 0x000001, "Wrong size on WBP_G_V2_ItemStore_TreeViewWidget_C_GetIsRootSelected");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeViewWidget_C_GetIsRootSelected, bIsRootSelected) == 0x000000, "Member 'WBP_G_V2_ItemStore_TreeViewWidget_C_GetIsRootSelected::bIsRootSelected' has a wrong offset!");

// Function WBP_G_V2_ItemStore_TreeViewWidget.WBP_G_V2_ItemStore_TreeViewWidget_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_TreeViewWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

