#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_GodBuilderGameEntry

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_GodBuilderGameEntry.WBP_G_GodBuilderGameEntry_C
// 0x0018 (0x0610 - 0x05F8)
class UWBP_G_GodBuilderGameEntry_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_GodBuilder_BuildsList_Entry_C*   BuildDisplay;                                      // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SelectedImage;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_0_HWOnBuildEntrySelected__DelegateSignature(class UHWGodBuilderBuildsListEntryWidget* EntryWidget, const struct FHWGodBuild& GodBuild);
	void BndEvt__WBP_G_GodBuilderGameEntry_BuildDisplay_K2Node_ComponentBoundEvent_1_HWOnBuildEntryHovered__DelegateSignature(class UHWGodBuilderBuildsListEntryWidget* EntryWidget, const struct FHWGodBuild& GodBuild);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_G_GodBuilderGameEntry(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_GodBuilderGameEntry_C">();
	}
	static class UWBP_G_GodBuilderGameEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_GodBuilderGameEntry_C>();
	}
};
static_assert(alignof(UWBP_G_GodBuilderGameEntry_C) == 0x000008, "Wrong alignment on UWBP_G_GodBuilderGameEntry_C");
static_assert(sizeof(UWBP_G_GodBuilderGameEntry_C) == 0x000610, "Wrong size on UWBP_G_GodBuilderGameEntry_C");
static_assert(offsetof(UWBP_G_GodBuilderGameEntry_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_GodBuilderGameEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderGameEntry_C, BuildDisplay) == 0x000600, "Member 'UWBP_G_GodBuilderGameEntry_C::BuildDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderGameEntry_C, SelectedImage) == 0x000608, "Member 'UWBP_G_GodBuilderGameEntry_C::SelectedImage' has a wrong offset!");

}

