#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAscension_SingleItem_Purchase

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInDisplayOwnershipIcons;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Ascension;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsPremium;                           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsClaimable;                         // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0014)()
	bool                                          K2Node_CustomEvent_OwnsPass;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0014)()
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPlatformInventoryItem*           CallFunc_GetDisplayPlatformItem_ReturnValue;       // 0x0070(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHCurrency*                            K2Node_DynamicCast_AsRHCurrency;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetSmallIcon_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPlatformInventoryItem*           CallFunc_GetDisplayPlatformItem_ReturnValue_1;     // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodAscensionTrackItemDisplay*        K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00F4(0x0014)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B[0x1];                                      // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x011C(0x0014)()
	bool                                          K2Node_Event_bInIsSelected;                        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0138(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable_1;                        // 0x0160(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_2;                           // 0x0188(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase) == 0x000008, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase) == 0x0001B0, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, EntryPoint) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_bool_Variable) == 0x000004, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_byte_Variable) == 0x000005, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Event_bInDisplayOwnershipIcons) == 0x000014, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Event_bInDisplayOwnershipIcons' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_CustomEvent_Ascension) == 0x000015, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_CustomEvent_Ascension' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_SelectInt_ReturnValue) == 0x000018, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Event_bIsPremium) == 0x00001C, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Event_bIsPremium' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Event_bIsClaimable) == 0x00001D, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Event_bIsClaimable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_SelectColor_ReturnValue) == 0x000020, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_CustomEvent_OwnsPass) == 0x000044, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_CustomEvent_OwnsPass' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Event_bEnable) == 0x000045, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Event_bEnable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Event_bSelected) == 0x000046, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Event_bSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_byte_Variable_1) == 0x000047, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_SelectColor_ReturnValue_1) == 0x000048, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_GetDisplayPlatformItem_ReturnValue) == 0x000070, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_GetDisplayPlatformItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_DynamicCast_AsRHCurrency) == 0x000078, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_DynamicCast_AsRHCurrency' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_GetIconInfoByTag_OutIcon) == 0x000088, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_GetIconInfoByTag_OutIcon' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_GetIconInfoByTag_ReturnValue) == 0x000090, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_GetIconInfoByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_GetSmallIcon_ReturnValue) == 0x000098, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_GetSmallIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_GetDisplayPlatformItem_ReturnValue_1) == 0x0000A8, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_GetDisplayPlatformItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_bool_Variable_1) == 0x0000B0, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_GetIsEnabled_ReturnValue) == 0x0000B1, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Select_Default) == 0x0000B2, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_byte_Variable_2) == 0x0000B3, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_GetAllChildren_ReturnValue) == 0x0000B8, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_Array_Length_ReturnValue) == 0x0000D0, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display) == 0x0000D8, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_DynamicCast_AsHWGod_Ascension_Track_Item_Display' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_Less_IntInt_ReturnValue) == 0x0000E1, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_IsHovered_ReturnValue) == 0x0000E2, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_SelectColor_ReturnValue_2) == 0x0000E4, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_MakeStruct_SlateColor_2) == 0x0000F4, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_PlayAnimation_ReturnValue) == 0x000108, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, CallFunc_PlayAnimation_ReturnValue_1) == 0x000110, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_byte_Variable_3) == 0x000118, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_bool_Variable_2) == 0x000119, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Select_Default_1) == 0x00011A, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_MakeStruct_SlateColor_3) == 0x00011C, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Event_bInIsSelected) == 0x000130, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Event_bInIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_softobject_Variable) == 0x000138, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, Temp_softobject_Variable_1) == 0x000160, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::Temp_softobject_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase, K2Node_Select_Default_2) == 0x000188, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_SingleItem_Purchase::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.FrameSwitch
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_FrameSwitch final
{
public:
	bool                                          Ascension_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_FrameSwitch) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_FrameSwitch");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_FrameSwitch) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_FrameSwitch");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_FrameSwitch, Ascension_0) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_FrameSwitch::Ascension_0' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.LockIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_LockIcon final
{
public:
	bool                                          OwnsPass;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_LockIcon) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_LockIcon");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_LockIcon) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_LockIcon");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_LockIcon, OwnsPass) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_LockIcon::OwnsPass' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.SelectItem
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_SelectItem final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_SelectItem) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_SelectItem");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_SelectItem) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_SelectItem");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_SelectItem, bSelected) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_SelectItem::bSelected' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.SetButtonEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_SetButtonEnabled final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_SetButtonEnabled) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_SetButtonEnabled");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_SetButtonEnabled) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_SetButtonEnabled");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_SetButtonEnabled, bEnable) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_SetButtonEnabled::bEnable' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.SetClaimable
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_SetClaimable final
{
public:
	bool                                          bIsClaimable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_SetClaimable) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_SetClaimable");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_SetClaimable) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_SetClaimable");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_SetClaimable, bIsClaimable) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_SetClaimable::bIsClaimable' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.SetDisplayAsPremium
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayAsPremium final
{
public:
	bool                                          bIsPremium;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayAsPremium) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayAsPremium");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayAsPremium) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayAsPremium");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayAsPremium, bIsPremium) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayAsPremium::bIsPremium' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.SetDisplayOwnershipIcons
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayOwnershipIcons final
{
public:
	bool                                          bInDisplayOwnershipIcons;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayOwnershipIcons) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayOwnershipIcons");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayOwnershipIcons) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayOwnershipIcons");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayOwnershipIcons, bInDisplayOwnershipIcons) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_SetDisplayOwnershipIcons::bInDisplayOwnershipIcons' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.SetIsSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_SetIsSelected final
{
public:
	bool                                          bInIsSelected;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_SetIsSelected) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_SetIsSelected");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_SetIsSelected) == 0x000001, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_SetIsSelected");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_SetIsSelected, bInIsSelected) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_SetIsSelected::bInIsSelected' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.UpdateSelectedHighlight
// 0x0004 (0x0004 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight) == 0x000001, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight) == 0x000004, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight, Temp_bool_Variable) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight, K2Node_Select_Default) == 0x000003, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_UpdateSelectedHighlight::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_GodAscension_SingleItem_Purchase.WBP_C_GodAscension_SingleItem_Purchase_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_GodAscension_SingleItem_Purchase_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_SingleItem_Purchase_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_GodAscension_SingleItem_Purchase_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_GodAscension_SingleItem_Purchase_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_GodAscension_SingleItem_Purchase_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_GodAscension_SingleItem_Purchase_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_GodAscension_SingleItem_Purchase_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

