#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TeamDisplay_OmiBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_TeamDisplay_OmiBar.WBP_G_V2_TeamDisplay_OmiBar_C
// 0x0020 (0x0638 - 0x0618)
class UWBP_G_V2_TeamDisplay_OmiBar_C final : public UHWCharacterOmiWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWProgressBar*                         OmiBar;                                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OmiSegments;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               OmiSegmentsMI;                                     // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_TeamDisplay_OmiBar(int32 EntryPoint);
	void InitializeWidget();
	void UpdateCharacterOmi(double CurrentOmi, double MaxOmi);
	void UpdateCurrentOmi(float OldMana, float NewMana, bool bShouldAnimate);
	void UpdateMaxOmi(float OldMaxMana, float NewMaxMana, bool bShouldAnimate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_TeamDisplay_OmiBar_C">();
	}
	static class UWBP_G_V2_TeamDisplay_OmiBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_TeamDisplay_OmiBar_C>();
	}
};
static_assert(alignof(UWBP_G_V2_TeamDisplay_OmiBar_C) == 0x000008, "Wrong alignment on UWBP_G_V2_TeamDisplay_OmiBar_C");
static_assert(sizeof(UWBP_G_V2_TeamDisplay_OmiBar_C) == 0x000638, "Wrong size on UWBP_G_V2_TeamDisplay_OmiBar_C");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_OmiBar_C, UberGraphFrame) == 0x000618, "Member 'UWBP_G_V2_TeamDisplay_OmiBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_OmiBar_C, OmiBar) == 0x000620, "Member 'UWBP_G_V2_TeamDisplay_OmiBar_C::OmiBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_OmiBar_C, OmiSegments) == 0x000628, "Member 'UWBP_G_V2_TeamDisplay_OmiBar_C::OmiSegments' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_OmiBar_C, OmiSegmentsMI) == 0x000630, "Member 'UWBP_G_V2_TeamDisplay_OmiBar_C::OmiSegmentsMI' has a wrong offset!");

}

