#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_TreeView_SubTreeWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStore_TreeView_SubTreeWidget.WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C.HandleDownNavigation
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         childCount;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDesiredChildFocusIndex_ReturnValue;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_G_V2_ItemStore_TreeView_SubTreeWidget_C* K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Tree_View_Sub_Tree_Widget; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation");
static_assert(sizeof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation) == 0x000040, "Wrong size on WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, Navigation_0) == 0x000000, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, childCount) == 0x000010, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::childCount' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, CallFunc_GetDesiredChildFocusIndex_ReturnValue) == 0x000014, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::CallFunc_GetDesiredChildFocusIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Tree_View_Sub_Tree_Widget) == 0x000028, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::K2Node_DynamicCast_AsWBP_G_V2_Item_Store_Tree_View_Sub_Tree_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000038, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_HandleDownNavigation::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore_TreeView_SubTreeWidget.WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C.UpdateHorizontalLine
// 0x0048 (0x0048 - 0x0000)
struct WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine final
{
public:
	EHWItemStoreSubTreeLineWidth                  LineLength;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreSubTreeLineWidth                  Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine");
static_assert(sizeof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine) == 0x000048, "Wrong size on WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine, LineLength) == 0x000000, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine::LineLength' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine, Temp_struct_Variable) == 0x000008, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine, Temp_struct_Variable_2) == 0x000028, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine, K2Node_Select_Default) == 0x000038, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_UpdateHorizontalLine::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ItemStore_TreeView_SubTreeWidget.WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C.BP_GetDesiredFocusTarget
// 0x0098 (0x0098 - 0x0000)
struct WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Target;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWItemStoreSubTreeWidget*              K2Node_DynamicCast_AsHWItem_Store_Sub_Tree_Widget; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwned_ReturnValue;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              K2Node_DynamicCast_AsHWWidget;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_2;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWEquipmentItem*                 CallFunc_GetEquipmentItem_ReturnValue;             // 0x0080(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_3;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget) == 0x000098, "Wrong size on WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, Target) == 0x000008, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::Target' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsHWItem_Store_Sub_Tree_Widget) == 0x000048, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsHWItem_Store_Sub_Tree_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_IsOwned_ReturnValue) == 0x000052, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_IsOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_Not_PreBool_ReturnValue) == 0x000053, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue_1) == 0x000058, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsHWWidget) == 0x000060, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsHWWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue_2) == 0x000070, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_CanPurchase_ReturnValue) == 0x000078, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetEquipmentItem_ReturnValue) == 0x000080, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetEquipmentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue_3) == 0x000088, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget, CallFunc_MatchesTag_ReturnValue) == 0x000090, "Member 'WBP_G_V2_ItemStore_TreeView_SubTreeWidget_C_BP_GetDesiredFocusTarget::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");

}

