#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_BotSelectScreen

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_BotSelectScreen.WBP_C_BotSelectScreen_C.BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature
// 0x000C (0x000C - 0x0000)
struct WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FName                                   SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature) == 0x00000C, "Wrong size on WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000008, "Member 'WBP_C_BotSelectScreen_C_BndEvt__WBP_C_BotSelectScreen_DifficultyCombobox_K2Node_ComponentBoundEvent_2_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_C_BotSelectScreen.WBP_C_BotSelectScreen_C.BP_OnHandleBackAction
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_BotSelectScreen_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_BotSelectScreen_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_C_BotSelectScreen_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_C_BotSelectScreen_C_BP_OnHandleBackAction) == 0x000010, "Wrong size on WBP_C_BotSelectScreen_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_C_BotSelectScreen_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_C_BotSelectScreen_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_BP_OnHandleBackAction, CallFunc_IsOpen_ReturnValue) == 0x000001, "Member 'WBP_C_BotSelectScreen_C_BP_OnHandleBackAction::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_BP_OnHandleBackAction, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_BotSelectScreen_C_BP_OnHandleBackAction::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_C_BotSelectScreen.WBP_C_BotSelectScreen_C.ExecuteUbergraph_WBP_C_BotSelectScreen
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NavigateBack_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_SelectedItem;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSelectedOption_ReturnValue;            // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen) == 0x000004, "Wrong alignment on WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen");
static_assert(sizeof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen) == 0x000020, "Wrong size on WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen");
static_assert(offsetof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen, EntryPoint) == 0x000000, "Member 'WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen, CallFunc_NavigateBack_ReturnValue) == 0x000004, "Member 'WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen::CallFunc_NavigateBack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen, K2Node_ComponentBoundEvent_SelectedItem) == 0x000008, "Member 'WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen, K2Node_ComponentBoundEvent_SelectionType) == 0x000010, "Member 'WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen, CallFunc_GetSelectedOption_ReturnValue) == 0x000014, "Member 'WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen, K2Node_SwitchName_CmpSuccess) == 0x00001C, "Member 'WBP_C_BotSelectScreen_C_ExecuteUbergraph_WBP_C_BotSelectScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_C_BotSelectScreen.WBP_C_BotSelectScreen_C.StartShowSequence
// 0x0098 (0x0098 - 0x0000)
struct WBP_C_BotSelectScreen_C_StartShowSequence final
{
public:
	struct FGameplayTag                           FromRoute;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ToRoute;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAssociatedTeamNum_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
};
static_assert(alignof(WBP_C_BotSelectScreen_C_StartShowSequence) == 0x000008, "Wrong alignment on WBP_C_BotSelectScreen_C_StartShowSequence");
static_assert(sizeof(WBP_C_BotSelectScreen_C_StartShowSequence) == 0x000098, "Wrong size on WBP_C_BotSelectScreen_C_StartShowSequence");
static_assert(offsetof(WBP_C_BotSelectScreen_C_StartShowSequence, FromRoute) == 0x000000, "Member 'WBP_C_BotSelectScreen_C_StartShowSequence::FromRoute' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_StartShowSequence, ToRoute) == 0x000008, "Member 'WBP_C_BotSelectScreen_C_StartShowSequence::ToRoute' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_StartShowSequence, CallFunc_GetAssociatedTeamNum_ReturnValue) == 0x000010, "Member 'WBP_C_BotSelectScreen_C_StartShowSequence::CallFunc_GetAssociatedTeamNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_StartShowSequence, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_C_BotSelectScreen_C_StartShowSequence::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_StartShowSequence, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000018, "Member 'WBP_C_BotSelectScreen_C_StartShowSequence::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_StartShowSequence, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_C_BotSelectScreen_C_StartShowSequence::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_StartShowSequence, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_C_BotSelectScreen_C_StartShowSequence::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_StartShowSequence, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_C_BotSelectScreen_C_StartShowSequence::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_C_BotSelectScreen.WBP_C_BotSelectScreen_C.UpdateDetailedGodDisplay
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay final
{
public:
	const class UHWCharacterItem*                 GodItem;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWIconSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCharacterTitle_ReturnValue;            // 0x0010(0x0018)()
	const class UHWDataDisplay_Keywords*          CallFunc_GetKeywordsDataDisplay_ReturnValue;       // 0x0028(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0030(0x0018)()
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0048(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetFirstMatchingTag_ReturnValue;          // 0x0070(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHWDataDisplay_Keyword                 CallFunc_GetKeywordDisplayData_OutDisplayData;     // 0x0078(0x00F0)()
	bool                                          CallFunc_GetKeywordDisplayData_ReturnValue;        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0170(0x0020)()
	class FText                                   CallFunc_ConstructPlaystyleDescriptorText_OutPlaystyleDescriptorText; // 0x0190(0x0018)()
	bool                                          CallFunc_ConstructPlaystyleDescriptorText_ReturnValue; // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay) == 0x000008, "Wrong alignment on WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay");
static_assert(sizeof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay) == 0x0001B0, "Wrong size on WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, GodItem) == 0x000000, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::GodItem' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_GetCharacterTitle_ReturnValue) == 0x000010, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_GetCharacterTitle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_GetKeywordsDataDisplay_ReturnValue) == 0x000028, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_GetKeywordsDataDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_GetItemName_ReturnValue) == 0x000030, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000048, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_GetFirstMatchingTag_ReturnValue) == 0x000070, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_GetFirstMatchingTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_GetKeywordDisplayData_OutDisplayData) == 0x000078, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_GetKeywordDisplayData_OutDisplayData' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_GetKeywordDisplayData_ReturnValue) == 0x000168, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_GetKeywordDisplayData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000170, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_ConstructPlaystyleDescriptorText_OutPlaystyleDescriptorText) == 0x000190, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_ConstructPlaystyleDescriptorText_OutPlaystyleDescriptorText' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay, CallFunc_ConstructPlaystyleDescriptorText_ReturnValue) == 0x0001A8, "Member 'WBP_C_BotSelectScreen_C_UpdateDetailedGodDisplay::CallFunc_ConstructPlaystyleDescriptorText_ReturnValue' has a wrong offset!");

// Function WBP_C_BotSelectScreen.WBP_C_BotSelectScreen_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_C_BotSelectScreen_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

