#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodOmiAttribute

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodOmiAttribute.WBP_G_V2_GodOmiAttribute_C
// 0x0020 (0x0638 - 0x0618)
class UWBP_G_V2_GodOmiAttribute_C final : public UHWCharacterOmiWidget
{
public:
	class UWBP_GS_V1_GAProgressBarDividersListener_C* OmiListener;                                   // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         OmiProgressBar;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OmiSegments;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               OmiSegmentsMI;                                     // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void InitializeWidget();
	void OnAttributesTracked();
	void OnAttributesUntracked();
	void UpdateMaxOmi(float OldMaxMana, float NewMaxMana, bool bShouldAnimate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodOmiAttribute_C">();
	}
	static class UWBP_G_V2_GodOmiAttribute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodOmiAttribute_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodOmiAttribute_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodOmiAttribute_C");
static_assert(sizeof(UWBP_G_V2_GodOmiAttribute_C) == 0x000638, "Wrong size on UWBP_G_V2_GodOmiAttribute_C");
static_assert(offsetof(UWBP_G_V2_GodOmiAttribute_C, OmiListener) == 0x000618, "Member 'UWBP_G_V2_GodOmiAttribute_C::OmiListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiAttribute_C, OmiProgressBar) == 0x000620, "Member 'UWBP_G_V2_GodOmiAttribute_C::OmiProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiAttribute_C, OmiSegments) == 0x000628, "Member 'UWBP_G_V2_GodOmiAttribute_C::OmiSegments' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiAttribute_C, OmiSegmentsMI) == 0x000630, "Member 'UWBP_G_V2_GodOmiAttribute_C::OmiSegmentsMI' has a wrong offset!");

}

