#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_CollectionRarityDisplay

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_CollectionRarityDisplay.WBP_S_CollectionRarityDisplay_C
// 0x0058 (0x0650 - 0x05F8)
class UWBP_S_CollectionRarityDisplay_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWOverlay*                             Banner_Overlay;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             LegendaryAnimation;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             MythicalAnimation;                                 // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityBanner;                                      // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityBanner_1;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityBanner_EndCap;                               // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityBanner_EndCap_1;                             // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityIcon;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RarityText;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              NoRarityVisibility;                                // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowRarityBanner;                                  // 0x0649(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetDisplayRarity(const struct FGameplayTag& RarityTag);
	void SetDisplayItem(class UHWInventoryItem* InventoryItem);
	void SetDisplayBanner(bool Show);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_S_CollectionRarityDisplay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_CollectionRarityDisplay_C">();
	}
	static class UWBP_S_CollectionRarityDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_CollectionRarityDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_CollectionRarityDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_CollectionRarityDisplay_C");
static_assert(sizeof(UWBP_S_CollectionRarityDisplay_C) == 0x000650, "Wrong size on UWBP_S_CollectionRarityDisplay_C");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_S_CollectionRarityDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, Banner_Overlay) == 0x000600, "Member 'UWBP_S_CollectionRarityDisplay_C::Banner_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, LegendaryAnimation) == 0x000608, "Member 'UWBP_S_CollectionRarityDisplay_C::LegendaryAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, MythicalAnimation) == 0x000610, "Member 'UWBP_S_CollectionRarityDisplay_C::MythicalAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, RarityBanner) == 0x000618, "Member 'UWBP_S_CollectionRarityDisplay_C::RarityBanner' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, RarityBanner_1) == 0x000620, "Member 'UWBP_S_CollectionRarityDisplay_C::RarityBanner_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, RarityBanner_EndCap) == 0x000628, "Member 'UWBP_S_CollectionRarityDisplay_C::RarityBanner_EndCap' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, RarityBanner_EndCap_1) == 0x000630, "Member 'UWBP_S_CollectionRarityDisplay_C::RarityBanner_EndCap_1' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, RarityIcon) == 0x000638, "Member 'UWBP_S_CollectionRarityDisplay_C::RarityIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, RarityText) == 0x000640, "Member 'UWBP_S_CollectionRarityDisplay_C::RarityText' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, NoRarityVisibility) == 0x000648, "Member 'UWBP_S_CollectionRarityDisplay_C::NoRarityVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_S_CollectionRarityDisplay_C, ShowRarityBanner) == 0x000649, "Member 'UWBP_S_CollectionRarityDisplay_C::ShowRarityBanner' has a wrong offset!");

}

