#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StandardButtonLarge

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "E_ButtonFontStyle_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StandardButtonLarge.WBP_StandardButtonLarge_C
// 0x0130 (0x06E8 - 0x05B8)
class UWBP_StandardButtonLarge_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnClick;                                           // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Highlight;                                         // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BtnBkg;                                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBkgHover;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBkgRedButton;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnClickImage;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnEdge;                                           // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnEdgeHover;                                      // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnFrame;                                          // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnFrameHover;                                     // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BtnStandardWrapper;                                // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitTarget;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HoverWrapper;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeyCallout_C*                      KeyPrompt;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           KeyPromptContainer;                                // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NamedSlot_65;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeWrapper;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnClicked;                                 // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnHovered;                                 // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnUnhovered;                               // 0x0670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UObject*                                ClickLrgBtnSFX;                                    // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   DefaultButtonText;                                 // 0x0688(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        DefaultWidth;                                      // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowPromptOnFocus;                                 // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   PromptKey;                                         // 0x06B0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsRedButton;                                       // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsConfirm;                                         // 0x06C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsCancel;                                          // 0x06CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6CB[0x5];                                      // 0x06CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DefaultHeight;                                     // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                HoverLrgBtnSFX;                                    // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	E_ButtonFontStyle                             EFontStyle;                                        // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsDisabled;                                        // 0x06E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void Do_Hover();
	void Do_Unhover();
	void ExecuteUbergraph_WBP_StandardButtonLarge(int32 EntryPoint);
	void GamepadConfirm();
	void GamepadHover();
	void GamepadUnhover();
	void GetFontStyleNameByType(class FName* FontName);
	void GetGamepadPromptKey(bool* HasValidKeyPrompt, struct FKey* GamepadKey);
	void HandleInputStateChanged(ERH_INPUT_STATE InputState);
	bool NavigateConfirm();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Set_Gamepad_Prompt_for_Action(class UInputAction* Action);
	void Set_Key_Prompt(const struct FKey& Prompt);
	void SetButtonText(const class FText& ButtonText_0);
	void SetDefaultDisplay();
	void SetDisabled(bool Disabled);
	void SetHeight(double InHeight);
	void SetWidth(double InWidth);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StandardButtonLarge_C">();
	}
	static class UWBP_StandardButtonLarge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StandardButtonLarge_C>();
	}
};
static_assert(alignof(UWBP_StandardButtonLarge_C) == 0x000008, "Wrong alignment on UWBP_StandardButtonLarge_C");
static_assert(sizeof(UWBP_StandardButtonLarge_C) == 0x0006E8, "Wrong size on UWBP_StandardButtonLarge_C");
static_assert(offsetof(UWBP_StandardButtonLarge_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_StandardButtonLarge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, OnClick) == 0x0005C0, "Member 'UWBP_StandardButtonLarge_C::OnClick' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, Highlight) == 0x0005C8, "Member 'UWBP_StandardButtonLarge_C::Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnBkg) == 0x0005D0, "Member 'UWBP_StandardButtonLarge_C::BtnBkg' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnBkgHover) == 0x0005D8, "Member 'UWBP_StandardButtonLarge_C::BtnBkgHover' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnBkgRedButton) == 0x0005E0, "Member 'UWBP_StandardButtonLarge_C::BtnBkgRedButton' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnClickImage) == 0x0005E8, "Member 'UWBP_StandardButtonLarge_C::BtnClickImage' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnEdge) == 0x0005F0, "Member 'UWBP_StandardButtonLarge_C::BtnEdge' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnEdgeHover) == 0x0005F8, "Member 'UWBP_StandardButtonLarge_C::BtnEdgeHover' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnFrame) == 0x000600, "Member 'UWBP_StandardButtonLarge_C::BtnFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnFrameHover) == 0x000608, "Member 'UWBP_StandardButtonLarge_C::BtnFrameHover' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, BtnStandardWrapper) == 0x000610, "Member 'UWBP_StandardButtonLarge_C::BtnStandardWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, ButtonText) == 0x000618, "Member 'UWBP_StandardButtonLarge_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, HitTarget) == 0x000620, "Member 'UWBP_StandardButtonLarge_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, HoverWrapper) == 0x000628, "Member 'UWBP_StandardButtonLarge_C::HoverWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, KeyPrompt) == 0x000630, "Member 'UWBP_StandardButtonLarge_C::KeyPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, KeyPromptContainer) == 0x000638, "Member 'UWBP_StandardButtonLarge_C::KeyPromptContainer' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, NamedSlot_65) == 0x000640, "Member 'UWBP_StandardButtonLarge_C::NamedSlot_65' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, SizeWrapper) == 0x000648, "Member 'UWBP_StandardButtonLarge_C::SizeWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, OnClicked) == 0x000650, "Member 'UWBP_StandardButtonLarge_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, OnHovered) == 0x000660, "Member 'UWBP_StandardButtonLarge_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, OnUnhovered) == 0x000670, "Member 'UWBP_StandardButtonLarge_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, ClickLrgBtnSFX) == 0x000680, "Member 'UWBP_StandardButtonLarge_C::ClickLrgBtnSFX' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, DefaultButtonText) == 0x000688, "Member 'UWBP_StandardButtonLarge_C::DefaultButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, DefaultWidth) == 0x0006A0, "Member 'UWBP_StandardButtonLarge_C::DefaultWidth' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, ShowPromptOnFocus) == 0x0006A8, "Member 'UWBP_StandardButtonLarge_C::ShowPromptOnFocus' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, PromptKey) == 0x0006B0, "Member 'UWBP_StandardButtonLarge_C::PromptKey' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, IsRedButton) == 0x0006C8, "Member 'UWBP_StandardButtonLarge_C::IsRedButton' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, IsConfirm) == 0x0006C9, "Member 'UWBP_StandardButtonLarge_C::IsConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, IsCancel) == 0x0006CA, "Member 'UWBP_StandardButtonLarge_C::IsCancel' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, DefaultHeight) == 0x0006D0, "Member 'UWBP_StandardButtonLarge_C::DefaultHeight' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, HoverLrgBtnSFX) == 0x0006D8, "Member 'UWBP_StandardButtonLarge_C::HoverLrgBtnSFX' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, EFontStyle) == 0x0006E0, "Member 'UWBP_StandardButtonLarge_C::EFontStyle' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonLarge_C, IsDisabled) == 0x0006E1, "Member 'UWBP_StandardButtonLarge_C::IsDisabled' has a wrong offset!");

}

