#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PurchaseConfirmation_Season

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PurchaseConfirmation_Season.WBP_S_PurchaseConfirmation_Season_C
// 0x00A0 (0x0730 - 0x0690)
class UWBP_S_PurchaseConfirmation_Season_C final : public UHWPurchaseConfirmWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWWidgetSwitcher*                      CoinsorSkin;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DividerLine;                                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_54;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_65;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_332;                                       // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_436;                                       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          Item_PremiumCurrencyDisplay;                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemDescriptionText;                               // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          ItemImage;                                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ItemNameText;                                      // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           LongDescriptionText;                               // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PercentageTag_C*                 PercentageTagDiscount;                             // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PremiumCurrencyDisplay;                            // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PremiumCurrencyPrompt;                             // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              PurchaseButton;                                    // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RarityMaterial;                                    // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               SkinImage;                                         // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SkinName;                                          // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_149;                                        // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_PurchaseConfirmation_Skin_Purchasebutton_K2Node_ComponentBoundEvent_0_OnHWButtonEvent__DelegateSignature();
	void DisplayItem(class UHWCollectionItem* Item, int32 Quantity);
	void DisplayPrice(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroup);
	void ExecuteUbergraph_WBP_S_PurchaseConfirmation_Season(int32 EntryPoint);
	void InitializeWidget();
	void PreConstruct(bool IsDesignTime);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PurchaseConfirmation_Season_C">();
	}
	static class UWBP_S_PurchaseConfirmation_Season_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PurchaseConfirmation_Season_C>();
	}
};
static_assert(alignof(UWBP_S_PurchaseConfirmation_Season_C) == 0x000008, "Wrong alignment on UWBP_S_PurchaseConfirmation_Season_C");
static_assert(sizeof(UWBP_S_PurchaseConfirmation_Season_C) == 0x000730, "Wrong size on UWBP_S_PurchaseConfirmation_Season_C");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, UberGraphFrame) == 0x000690, "Member 'UWBP_S_PurchaseConfirmation_Season_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, CoinsorSkin) == 0x000698, "Member 'UWBP_S_PurchaseConfirmation_Season_C::CoinsorSkin' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, DividerLine) == 0x0006A0, "Member 'UWBP_S_PurchaseConfirmation_Season_C::DividerLine' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, HWImage_54) == 0x0006A8, "Member 'UWBP_S_PurchaseConfirmation_Season_C::HWImage_54' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, HWImage_65) == 0x0006B0, "Member 'UWBP_S_PurchaseConfirmation_Season_C::HWImage_65' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, HWImage_332) == 0x0006B8, "Member 'UWBP_S_PurchaseConfirmation_Season_C::HWImage_332' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, HWImage_436) == 0x0006C0, "Member 'UWBP_S_PurchaseConfirmation_Season_C::HWImage_436' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, Item_PremiumCurrencyDisplay) == 0x0006C8, "Member 'UWBP_S_PurchaseConfirmation_Season_C::Item_PremiumCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, ItemDescriptionText) == 0x0006D0, "Member 'UWBP_S_PurchaseConfirmation_Season_C::ItemDescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, ItemImage) == 0x0006D8, "Member 'UWBP_S_PurchaseConfirmation_Season_C::ItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, ItemNameText) == 0x0006E0, "Member 'UWBP_S_PurchaseConfirmation_Season_C::ItemNameText' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, LongDescriptionText) == 0x0006E8, "Member 'UWBP_S_PurchaseConfirmation_Season_C::LongDescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, PercentageTagDiscount) == 0x0006F0, "Member 'UWBP_S_PurchaseConfirmation_Season_C::PercentageTagDiscount' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, PremiumCurrencyDisplay) == 0x0006F8, "Member 'UWBP_S_PurchaseConfirmation_Season_C::PremiumCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, PremiumCurrencyPrompt) == 0x000700, "Member 'UWBP_S_PurchaseConfirmation_Season_C::PremiumCurrencyPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, PurchaseButton) == 0x000708, "Member 'UWBP_S_PurchaseConfirmation_Season_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, RarityMaterial) == 0x000710, "Member 'UWBP_S_PurchaseConfirmation_Season_C::RarityMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, SkinImage) == 0x000718, "Member 'UWBP_S_PurchaseConfirmation_Season_C::SkinImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, SkinName) == 0x000720, "Member 'UWBP_S_PurchaseConfirmation_Season_C::SkinName' has a wrong offset!");
static_assert(offsetof(UWBP_S_PurchaseConfirmation_Season_C, Spacer_149) == 0x000728, "Member 'UWBP_S_PurchaseConfirmation_Season_C::Spacer_149' has a wrong offset!");

}

