#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spec_HUDScoreboard_Player_Enemy

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_Spec_HUDScoreboard_Player_Enemy.WBP_G_Spec_HUDScoreboard_Player_Enemy_C.CharacterItemChanged
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged final
{
public:
	const class UHWCharacterItem*                 NewCharacterItem;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged) == 0x000038, "Wrong size on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged, NewCharacterItem) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged::NewCharacterItem' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000010, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_CharacterItemChanged::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_Player_Enemy.WBP_G_Spec_HUDScoreboard_Player_Enemy_C.DisplayCharacterRespawnState
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState final
{
public:
	bool                                          bIsAlive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainingRespawnTime;                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState) == 0x000028, "Wrong size on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState, bIsAlive) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState::bIsAlive' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState, RemainingRespawnTime) == 0x000004, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState::RemainingRespawnTime' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState, Temp_bool_Variable) == 0x000008, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState, Temp_real_Variable) == 0x00000C, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState, Temp_real_Variable_1) == 0x000010, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState, K2Node_Select_Default) == 0x000020, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_DisplayCharacterRespawnState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_Player_Enemy.WBP_G_Spec_HUDScoreboard_Player_Enemy_C.InitializeWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_Player_Enemy_C_InitializeWidget final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_InitializeWidget");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_InitializeWidget) == 0x000008, "Wrong size on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_InitializeWidget");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_InitializeWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_InitializeWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_Player_Enemy.WBP_G_Spec_HUDScoreboard_Player_Enemy_C.BP_GetDesiredFocusTarget
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_2;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget) == 0x000060, "Wrong size on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, Temp_bool_Variable) == 0x000008, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, Temp_object_Variable) == 0x000010, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, Temp_bool_Variable_2) == 0x000019, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000020, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue_1) == 0x000028, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, K2Node_Select_Default) == 0x000038, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, K2Node_Select_Default_1) == 0x000040, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue_2) == 0x000048, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget, K2Node_Select_Default_2) == 0x000058, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_BP_GetDesiredFocusTarget::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_Player_Enemy.WBP_G_Spec_HUDScoreboard_Player_Enemy_C.GetAttributeWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets final
{
public:
	TArray<class UHWGameplayAttributeWidget*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayAttributeWidget*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets) == 0x000020, "Wrong size on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetAttributeWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_Player_Enemy.WBP_G_Spec_HUDScoreboard_Player_Enemy_C.GetCharacterWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets final
{
public:
	TArray<class UHWCharacterWidget*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWCharacterWidget*>             K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets) == 0x000020, "Wrong size on WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_Spec_HUDScoreboard_Player_Enemy_C_GetCharacterWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

