#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Search_Tab

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_Social_Search_Tab_C_BndEvt__Results_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Social_Search_Tab_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature final
{
public:
	class FText                                   SearchTerm;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Social_Search_Tab_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature");
static_assert(sizeof(WBP_Social_Search_Tab_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature) == 0x000018, "Wrong size on WBP_Social_Search_Tab_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature");
static_assert(offsetof(WBP_Social_Search_Tab_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature, SearchTerm) == 0x000000, "Member 'WBP_Social_Search_Tab_C_BndEvt__SearchBar_K2Node_ComponentBoundEvent_4_OnSearchTermChange__DelegateSignature::SearchTerm' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.ClearListFocus
// 0x0018 (0x0018 - 0x0000)
struct WBP_Social_Search_Tab_C_ClearListFocus final
{
public:
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_Tab_C_ClearListFocus) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_ClearListFocus");
static_assert(sizeof(WBP_Social_Search_Tab_C_ClearListFocus) == 0x000018, "Wrong size on WBP_Social_Search_Tab_C_ClearListFocus");
static_assert(offsetof(WBP_Social_Search_Tab_C_ClearListFocus, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000000, "Member 'WBP_Social_Search_Tab_C_ClearListFocus::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_ClearListFocus, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Social_Search_Tab_C_ClearListFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_ClearListFocus, CallFunc_BP_GetSelectedItem_ReturnValue_1) == 0x000010, "Member 'WBP_Social_Search_Tab_C_ClearListFocus::CallFunc_BP_GetSelectedItem_ReturnValue_1' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.ExecuteUbergraph_WBP_Social_Search_Tab
// 0x0048 (0x0048 - 0x0000)
struct WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_SearchTerm;             // 0x0030(0x0018)()
};
static_assert(alignof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab");
static_assert(sizeof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab) == 0x000048, "Wrong size on WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab");
static_assert(offsetof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab, EntryPoint) == 0x000000, "Member 'WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab, K2Node_ComponentBoundEvent_Item_1) == 0x000008, "Member 'WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab::K2Node_ComponentBoundEvent_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab, K2Node_ComponentBoundEvent_Item) == 0x000010, "Member 'WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab, K2Node_CustomEvent_InputState) == 0x000028, "Member 'WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab, K2Node_ComponentBoundEvent_SearchTerm) == 0x000030, "Member 'WBP_Social_Search_Tab_C_ExecuteUbergraph_WBP_Social_Search_Tab::K2Node_ComponentBoundEvent_SearchTerm' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.GetFirstVisibleItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_Social_Search_Tab_C_GetFirstVisibleItem final
{
public:
	class URHTreeView*                            List;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Item;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetItemAt_ReturnValue;                    // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsItemVisible_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_Tab_C_GetFirstVisibleItem) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_GetFirstVisibleItem");
static_assert(sizeof(WBP_Social_Search_Tab_C_GetFirstVisibleItem) == 0x000030, "Wrong size on WBP_Social_Search_Tab_C_GetFirstVisibleItem");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, List) == 0x000000, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::List' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, Item) == 0x000008, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, CallFunc_GetNumItems_ReturnValue) == 0x000010, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, Temp_int_Variable) == 0x000018, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, CallFunc_GetItemAt_ReturnValue) == 0x000020, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::CallFunc_GetItemAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, CallFunc_BP_IsItemVisible_ReturnValue) == 0x000028, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::CallFunc_BP_IsItemVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFirstVisibleItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000029, "Member 'WBP_Social_Search_Tab_C_GetFirstVisibleItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.GetFocusTargets
// 0x0020 (0x0020 - 0x0000)
struct WBP_Social_Search_Tab_C_GetFocusTargets final
{
public:
	TArray<class UWidget*>                        Target;                                            // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Social_Search_Tab_C_GetFocusTargets) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_GetFocusTargets");
static_assert(sizeof(WBP_Social_Search_Tab_C_GetFocusTargets) == 0x000020, "Wrong size on WBP_Social_Search_Tab_C_GetFocusTargets");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFocusTargets, Target) == 0x000000, "Member 'WBP_Social_Search_Tab_C_GetFocusTargets::Target' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_GetFocusTargets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_Social_Search_Tab_C_GetFocusTargets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.HandlePlayerCardClicked
// 0x0040 (0x0040 - 0x0000)
struct WBP_Social_Search_Tab_C_HandlePlayerCardClicked final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_BP_GetEntryWidgetFromItem_OutWidget;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetEntryWidgetFromItem_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Player_Card_Social_Entry_C*        K2Node_DynamicCast_AsWBP_Player_Card_Social_Entry; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              CallFunc_GetDisplayItem_ActiveDisplayItem;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_player_card_module_C*              K2Node_DynamicCast_AsWBP_Player_Card_Module;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_HandlePlayerCardClicked");
static_assert(sizeof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked) == 0x000040, "Wrong size on WBP_Social_Search_Tab_C_HandlePlayerCardClicked");
static_assert(offsetof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked, Object) == 0x000000, "Member 'WBP_Social_Search_Tab_C_HandlePlayerCardClicked::Object' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked, CallFunc_BP_GetEntryWidgetFromItem_OutWidget) == 0x000008, "Member 'WBP_Social_Search_Tab_C_HandlePlayerCardClicked::CallFunc_BP_GetEntryWidgetFromItem_OutWidget' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked, CallFunc_BP_GetEntryWidgetFromItem_ReturnValue) == 0x000010, "Member 'WBP_Social_Search_Tab_C_HandlePlayerCardClicked::CallFunc_BP_GetEntryWidgetFromItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked, K2Node_DynamicCast_AsWBP_Player_Card_Social_Entry) == 0x000018, "Member 'WBP_Social_Search_Tab_C_HandlePlayerCardClicked::K2Node_DynamicCast_AsWBP_Player_Card_Social_Entry' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Social_Search_Tab_C_HandlePlayerCardClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked, CallFunc_GetDisplayItem_ActiveDisplayItem) == 0x000028, "Member 'WBP_Social_Search_Tab_C_HandlePlayerCardClicked::CallFunc_GetDisplayItem_ActiveDisplayItem' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked, K2Node_DynamicCast_AsWBP_Player_Card_Module) == 0x000030, "Member 'WBP_Social_Search_Tab_C_HandlePlayerCardClicked::K2Node_DynamicCast_AsWBP_Player_Card_Module' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_HandlePlayerCardClicked, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_Social_Search_Tab_C_HandlePlayerCardClicked::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.OnInputStateChange
// 0x0001 (0x0001 - 0x0000)
struct WBP_Social_Search_Tab_C_OnInputStateChange final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_Tab_C_OnInputStateChange) == 0x000001, "Wrong alignment on WBP_Social_Search_Tab_C_OnInputStateChange");
static_assert(sizeof(WBP_Social_Search_Tab_C_OnInputStateChange) == 0x000001, "Wrong size on WBP_Social_Search_Tab_C_OnInputStateChange");
static_assert(offsetof(WBP_Social_Search_Tab_C_OnInputStateChange, InputState) == 0x000000, "Member 'WBP_Social_Search_Tab_C_OnInputStateChange::InputState' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.OnKeyUp
// 0x02C0 (0x02C0 - 0x0000)
struct WBP_Social_Search_Tab_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0150(0x00B8)()
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x0208(0x00B8)()
};
static_assert(alignof(WBP_Social_Search_Tab_C_OnKeyUp) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_OnKeyUp");
static_assert(sizeof(WBP_Social_Search_Tab_C_OnKeyUp) == 0x0002C0, "Wrong size on WBP_Social_Search_Tab_C_OnKeyUp");
static_assert(offsetof(WBP_Social_Search_Tab_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'WBP_Social_Search_Tab_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'WBP_Social_Search_Tab_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_OnKeyUp, ReturnValue) == 0x000078, "Member 'WBP_Social_Search_Tab_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'WBP_Social_Search_Tab_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_OnKeyUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000148, "Member 'WBP_Social_Search_Tab_C_OnKeyUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000150, "Member 'WBP_Social_Search_Tab_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_OnKeyUp, CallFunc_Unhandled_ReturnValue) == 0x000208, "Member 'WBP_Social_Search_Tab_C_OnKeyUp::CallFunc_Unhandled_ReturnValue' has a wrong offset!");

// Function WBP_Social_Search_Tab.WBP_Social_Search_Tab_C.TryRecoverLastKnownListFocus
// 0x0010 (0x0010 - 0x0000)
struct WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus final
{
public:
	class UObject*                                CallFunc_GetFirstVisibleItem_Item;                 // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsItemVisible_ReturnValue;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus) == 0x000008, "Wrong alignment on WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus");
static_assert(sizeof(WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus) == 0x000010, "Wrong size on WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus");
static_assert(offsetof(WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus, CallFunc_GetFirstVisibleItem_Item) == 0x000000, "Member 'WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus::CallFunc_GetFirstVisibleItem_Item' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus, CallFunc_GetCurrentInputState_ReturnValue) == 0x000008, "Member 'WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus, CallFunc_BP_IsItemVisible_ReturnValue) == 0x00000B, "Member 'WBP_Social_Search_Tab_C_TryRecoverLastKnownListFocus::CallFunc_BP_IsItemVisible_ReturnValue' has a wrong offset!");

}

