#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonShop_RichText

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_SeasonShop_RichText.WBP_C_SeasonShop_RichText_C
// 0x0068 (0x0660 - 0x05F8)
class UWBP_C_SeasonShop_RichText_C final : public UHWWidget
{
public:
	class UHWCanvasPanel*                         Diamond_CanvasPanel;                               // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Icon;                                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Main_SizeBox;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       PageLockReasonText;                                // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LabelText;                                         // 0x0618(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              LabelIcon;                                         // 0x0630(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        LabelWidth;                                        // 0x0658(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void SetIcon(TSoftObjectPtr<class UTexture2D> Icon_0);
	void SetText(const class FText& NewText);
	void ShowDiamond(bool Show);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_SeasonShop_RichText_C">();
	}
	static class UWBP_C_SeasonShop_RichText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_SeasonShop_RichText_C>();
	}
};
static_assert(alignof(UWBP_C_SeasonShop_RichText_C) == 0x000008, "Wrong alignment on UWBP_C_SeasonShop_RichText_C");
static_assert(sizeof(UWBP_C_SeasonShop_RichText_C) == 0x000660, "Wrong size on UWBP_C_SeasonShop_RichText_C");
static_assert(offsetof(UWBP_C_SeasonShop_RichText_C, Diamond_CanvasPanel) == 0x0005F8, "Member 'UWBP_C_SeasonShop_RichText_C::Diamond_CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShop_RichText_C, Icon) == 0x000600, "Member 'UWBP_C_SeasonShop_RichText_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShop_RichText_C, Main_SizeBox) == 0x000608, "Member 'UWBP_C_SeasonShop_RichText_C::Main_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShop_RichText_C, PageLockReasonText) == 0x000610, "Member 'UWBP_C_SeasonShop_RichText_C::PageLockReasonText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShop_RichText_C, LabelText) == 0x000618, "Member 'UWBP_C_SeasonShop_RichText_C::LabelText' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShop_RichText_C, LabelIcon) == 0x000630, "Member 'UWBP_C_SeasonShop_RichText_C::LabelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_SeasonShop_RichText_C, LabelWidth) == 0x000658, "Member 'UWBP_C_SeasonShop_RichText_C::LabelWidth' has a wrong offset!");

}

