#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodSpiritAttribute

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodSpiritAttribute.WBP_G_V2_GodSpiritAttribute_C
// 0x0018 (0x0630 - 0x0618)
class UWBP_G_V2_GodSpiritAttribute_C final : public UHWGameplayAttributeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_GS_V1_GAProgressBarListener_C*     SpiritListener;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         SpiritProgressBar;                                 // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_GodSpiritAttribute_SpiritListener_K2Node_ComponentBoundEvent_0_OnGameplayAttributeProgressBarUpdated__DelegateSignature(float Percentage, float Value, float MaxValue);
	void ExecuteUbergraph_WBP_G_V2_GodSpiritAttribute(int32 EntryPoint);
	void InitializeWidget();
	void OnAttributesTracked();
	void OnAttributesUntracked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodSpiritAttribute_C">();
	}
	static class UWBP_G_V2_GodSpiritAttribute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodSpiritAttribute_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodSpiritAttribute_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodSpiritAttribute_C");
static_assert(sizeof(UWBP_G_V2_GodSpiritAttribute_C) == 0x000630, "Wrong size on UWBP_G_V2_GodSpiritAttribute_C");
static_assert(offsetof(UWBP_G_V2_GodSpiritAttribute_C, UberGraphFrame) == 0x000618, "Member 'UWBP_G_V2_GodSpiritAttribute_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodSpiritAttribute_C, SpiritListener) == 0x000620, "Member 'UWBP_G_V2_GodSpiritAttribute_C::SpiritListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodSpiritAttribute_C, SpiritProgressBar) == 0x000628, "Member 'UWBP_G_V2_GodSpiritAttribute_C::SpiritProgressBar' has a wrong offset!");

}

