#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodOmiBar_Sections

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodOmiBar_Sections.WBP_G_V2_GodOmiBar_Sections_C
// 0x0068 (0x0328 - 0x02C0)
class UWBP_G_V2_GodOmiBar_Sections_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWOverlay*                             Segments1;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments10;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments2;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments3;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments4;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments5;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments6;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments7;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments8;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Segments9;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      SegmentSwitcher;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          GeometryReceived;                                  // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_G_V2_GodOmiBar_Sections(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateSegmentCount(int32 SegmentCount);
	void UpdateSegmentScaling(const struct FGeometry& MyGeometry);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodOmiBar_Sections_C">();
	}
	static class UWBP_G_V2_GodOmiBar_Sections_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodOmiBar_Sections_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodOmiBar_Sections_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodOmiBar_Sections_C");
static_assert(sizeof(UWBP_G_V2_GodOmiBar_Sections_C) == 0x000328, "Wrong size on UWBP_G_V2_GodOmiBar_Sections_C");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments1) == 0x0002C8, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments10) == 0x0002D0, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments10' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments2) == 0x0002D8, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments3) == 0x0002E0, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments3' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments4) == 0x0002E8, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments4' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments5) == 0x0002F0, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments5' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments6) == 0x0002F8, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments6' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments7) == 0x000300, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments7' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments8) == 0x000308, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments8' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, Segments9) == 0x000310, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::Segments9' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, SegmentSwitcher) == 0x000318, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::SegmentSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodOmiBar_Sections_C, GeometryReceived) == 0x000320, "Member 'UWBP_G_V2_GodOmiBar_Sections_C::GeometryReceived' has a wrong offset!");

}

