#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Context_Bar

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Context_Bar.WBP_Context_Bar_C
// 0x0018 (0x0630 - 0x0618)
class UWBP_Context_Bar_C final : public URHContextBar
{
public:
	class UWidgetAnimation*                       MobileLayout;                                      // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FooterBG;                                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FooterBG_1;                                        // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool CanCloseOnLogout();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Context_Bar_C">();
	}
	static class UWBP_Context_Bar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Context_Bar_C>();
	}
};
static_assert(alignof(UWBP_Context_Bar_C) == 0x000008, "Wrong alignment on UWBP_Context_Bar_C");
static_assert(sizeof(UWBP_Context_Bar_C) == 0x000630, "Wrong size on UWBP_Context_Bar_C");
static_assert(offsetof(UWBP_Context_Bar_C, MobileLayout) == 0x000618, "Member 'UWBP_Context_Bar_C::MobileLayout' has a wrong offset!");
static_assert(offsetof(UWBP_Context_Bar_C, FooterBG) == 0x000620, "Member 'UWBP_Context_Bar_C::FooterBG' has a wrong offset!");
static_assert(offsetof(UWBP_Context_Bar_C, FooterBG_1) == 0x000628, "Member 'UWBP_Context_Bar_C::FooterBG_1' has a wrong offset!");

}

