#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Training_TargetDummy_Controls

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Prototype_Training_TargetDummy_Controls.WBP_G_Prototype_Training_TargetDummy_Controls_C.ChangeHoverState
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState final
{
public:
	class UHWTextBlock*                           Text;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHovered_0;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           UnHoverOverride;                                   // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState) == 0x000008, "Wrong alignment on WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState");
static_assert(sizeof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState) == 0x000030, "Wrong size on WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState, Text) == 0x000000, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState::Text' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState, IsHovered_0) == 0x000008, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState::IsHovered_0' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState, UnHoverOverride) == 0x00000C, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState::UnHoverOverride' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState, Temp_bool_Variable) == 0x000014, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState, Temp_struct_Variable) == 0x000018, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000020, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState, K2Node_Select_Default) == 0x000024, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ChangeHoverState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_Prototype_Training_TargetDummy_Controls.WBP_G_Prototype_Training_TargetDummy_Controls_C.ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls
// 0x0470 (0x0470 - 0x0000)
struct WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0048(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0078(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0090(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x00D0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00F8(0x0018)()
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0140(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0158(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01E8(0x0018)()
	int32                                         Temp_int_Variable;                                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0208(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0230(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0248(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_7;          // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x02A0(0x0018)()
	int32                                         Temp_int_Variable_2;                               // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x02C0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_8;          // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0308(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_2;                  // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_3;                  // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0340(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_9;          // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item;                           // 0x0380(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_Array_Get_Item_1;                         // 0x03B8(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_4;                  // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_10;             // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0418(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_11;             // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0440(0x0018)()
	int32                                         CallFunc_GetNumWidgets_ReturnValue;                // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x045C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_5;                  // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls) == 0x000008, "Wrong alignment on WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls");
static_assert(sizeof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls) == 0x000470, "Wrong size on WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, EntryPoint) == 0x000000, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_text_Variable) == 0x000008, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_text_Variable_1) == 0x000048, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_bool_Variable) == 0x000060, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_struct_Variable) == 0x000064, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_struct_Variable_1) == 0x00006C, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000078, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000090, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000A8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000B8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_bool_Variable_1) == 0x0000CC, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_bool_Variable_2) == 0x0000CD, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_IntToText_ReturnValue_3) == 0x0000D0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0000E8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, K2Node_Select_Default) == 0x0000F8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_SelectFloat_ReturnValue) == 0x000110, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, K2Node_Select_Default_1) == 0x000118, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Not_PreBool_ReturnValue) == 0x000120, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Add_IntInt_ReturnValue) == 0x000124, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Greater_IntInt_ReturnValue) == 0x000128, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_IsValid_ReturnValue) == 0x000129, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_SelectInt_ReturnValue) == 0x00012C, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Add_IntInt_ReturnValue_1) == 0x000130, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_SelectInt_ReturnValue_1) == 0x000138, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_IsValid_ReturnValue_1) == 0x00013C, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_IsValid_ReturnValue_2) == 0x00013D, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_MakeLiteralText_ReturnValue) == 0x000140, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000158, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000170, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_5) == 0x000180, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue) == 0x000190, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001A0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001B0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001C0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001E8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_int_Variable) == 0x000200, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_MakeLiteralText_ReturnValue_2) == 0x000208, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_6) == 0x000220, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000230, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Add_IntInt_ReturnValue_2) == 0x000240, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_int_Variable_1) == 0x000244, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_MakeLiteralText_ReturnValue_3) == 0x000248, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_7) == 0x000260, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000270, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Add_IntInt_ReturnValue_3) == 0x000280, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000288, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Less_IntInt_ReturnValue_1) == 0x000298, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0002A0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_int_Variable_2) == 0x0002B8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0002C0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_8) == 0x0002D8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_7) == 0x0002E8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_8) == 0x0002F8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000308, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_int_Loop_Counter_Variable) == 0x000320, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, Temp_int_Variable_3) == 0x000324, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Add_IntInt_ReturnValue_4) == 0x000328, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, K2Node_Select_Default_2) == 0x00032C, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_SelectInt_ReturnValue_2) == 0x000330, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_SelectInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000334, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_SelectInt_ReturnValue_3) == 0x000338, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_SelectInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Subtract_IntInt_ReturnValue) == 0x00033C, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_MakeLiteralText_ReturnValue_5) == 0x000340, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_TextToString_ReturnValue_9) == 0x000358, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_TextToString_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000368, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_IsValid_ReturnValue_3) == 0x000378, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Array_Get_Item) == 0x000380, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Array_Length_ReturnValue) == 0x0003A8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0003AC, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Less_IntInt_ReturnValue_2) == 0x0003AD, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Add_IntInt_ReturnValue_5) == 0x0003B0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Array_Get_Item_1) == 0x0003B8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0003E0, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_SelectInt_ReturnValue_4) == 0x0003E4, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_SelectInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_IntToString_ReturnValue) == 0x0003E8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_10) == 0x0003F8, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000408, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000418, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Concat_StrStr_ReturnValue_11) == 0x000430, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Concat_StrStr_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000440, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_GetNumWidgets_ReturnValue) == 0x000458, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_GetNumWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Add_IntInt_ReturnValue_6) == 0x00045C, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_Less_IntInt_ReturnValue_3) == 0x000460, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_SelectInt_ReturnValue_5) == 0x000464, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_SelectInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000468, "Member 'WBP_G_Prototype_Training_TargetDummy_Controls_C_ExecuteUbergraph_WBP_G_Prototype_Training_TargetDummy_Controls::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_G_Prototype_Training_TargetDummy_Controls.WBP_G_Prototype_Training_TargetDummy_Controls_C.SetBaseProtectionsText
// 0x0098 (0x0098 - 0x0000)
struct WBP_G_Prototype_Training_TargetDummy_Controls_C_SetBaseProtectionsText final
{
public:
	class AHWCharacter_Base*                      DummyPawn;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_GetHWAbilitySystem_bSuccess;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAbilitySystemComponent*              CallFunc_BP_GetHWAbilitySystem_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_2; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_2; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_3; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_3; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0040(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0060(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
