#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Tutorial_ProgressTracker_Item

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "S_NPE_QuestConfig_SubObjective_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Prototype_Tutorial_ProgressTracker_Item.WBP_G_Prototype_Tutorial_ProgressTracker_Item_C.InitializeNPEQuestProgressItem
// 0x0188 (0x0188 - 0x0000)
struct WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Goal;                                              // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FS_NPE_QuestConfig_SubObjective> Objectives;                                       // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0050)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_Prototype_Tutorial_ProgressTracker_Item_Objective_C* CallFunc_Create_ReturnValue;   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_NPE_QuestConfig_SubObjective        CallFunc_Array_Get_Item;                           // 0x00C8(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0110(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0170(0x0018)()
};
static_assert(alignof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem");
static_assert(sizeof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem) == 0x000188, "Wrong size on WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, Title) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::Title' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, Goal) == 0x000018, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::Goal' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, Description) == 0x000020, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::Description' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, Objectives) == 0x000038, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::Objectives' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000050, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0000F8, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_MakeLiteralInt_ReturnValue) == 0x000100, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000108, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, K2Node_MakeStruct_FormatArgumentData_1) == 0x000110, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, K2Node_MakeArray_Array) == 0x000160, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem, CallFunc_Format_ReturnValue) == 0x000170, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_InitializeNPEQuestProgressItem::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_ProgressTracker_Item.WBP_G_Prototype_Tutorial_ProgressTracker_Item_C.UpdateQuestObjectiveCompletion
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion final
{
public:
	struct FGameplayTag                           ObjectiveTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCompleted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_Prototype_Tutorial_ProgressTracker_Item_Objective_C* CallFunc_Map_Find_Value;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion");
static_assert(sizeof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion) == 0x000020, "Wrong size on WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion, ObjectiveTag) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion::ObjectiveTag' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion, bIsCompleted) == 0x000008, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion::bIsCompleted' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveCompletion::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_G_Prototype_Tutorial_ProgressTracker_Item.WBP_G_Prototype_Tutorial_ProgressTracker_Item_C.UpdateQuestObjectiveProgress
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress final
{
public:
	int32                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ObjectiveTag;                                      // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_Prototype_Tutorial_ProgressTracker_Item_Objective_C* CallFunc_Map_Find_Value;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress) == 0x000008, "Wrong alignment on WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress");
static_assert(sizeof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress) == 0x000020, "Wrong size on WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress, Progress) == 0x000000, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress::Progress' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress, ObjectiveTag) == 0x000004, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress::ObjectiveTag' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_G_Prototype_Tutorial_ProgressTracker_Item_C_UpdateQuestObjectiveProgress::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

