#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_HUD_SinglePromptWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_HUD_SinglePromptWidget.WBP_S_HUD_SinglePromptWidget_C.DisplayIconOnly
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly) == 0x000010, "Wrong alignment on WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly");
static_assert(sizeof(WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly) == 0x0000E0, "Wrong size on WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly, Brush) == 0x000000, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly::Brush' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0000D0, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayIconOnly::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");

// Function WBP_S_HUD_SinglePromptWidget.WBP_S_HUD_SinglePromptWidget_C.DisplayKeyPressed
// 0x0040 (0x0040 - 0x0000)
struct WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed final
{
public:
	bool                                          bIsPressed;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed) == 0x000008, "Wrong alignment on WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed");
static_assert(sizeof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed) == 0x000040, "Wrong size on WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, bIsPressed) == 0x000000, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::bIsPressed' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, Temp_struct_Variable) == 0x000008, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, Temp_bool_Variable) == 0x000028, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, Temp_byte_Variable) == 0x000029, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, Temp_byte_Variable_1) == 0x00002A, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, Temp_bool_Variable_1) == 0x00002B, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, K2Node_Select_Default) == 0x00002C, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed, K2Node_Select_Default_1) == 0x000030, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyPressed::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_S_HUD_SinglePromptWidget.WBP_S_HUD_SinglePromptWidget_C.DisplayKeyTextOnly
// 0x0030 (0x0030 - 0x0000)
struct WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly) == 0x000008, "Wrong alignment on WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly");
static_assert(sizeof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly) == 0x000030, "Wrong size on WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly, Label) == 0x000000, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly::Label' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly, CallFunc_TextToUpper_ReturnValue) == 0x000018, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyTextOnly::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

// Function WBP_S_HUD_SinglePromptWidget.WBP_S_HUD_SinglePromptWidget_C.DisplayKeyWithBackground
// 0x0100 (0x0100 - 0x0000)
struct WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground final
{
public:
	struct FSlateBrush                            Brush;                                             // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Label;                                             // 0x00D0(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x00E8(0x0018)()
};
static_assert(alignof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground) == 0x000010, "Wrong alignment on WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground");
static_assert(sizeof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground) == 0x000100, "Wrong size on WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground, Brush) == 0x000000, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground::Brush' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground, Label) == 0x0000D0, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground::Label' has a wrong offset!");
static_assert(offsetof(WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground, CallFunc_TextToUpper_ReturnValue) == 0x0000E8, "Member 'WBP_S_HUD_SinglePromptWidget_C_DisplayKeyWithBackground::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");

}

