#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TeamDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_TeamDisplay.WBP_G_V2_TeamDisplay_C
// 0x0028 (0x0660 - 0x0638)
class UWBP_G_V2_TeamDisplay_C final : public UHWTeamBarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMargin                                SlotMargin;                                        // 0x0640(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           LocalModifierOverrideTag;                          // 0x0650(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          GridHorizontalAlignment;                           // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_TeamDisplay(int32 EntryPoint);
	struct FGameplayTag GetLocalModifierTagOverride();
	void InitDesignLayout();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_TeamDisplay_C">();
	}
	static class UWBP_G_V2_TeamDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_TeamDisplay_C>();
	}
};
static_assert(alignof(UWBP_G_V2_TeamDisplay_C) == 0x000008, "Wrong alignment on UWBP_G_V2_TeamDisplay_C");
static_assert(sizeof(UWBP_G_V2_TeamDisplay_C) == 0x000660, "Wrong size on UWBP_G_V2_TeamDisplay_C");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_C, UberGraphFrame) == 0x000638, "Member 'UWBP_G_V2_TeamDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_C, SlotMargin) == 0x000640, "Member 'UWBP_G_V2_TeamDisplay_C::SlotMargin' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_C, LocalModifierOverrideTag) == 0x000650, "Member 'UWBP_G_V2_TeamDisplay_C::LocalModifierOverrideTag' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TeamDisplay_C, GridHorizontalAlignment) == 0x000658, "Member 'UWBP_G_V2_TeamDisplay_C::GridHorizontalAlignment' has a wrong offset!");

}

