#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_FPSDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_FPSDisplay.WBP_G_V2_FPSDisplay_C
// 0x0018 (0x0620 - 0x0608)
class UWBP_G_V2_FPSDisplay_C final : public UHWFPSDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           FPSCount;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           FPSText;                                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_FPSDisplay(int32 EntryPoint);
	void UpdateFPS(float FPSCounter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_FPSDisplay_C">();
	}
	static class UWBP_G_V2_FPSDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_FPSDisplay_C>();
	}
};
static_assert(alignof(UWBP_G_V2_FPSDisplay_C) == 0x000008, "Wrong alignment on UWBP_G_V2_FPSDisplay_C");
static_assert(sizeof(UWBP_G_V2_FPSDisplay_C) == 0x000620, "Wrong size on UWBP_G_V2_FPSDisplay_C");
static_assert(offsetof(UWBP_G_V2_FPSDisplay_C, UberGraphFrame) == 0x000608, "Member 'UWBP_G_V2_FPSDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_FPSDisplay_C, FPSCount) == 0x000610, "Member 'UWBP_G_V2_FPSDisplay_C::FPSCount' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_FPSDisplay_C, FPSText) == 0x000618, "Member 'UWBP_G_V2_FPSDisplay_C::FPSText' has a wrong offset!");

}

