#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyModuleCardSlot

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyModuleCardSlot.WBP_PartyModuleCardSlot_C
// 0x0070 (0x0628 - 0x05B8)
class UWBP_PartyModuleCardSlot_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               AddButton_Hover;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Addbutton_HoverGradient;                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               AddButton_Up;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AddButtonHover;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                EmptySlotGroup;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_354;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_player_card_module_C*              PlayerCard;                                        // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SuggestionGroup;                                   // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                HoverPartyModuleCardSlotSFX;                       // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                ClickPartyModuleCardSlotSFX;                       // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Party_Member_Hovered();
	void Add_Party_Member_Selected();
	void Add_Party_Member_Unhovered();
	void BndEvt__EmptySlotGroup_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__EmptySlotGroup_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__EmptySlotGroup_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_PartyModuleCardSlot(int32 EntryPoint);
	void GamepadHover();
	void GamepadUnhover();
	void InitializeWidget();
	bool NavigateConfirm();
	void PlayHoverSFX();
	void SetEmptyView();
	void SetFriendView(class URH_RHFriendAndPlatformFriend* Friend);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyModuleCardSlot_C">();
	}
	static class UWBP_PartyModuleCardSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyModuleCardSlot_C>();
	}
};
static_assert(alignof(UWBP_PartyModuleCardSlot_C) == 0x000008, "Wrong alignment on UWBP_PartyModuleCardSlot_C");
static_assert(sizeof(UWBP_PartyModuleCardSlot_C) == 0x000628, "Wrong size on UWBP_PartyModuleCardSlot_C");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_PartyModuleCardSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, AddButton_Hover) == 0x0005C0, "Member 'UWBP_PartyModuleCardSlot_C::AddButton_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, Addbutton_HoverGradient) == 0x0005C8, "Member 'UWBP_PartyModuleCardSlot_C::Addbutton_HoverGradient' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, AddButton_Up) == 0x0005D0, "Member 'UWBP_PartyModuleCardSlot_C::AddButton_Up' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, AddButtonHover) == 0x0005D8, "Member 'UWBP_PartyModuleCardSlot_C::AddButtonHover' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, EmptySlotGroup) == 0x0005E0, "Member 'UWBP_PartyModuleCardSlot_C::EmptySlotGroup' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, Image_354) == 0x0005E8, "Member 'UWBP_PartyModuleCardSlot_C::Image_354' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, PlayerCard) == 0x0005F0, "Member 'UWBP_PartyModuleCardSlot_C::PlayerCard' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, SuggestionGroup) == 0x0005F8, "Member 'UWBP_PartyModuleCardSlot_C::SuggestionGroup' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, Switcher) == 0x000600, "Member 'UWBP_PartyModuleCardSlot_C::Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, HoverPartyModuleCardSlotSFX) == 0x000608, "Member 'UWBP_PartyModuleCardSlot_C::HoverPartyModuleCardSlotSFX' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, ClickPartyModuleCardSlotSFX) == 0x000610, "Member 'UWBP_PartyModuleCardSlot_C::ClickPartyModuleCardSlotSFX' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, SFXHover) == 0x000618, "Member 'UWBP_PartyModuleCardSlot_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_PartyModuleCardSlot_C, SFXClick) == 0x000620, "Member 'UWBP_PartyModuleCardSlot_C::SFXClick' has a wrong offset!");

}

