#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_EquipmentAcquisitionPopupManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_EquipmentAcquisitionPopupManager.WBP_G_V2_EquipmentAcquisitionPopupManager_C.ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEquipmentInstance*                   K2Node_Event_EquipmentInstance;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager) == 0x000008, "Wrong alignment on WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager");
static_assert(sizeof(WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager) == 0x000010, "Wrong size on WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager");
static_assert(offsetof(WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager, EntryPoint) == 0x000000, "Member 'WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager, K2Node_Event_EquipmentInstance) == 0x000008, "Member 'WBP_G_V2_EquipmentAcquisitionPopupManager_C_ExecuteUbergraph_WBP_G_V2_EquipmentAcquisitionPopupManager::K2Node_Event_EquipmentInstance' has a wrong offset!");

// Function WBP_G_V2_EquipmentAcquisitionPopupManager.WBP_G_V2_EquipmentAcquisitionPopupManager_C.OnEquipmentItemPurchased
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_EquipmentAcquisitionPopupManager_C_OnEquipmentItemPurchased final
{
public:
	class UHWEquipmentInstance*                   EquipmentInstance;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EquipmentAcquisitionPopupManager_C_OnEquipmentItemPurchased) == 0x000008, "Wrong alignment on WBP_G_V2_EquipmentAcquisitionPopupManager_C_OnEquipmentItemPurchased");
static_assert(sizeof(WBP_G_V2_EquipmentAcquisitionPopupManager_C_OnEquipmentItemPurchased) == 0x000008, "Wrong size on WBP_G_V2_EquipmentAcquisitionPopupManager_C_OnEquipmentItemPurchased");
static_assert(offsetof(WBP_G_V2_EquipmentAcquisitionPopupManager_C_OnEquipmentItemPurchased, EquipmentInstance) == 0x000000, "Member 'WBP_G_V2_EquipmentAcquisitionPopupManager_C_OnEquipmentItemPurchased::EquipmentInstance' has a wrong offset!");

}

