#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_DivisionDisplay

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_DivisionDisplay.WBP_C_DivisionDisplay_C.PopulateDivision
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_C_DivisionDisplay_C_PopulateDivision final
{
public:
	struct FHWSkillRatingDivision                 Division;                                          // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A8(0x0018)()
};
static_assert(alignof(WBP_C_DivisionDisplay_C_PopulateDivision) == 0x000008, "Wrong alignment on WBP_C_DivisionDisplay_C_PopulateDivision");
static_assert(sizeof(WBP_C_DivisionDisplay_C_PopulateDivision) == 0x0000C0, "Wrong size on WBP_C_DivisionDisplay_C_PopulateDivision");
static_assert(offsetof(WBP_C_DivisionDisplay_C_PopulateDivision, Division) == 0x000000, "Member 'WBP_C_DivisionDisplay_C_PopulateDivision::Division' has a wrong offset!");
static_assert(offsetof(WBP_C_DivisionDisplay_C_PopulateDivision, K2Node_MakeStruct_FormatArgumentData) == 0x000048, "Member 'WBP_C_DivisionDisplay_C_PopulateDivision::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_C_DivisionDisplay_C_PopulateDivision, K2Node_MakeArray_Array) == 0x000098, "Member 'WBP_C_DivisionDisplay_C_PopulateDivision::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_C_DivisionDisplay_C_PopulateDivision, CallFunc_Format_ReturnValue) == 0x0000A8, "Member 'WBP_C_DivisionDisplay_C_PopulateDivision::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_C_DivisionDisplay.WBP_C_DivisionDisplay_C.GetDivisionData
// 0x0048 (0x0048 - 0x0000)
struct WBP_C_DivisionDisplay_C_GetDivisionData final
{
public:
	struct FHWSkillRatingDivision                 DivisionData_0;                                    // 0x0000(0x0048)(Parm, OutParm)
};
static_assert(alignof(WBP_C_DivisionDisplay_C_GetDivisionData) == 0x000008, "Wrong alignment on WBP_C_DivisionDisplay_C_GetDivisionData");
static_assert(sizeof(WBP_C_DivisionDisplay_C_GetDivisionData) == 0x000048, "Wrong size on WBP_C_DivisionDisplay_C_GetDivisionData");
static_assert(offsetof(WBP_C_DivisionDisplay_C_GetDivisionData, DivisionData_0) == 0x000000, "Member 'WBP_C_DivisionDisplay_C_GetDivisionData::DivisionData_0' has a wrong offset!");

}

