#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_AutoBuyBuildSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_AutoBuyBuildSelector.WBP_G_V1_AutoBuyBuildSelector_C
// 0x0040 (0x06F8 - 0x06B8)
class UWBP_G_V1_AutoBuyBuildSelector_C final : public UHWAutoBuyBuildSelector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWHorizontalBox*                       Build_HorizontalBox;                               // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             BuildLoadThrobberSizeBox;                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           BuildTitle;                                        // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       MainContentHorizontalBox;                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       ManualBuildHorizontalBox;                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TitleTextfield;                                    // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           WarningTextfield;                                  // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ClearBuilds();
	void ExecuteUbergraph_WBP_G_V1_AutoBuyBuildSelector(int32 EntryPoint);
	void OnAutoBuildEntryAdded(class UHWAutoBuyBuildEntry* Entry);
	void OnAutoBuildEntryAugmentAdded(class UHWAutoBuyBuildEntry_Augment* Entry);
	void OnAutoBuildEntryAugmentRemoved(class UHWAutoBuyBuildEntry_Augment* Entry);
	void OnAutoBuildEntryRemoved(class UHWAutoBuyBuildEntry* Entry);
	void OnRelicEntryAdded(class UHWAutoBuyBuildEntry_Augment* Entry);
	void PopulateBuilds(const class UHWCharacterItem* CharacterItem);
	void ShowRelicSelection();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_AutoBuyBuildSelector_C">();
	}
	static class UWBP_G_V1_AutoBuyBuildSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_AutoBuyBuildSelector_C>();
	}
};
static_assert(alignof(UWBP_G_V1_AutoBuyBuildSelector_C) == 0x000008, "Wrong alignment on UWBP_G_V1_AutoBuyBuildSelector_C");
static_assert(sizeof(UWBP_G_V1_AutoBuyBuildSelector_C) == 0x0006F8, "Wrong size on UWBP_G_V1_AutoBuyBuildSelector_C");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildSelector_C, UberGraphFrame) == 0x0006B8, "Member 'UWBP_G_V1_AutoBuyBuildSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildSelector_C, Build_HorizontalBox) == 0x0006C0, "Member 'UWBP_G_V1_AutoBuyBuildSelector_C::Build_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildSelector_C, BuildLoadThrobberSizeBox) == 0x0006C8, "Member 'UWBP_G_V1_AutoBuyBuildSelector_C::BuildLoadThrobberSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildSelector_C, BuildTitle) == 0x0006D0, "Member 'UWBP_G_V1_AutoBuyBuildSelector_C::BuildTitle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildSelector_C, MainContentHorizontalBox) == 0x0006D8, "Member 'UWBP_G_V1_AutoBuyBuildSelector_C::MainContentHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildSelector_C, ManualBuildHorizontalBox) == 0x0006E0, "Member 'UWBP_G_V1_AutoBuyBuildSelector_C::ManualBuildHorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildSelector_C, TitleTextfield) == 0x0006E8, "Member 'UWBP_G_V1_AutoBuyBuildSelector_C::TitleTextfield' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_AutoBuyBuildSelector_C, WarningTextfield) == 0x0006F0, "Member 'UWBP_G_V1_AutoBuyBuildSelector_C::WarningTextfield' has a wrong offset!");

}

