#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodPortrait

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GodPortrait.WBP_G_V2_GodPortrait_C
// 0x0040 (0x0790 - 0x0750)
class UWBP_G_V2_GodPortrait_C final : public UHWTooltipableEquipmentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0750(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2_GodPortrait_PlayerLevel_C*    GodLevel;                                          // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodPortrait;                                       // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitTest;                                           // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverBG;                                           // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RespawnOverlay;                                    // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RespawnText;                                       // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXTooltipHover;                                   // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_GodPortrait_HitTest_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodPortrait_HitTest_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_GodPortrait_HitTest_K2Node_ComponentBoundEvent_2_OnButtonRightClickedEvent__DelegateSignature();
	void BP_OnDeactivated();
	void CharacterItemChanged(const class UHWCharacterItem* NewCharacterItem);
	void Construct();
	void DisplayCharacterRespawnState(bool bIsAlive, float RemainingRespawnTime);
	class UWidget* Do_Custom_Navigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_G_V2_GodPortrait(int32 EntryPoint);
	const class FText GetWidgetName();
	void UpdateCharacterRespawnTime(float RemainingRespawnTime);

	class UWidget* BP_GetDesiredFocusTarget() const;
	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;
	TArray<class UHWCharacterWidget*> GetCharacterWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GodPortrait_C">();
	}
	static class UWBP_G_V2_GodPortrait_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GodPortrait_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GodPortrait_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GodPortrait_C");
static_assert(sizeof(UWBP_G_V2_GodPortrait_C) == 0x000790, "Wrong size on UWBP_G_V2_GodPortrait_C");
static_assert(offsetof(UWBP_G_V2_GodPortrait_C, UberGraphFrame) == 0x000750, "Member 'UWBP_G_V2_GodPortrait_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_C, GodLevel) == 0x000758, "Member 'UWBP_G_V2_GodPortrait_C::GodLevel' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_C, GodPortrait) == 0x000760, "Member 'UWBP_G_V2_GodPortrait_C::GodPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_C, HitTest) == 0x000768, "Member 'UWBP_G_V2_GodPortrait_C::HitTest' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_C, HoverBG) == 0x000770, "Member 'UWBP_G_V2_GodPortrait_C::HoverBG' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_C, RespawnOverlay) == 0x000778, "Member 'UWBP_G_V2_GodPortrait_C::RespawnOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_C, RespawnText) == 0x000780, "Member 'UWBP_G_V2_GodPortrait_C::RespawnText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GodPortrait_C, SFXTooltipHover) == 0x000788, "Member 'UWBP_G_V2_GodPortrait_C::SFXTooltipHover' has a wrong offset!");

}

