#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchLobby

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction) == 0x000018, "Wrong size on WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction, CallFunc_HasFocusedDescendants_ReturnValue) == 0x000011, "Member 'WBP_GS_EndOfMatchLobby_C_BP_OnHandleBackAction::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C.ExecuteUbergraph_WBP_GS_EndOfMatchLobby
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FText                                   CallFunc_GetMatchSessionId_ReturnValue;            // 0x0020(0x0018)()
	class FText                                   CallFunc_GetGameModeName_ReturnValue;              // 0x0038(0x0018)()
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetMatchSessionId_ReturnValue_1;          // 0x0068(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBooleanAppSetting_bOutSettingValue;    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBooleanAppSetting_ReturnValue;         // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& AppSettingTag, bool bValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0094(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00A8(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby");
static_assert(sizeof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby) == 0x0000B0, "Wrong size on WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, EntryPoint) == 0x000000, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_GetMatchSessionId_ReturnValue) == 0x000020, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_GetMatchSessionId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_GetGameModeName_ReturnValue) == 0x000038, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_GetGameModeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000060, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_GetMatchSessionId_ReturnValue_1) == 0x000068, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_GetMatchSessionId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_GetCurrentInputState_ReturnValue) == 0x000090, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_GetBooleanAppSetting_bOutSettingValue) == 0x000091, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_GetBooleanAppSetting_bOutSettingValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_GetBooleanAppSetting_ReturnValue) == 0x000092, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_GetBooleanAppSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, K2Node_CreateDelegate_OutputDelegate_1) == 0x000094, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, CallFunc_BooleanAND_ReturnValue) == 0x0000A4, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby, Temp_struct_Variable) == 0x0000A8, "Member 'WBP_GS_EndOfMatchLobby_C_ExecuteUbergraph_WBP_GS_EndOfMatchLobby::Temp_struct_Variable' has a wrong offset!");

// Function WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C.HandleInputStateChanged
// 0x0006 (0x0006 - 0x0000)
struct WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged) == 0x000001, "Wrong alignment on WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged");
static_assert(sizeof(WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged) == 0x000006, "Wrong size on WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged, InputState) == 0x000000, "Member 'WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged::InputState' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged, Temp_bool_Variable) == 0x000001, "Member 'WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged, Temp_byte_Variable) == 0x000003, "Member 'WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged, K2Node_Select_Default) == 0x000005, "Member 'WBP_GS_EndOfMatchLobby_C_HandleInputStateChanged::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C.OnEOMLChatEnabledUpdated
// 0x0010 (0x0010 - 0x0000)
struct WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated final
{
public:
	struct FGameplayTag                           AppSettingTag;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          bValue;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated) == 0x000004, "Wrong alignment on WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated");
static_assert(sizeof(WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated) == 0x000010, "Wrong size on WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated, AppSettingTag) == 0x000000, "Member 'WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated::AppSettingTag' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated, bValue) == 0x000008, "Member 'WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated::bValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated, Temp_bool_Variable) == 0x000009, "Member 'WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated, Temp_byte_Variable) == 0x00000A, "Member 'WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated, Temp_byte_Variable_1) == 0x00000B, "Member 'WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated, K2Node_Select_Default) == 0x00000C, "Member 'WBP_GS_EndOfMatchLobby_C_OnEOMLChatEnabledUpdated::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C.OnFocusTextChatAction
// 0x0010 (0x0010 - 0x0000)
struct WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction final
{
public:
	bool                                          CallFunc_GetBooleanAppSetting_bOutSettingValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBooleanAppSetting_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTextEntryEnabled_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction");
static_assert(sizeof(WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction) == 0x000010, "Wrong size on WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction, CallFunc_GetBooleanAppSetting_bOutSettingValue) == 0x000000, "Member 'WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction::CallFunc_GetBooleanAppSetting_bOutSettingValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction, CallFunc_GetBooleanAppSetting_ReturnValue) == 0x000001, "Member 'WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction::CallFunc_GetBooleanAppSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction, CallFunc_IsTextEntryEnabled_ReturnValue) == 0x000002, "Member 'WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction::CallFunc_IsTextEntryEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction, CallFunc_BooleanAND_ReturnValue_1) == 0x000004, "Member 'WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchLobby_C_OnFocusTextChatAction::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C.UpdatePlayAgainButtonState
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonState final
{
public:
	bool                                          bButtonEnabled;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonState) == 0x000001, "Wrong alignment on WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonState");
static_assert(sizeof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonState) == 0x000001, "Wrong size on WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonState");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonState, bButtonEnabled) == 0x000000, "Member 'WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonState::bButtonEnabled' has a wrong offset!");

// Function WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C.UpdatePlayAgainButtonVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility) == 0x000001, "Wrong alignment on WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility");
static_assert(sizeof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility) == 0x000005, "Wrong size on WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility, bShouldShow) == 0x000000, "Member 'WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility::bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_GS_EndOfMatchLobby_C_UpdatePlayAgainButtonVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GS_EndOfMatchLobby.WBP_GS_EndOfMatchLobby_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_EndOfMatchLobby_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchLobby_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchLobby_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_GS_EndOfMatchLobby_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_GS_EndOfMatchLobby_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_GS_EndOfMatchLobby_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_GS_EndOfMatchLobby_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

