#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetailsScreenWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodDetailsScreenWidget.WBP_C_GodDetailsScreenWidget_C
// 0x02F8 (0x0AB0 - 0x07B8)
class UWBP_C_GodDetailsScreenWidget_C final : public UHWGodDetailsScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWVerticalBox*                         ActionButton_VerticalBox;                          // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodDetailsNavArrows_C*           ArrowLeft;                                         // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodDetailsNavArrows_C*           ArrowRight;                                        // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Disclaimer;                                        // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodNameText;                                       // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       GodPagination_HorizontalBox;                       // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodPantheonImage;                                  // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodTitleText;                                      // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage;                                           // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_1;                                         // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_2;                                         // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_3;                                         // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_4;                                         // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_6;                                         // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_46;                                        // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_88;                                        // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             LeftGodPrompt;                                     // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Owned;                                             // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PremiumPriceDisplay;                               // 0x0850(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              PurchaseButton;                                    // 0x0858(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightGodPrompt;                                    // 0x0860(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UnlockCallout;                                     // 0x0868(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           UnlockGod;                                         // 0x0870(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             UnlockStatus;                                      // 0x0878(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class ACineCameraActor>        SceneCamera;                                       // 0x0880(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UHWSkinItem*                            DefaultSkinItem;                                   // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      EmotePreviewFX;                                    // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWSkinItem*                            SelectedSkinItem;                                  // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UHWCollectionItem*                      SelectedCollectionItem;                            // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHWSkinnablePreviewActor*               GodPreviewActor;                                   // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHWSkinnablePreviewActor*               AnimPreviewActor;                                  // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D8[0x8];                                      // 0x08D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             PreviewActorSpawnTransform;                        // 0x08E0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AnimLoopTimerHandle;                               // 0x0940(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           EmoteLoopTimerHandle;                              // 0x0948(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMontageBlendSettings                  Blend_in_Settings;                                 // 0x0950(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMontageBlendSettings                  Blend_Out_Settings;                                // 0x0970(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<struct FGameplayTag>                   Gameplay_Tags;                                     // 0x0990(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldShowSkinPreview;                             // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       PreviewerGround;                                   // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PreviewOffsetLerped;                               // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraTransformDefault;                            // 0x09B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraTransformLerp;                               // 0x09D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraTransformTarget;                             // 0x09E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraLookAtTransformDefault;                      // 0x0A00(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   SceneCameraComponent;                              // 0x0A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWCharacterItem*                       CacheGodItem;                                      // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASceneArtManager_C*                     SceneArtManagerActor;                              // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandleBufferPlateTransition;                  // 0x0A30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandleDelayPlateTransition;                   // 0x0A38(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      PantheonMatInstance;                               // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       CachePantheonMatInstance;                          // 0x0A48(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       PantheonSoftMatInstance;                           // 0x0A70(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PantheonOnlyFromTag;                               // 0x0A98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AsyncLoadEmoteNiagara(TSoftObjectPtr<class UNiagaraSystem> NewParam);
	void AsyncLoadMaterialInstance(TSoftObjectPtr<class UMaterialInstance> Asset);
	void BndEvt__WBP_C_GodDetailsScreenWidget_ArrowLeft_K2Node_ComponentBoundEvent_0_OnTabNavBtnClicked__DelegateSignature(class UHWWidget* Button_Widget);
	void BndEvt__WBP_C_GodDetailsScreenWidget_ArrowRight_K2Node_ComponentBoundEvent_1_OnTabNavBtnClicked__DelegateSignature(class UHWWidget* Button_Widget);
	void BndEvt__WBP_C_GodDetailsScreenWidget_PurchaseButton_K2Node_ComponentBoundEvent_2_OnHWButtonEvent__DelegateSignature();
	void BufferTransitionPlate();
	void CreateAnimPreviewActorFromSkin(class UHWSkinItem* SkinItem);
	void CreateGodPreviewActorFromSkin(class UHWSkinItem* SkinItem);
	void DelayTickSetCamera();
	void DelayTickSetCamera1();
	void DelayTickSetCamera2();
	void DelayTransitionPlate();
	void ExecuteUbergraph_WBP_C_GodDetailsScreenWidget(int32 EntryPoint);
	void FindBestBoneLocationForAimAt(class USkeletalMeshComponent* SkeletalMeshComp, struct FVector* BestLocation, bool* Succesful);
	void GetAnimMontageFromCollectionItem(class UAnimMontage** OutMontage);
	void GetPreviewGround(class AStaticMeshActor** Ground);
	void HandleAnimSelected();
	void HandleAscensionItemSelected(class UHWGodAscensionTrackEntryWidget* EntryWidget, const class UPlatformInventoryItem* InventoryItem, class URHStoreItem* StoreItem);
	void HandleCollectionItemSelected(class UHWItemDisplayWidget* EntryWidget, const class UHWInventoryItem* InventoryItem);
	void HandleEmoteSelected();
	void HandleRotatePreviewAction();
	void HandleRotatePreviewActionHeld(float HoldPercent, int32 Direction);
	void InitCamera(const struct FVector& RelativeLocation);
	void InitializeWidget();
	void InitPantheonPlate();
	void OnActiveDetailsWidgetSet(class UHWTabBarWidget* TabBarWidget, int32 Index_0, EHWTabChangeCause Cause);
	void OnGodSet();
	void OnHide();
	void OnLoaded_A9F562FC488DBA5C58F057BF789CAFC0(class UObject* Loaded);
	void OnLoaded_AAECA1CA4C123D2B763D768DD742033E(class UObject* Loaded);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnNextGodActionPressed();
	void OnPreviousGodActionPressed();
	void OnSelectedCharacterSkinLoaded();
	void OnShown();
	void PantheonPlate();
	void PlayEmoteFx(class UNiagaraSystem* EmoteFX);
	void PreviewRotate(double Direction);
	void ReturnCameraToDefault();
	void SetCamera();
	void SetSceneVisibility(bool GodPreviewVisible, bool AnimPreviewVisible, bool EmoteFXVisible);
	void SetupChildBindings();
	void TearDownScene();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TransitionPlate();
	void UninitializeWidget();
	void UpdateBounds();
	void UpdateCamera(const struct FVector& Character);
	void UpdateGodItemUnlockPrice(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroupTag);
	void UpdatePreviewActorVisibility(class AHWSkinnablePreviewActor* PreviewActor, bool IsVisible_0);
	void UpdateToggleGodPrompt(bool bShow);
	void UpdateUnlockPromptVisibility(bool bCurrentTabShouldShowPrompt, EHWCollectionItemStatus GodItemStatus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodDetailsScreenWidget_C">();
	}
	static class UWBP_C_GodDetailsScreenWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodDetailsScreenWidget_C>();
	}
};
static_assert(alignof(UWBP_C_GodDetailsScreenWidget_C) == 0x000010, "Wrong alignment on UWBP_C_GodDetailsScreenWidget_C");
static_assert(sizeof(UWBP_C_GodDetailsScreenWidget_C) == 0x000AB0, "Wrong size on UWBP_C_GodDetailsScreenWidget_C");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, UberGraphFrame) == 0x0007B8, "Member 'UWBP_C_GodDetailsScreenWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, ActionButton_VerticalBox) == 0x0007C0, "Member 'UWBP_C_GodDetailsScreenWidget_C::ActionButton_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, ArrowLeft) == 0x0007C8, "Member 'UWBP_C_GodDetailsScreenWidget_C::ArrowLeft' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, ArrowRight) == 0x0007D0, "Member 'UWBP_C_GodDetailsScreenWidget_C::ArrowRight' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, Disclaimer) == 0x0007D8, "Member 'UWBP_C_GodDetailsScreenWidget_C::Disclaimer' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, GodNameText) == 0x0007E0, "Member 'UWBP_C_GodDetailsScreenWidget_C::GodNameText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, GodPagination_HorizontalBox) == 0x0007E8, "Member 'UWBP_C_GodDetailsScreenWidget_C::GodPagination_HorizontalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, GodPantheonImage) == 0x0007F0, "Member 'UWBP_C_GodDetailsScreenWidget_C::GodPantheonImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, GodTitleText) == 0x0007F8, "Member 'UWBP_C_GodDetailsScreenWidget_C::GodTitleText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, HWImage) == 0x000800, "Member 'UWBP_C_GodDetailsScreenWidget_C::HWImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, HWImage_1) == 0x000808, "Member 'UWBP_C_GodDetailsScreenWidget_C::HWImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, HWImage_2) == 0x000810, "Member 'UWBP_C_GodDetailsScreenWidget_C::HWImage_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, HWImage_3) == 0x000818, "Member 'UWBP_C_GodDetailsScreenWidget_C::HWImage_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, HWImage_4) == 0x000820, "Member 'UWBP_C_GodDetailsScreenWidget_C::HWImage_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, HWImage_6) == 0x000828, "Member 'UWBP_C_GodDetailsScreenWidget_C::HWImage_6' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, HWImage_46) == 0x000830, "Member 'UWBP_C_GodDetailsScreenWidget_C::HWImage_46' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, HWImage_88) == 0x000838, "Member 'UWBP_C_GodDetailsScreenWidget_C::HWImage_88' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, LeftGodPrompt) == 0x000840, "Member 'UWBP_C_GodDetailsScreenWidget_C::LeftGodPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, Owned) == 0x000848, "Member 'UWBP_C_GodDetailsScreenWidget_C::Owned' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, PremiumPriceDisplay) == 0x000850, "Member 'UWBP_C_GodDetailsScreenWidget_C::PremiumPriceDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, PurchaseButton) == 0x000858, "Member 'UWBP_C_GodDetailsScreenWidget_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, RightGodPrompt) == 0x000860, "Member 'UWBP_C_GodDetailsScreenWidget_C::RightGodPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, UnlockCallout) == 0x000868, "Member 'UWBP_C_GodDetailsScreenWidget_C::UnlockCallout' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, UnlockGod) == 0x000870, "Member 'UWBP_C_GodDetailsScreenWidget_C::UnlockGod' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, UnlockStatus) == 0x000878, "Member 'UWBP_C_GodDetailsScreenWidget_C::UnlockStatus' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, SceneCamera) == 0x000880, "Member 'UWBP_C_GodDetailsScreenWidget_C::SceneCamera' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, DefaultSkinItem) == 0x0008A8, "Member 'UWBP_C_GodDetailsScreenWidget_C::DefaultSkinItem' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, EmotePreviewFX) == 0x0008B0, "Member 'UWBP_C_GodDetailsScreenWidget_C::EmotePreviewFX' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, SelectedSkinItem) == 0x0008B8, "Member 'UWBP_C_GodDetailsScreenWidget_C::SelectedSkinItem' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, SelectedCollectionItem) == 0x0008C0, "Member 'UWBP_C_GodDetailsScreenWidget_C::SelectedCollectionItem' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, GodPreviewActor) == 0x0008C8, "Member 'UWBP_C_GodDetailsScreenWidget_C::GodPreviewActor' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, AnimPreviewActor) == 0x0008D0, "Member 'UWBP_C_GodDetailsScreenWidget_C::AnimPreviewActor' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, PreviewActorSpawnTransform) == 0x0008E0, "Member 'UWBP_C_GodDetailsScreenWidget_C::PreviewActorSpawnTransform' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, AnimLoopTimerHandle) == 0x000940, "Member 'UWBP_C_GodDetailsScreenWidget_C::AnimLoopTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, EmoteLoopTimerHandle) == 0x000948, "Member 'UWBP_C_GodDetailsScreenWidget_C::EmoteLoopTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, Blend_in_Settings) == 0x000950, "Member 'UWBP_C_GodDetailsScreenWidget_C::Blend_in_Settings' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, Blend_Out_Settings) == 0x000970, "Member 'UWBP_C_GodDetailsScreenWidget_C::Blend_Out_Settings' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, Gameplay_Tags) == 0x000990, "Member 'UWBP_C_GodDetailsScreenWidget_C::Gameplay_Tags' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, ShouldShowSkinPreview) == 0x0009A0, "Member 'UWBP_C_GodDetailsScreenWidget_C::ShouldShowSkinPreview' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, PreviewerGround) == 0x0009A8, "Member 'UWBP_C_GodDetailsScreenWidget_C::PreviewerGround' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, PreviewOffsetLerped) == 0x0009B0, "Member 'UWBP_C_GodDetailsScreenWidget_C::PreviewOffsetLerped' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, CameraTransformDefault) == 0x0009B8, "Member 'UWBP_C_GodDetailsScreenWidget_C::CameraTransformDefault' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, CameraTransformLerp) == 0x0009D0, "Member 'UWBP_C_GodDetailsScreenWidget_C::CameraTransformLerp' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, CameraTransformTarget) == 0x0009E8, "Member 'UWBP_C_GodDetailsScreenWidget_C::CameraTransformTarget' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, CameraLookAtTransformDefault) == 0x000A00, "Member 'UWBP_C_GodDetailsScreenWidget_C::CameraLookAtTransformDefault' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, SceneCameraComponent) == 0x000A18, "Member 'UWBP_C_GodDetailsScreenWidget_C::SceneCameraComponent' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, CacheGodItem) == 0x000A20, "Member 'UWBP_C_GodDetailsScreenWidget_C::CacheGodItem' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, SceneArtManagerActor) == 0x000A28, "Member 'UWBP_C_GodDetailsScreenWidget_C::SceneArtManagerActor' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, TimerHandleBufferPlateTransition) == 0x000A30, "Member 'UWBP_C_GodDetailsScreenWidget_C::TimerHandleBufferPlateTransition' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, TimerHandleDelayPlateTransition) == 0x000A38, "Member 'UWBP_C_GodDetailsScreenWidget_C::TimerHandleDelayPlateTransition' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, PantheonMatInstance) == 0x000A40, "Member 'UWBP_C_GodDetailsScreenWidget_C::PantheonMatInstance' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, CachePantheonMatInstance) == 0x000A48, "Member 'UWBP_C_GodDetailsScreenWidget_C::CachePantheonMatInstance' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, PantheonSoftMatInstance) == 0x000A70, "Member 'UWBP_C_GodDetailsScreenWidget_C::PantheonSoftMatInstance' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetailsScreenWidget_C, PantheonOnlyFromTag) == 0x000A98, "Member 'UWBP_C_GodDetailsScreenWidget_C::PantheonOnlyFromTag' has a wrong offset!");

}

