#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_BackfillSeatPip

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_C_BackfillSeatPip.WBP_C_BackfillSeatPip_C.SetPipState
// 0x0020 (0x0020 - 0x0000)
struct WBP_C_BackfillSeatPip_C_SetPipState final
{
public:
	bool                                          HasJoined;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_BackfillSeatPip_C_SetPipState) == 0x000008, "Wrong alignment on WBP_C_BackfillSeatPip_C_SetPipState");
static_assert(sizeof(WBP_C_BackfillSeatPip_C_SetPipState) == 0x000020, "Wrong size on WBP_C_BackfillSeatPip_C_SetPipState");
static_assert(offsetof(WBP_C_BackfillSeatPip_C_SetPipState, HasJoined) == 0x000000, "Member 'WBP_C_BackfillSeatPip_C_SetPipState::HasJoined' has a wrong offset!");
static_assert(offsetof(WBP_C_BackfillSeatPip_C_SetPipState, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_BackfillSeatPip_C_SetPipState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_BackfillSeatPip_C_SetPipState, Temp_object_Variable) == 0x000008, "Member 'WBP_C_BackfillSeatPip_C_SetPipState::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_BackfillSeatPip_C_SetPipState, Temp_object_Variable_1) == 0x000010, "Member 'WBP_C_BackfillSeatPip_C_SetPipState::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_BackfillSeatPip_C_SetPipState, K2Node_Select_Default) == 0x000018, "Member 'WBP_C_BackfillSeatPip_C_SetPipState::K2Node_Select_Default' has a wrong offset!");

}

