#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_SkinItemDisplay

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_SkinItemDisplay.WBP_S_SkinItemDisplay_C
// 0x00F8 (0x0768 - 0x0670)
class UWBP_S_SkinItemDisplay_C final : public UHWItemDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_Skin_ColorVariants_C*            ColorVariants;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          CrossGenIcon;                                      // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CTADisplay_C*                    CTADisplay;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FXWisps_Selected;                                  // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GlowRarity;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverGradient_Gold;                                // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke_FX;                                    // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke_White;                                 // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IsEquippedIndicator;                               // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             IsOwned_Overlay;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          IsOwnedIcon;                                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IsOwnedIconBackground;                             // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LineRarity;                                        // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LockedByTag_Gradient;                              // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      LockedByTag_Switcher;                              // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Mastery_Overlay;                                   // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          MasteryAuraIcon;                                   // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          MasteryBounceLightIcon;                            // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               MasteryEmblemIcon;                                 // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PremiumPriceDisplay;                               // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          SkinImage;                                         // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SkinNameText;                                      // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Status_Switcher;                                   // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               UnownedTint;                                       // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PercentageTag_C*                 WBP_S_PercentageTag;                               // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              No_Rarity_Visibility;                              // 0x0750(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           RarityStyle;                                       // 0x0754(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowCTA;                                          // 0x075C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowSkinVariants;                                 // 0x075D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75E[0x2];                                      // 0x075E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryItem*                       CurrentDisplayedItem;                              // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_HandleEntryButtonHovered();
	void BP_HandleEntryButtonSelected();
	void BP_HandleEntryButtonUnhovered();
	void BP_HandleOnDisplayItemSet();
	void BP_HandleSetDisplayOwnershipIcons(bool InDisplayOwnershipIcons);
	void BP_HandleSetIsEquipped(bool InIsEquipped);
	void BP_HandleSetIsInteractable(bool InIsInteractable);
	void BP_HandleSetIsSelected(bool InIsSelected);
	void DisplayPrice(class URHStoreItemPrice* PriceItem, EHWCurrencyType CurrencyType);
	void ExecuteUbergraph_WBP_S_SkinItemDisplay(int32 EntryPoint);
	void HandleEntryButtonHovered();
	void HandleEntryButtonSelected();
	void HandleEntryButtonUnhovered();
	void HandleSkinVariantRequestSelect(class UHWStoreItemDisplayWidget* PipWidget);
	void OnDisplayItemSet();
	void OnSelectVariantItem(const TSoftObjectPtr<class UHWInventoryItem>& InVariantItem, const class URHStoreItem* InStoreItem);
	void SelectEntry();
	void Set_Display_Rarity(const struct FGameplayTag& RarityTag);
	void SetDisplayOwnershipIcons(bool bInDisplayOwnershipIcons);
	void SetIsEquipped(bool bInIsEquipped);
	void SetIsInteractable(bool bInIsInteractable);
	void SetIsSelected(bool bInIsSelected);
	void SetShowSkinVariants(bool bInShowSkinVariants);
	void SetSkinVariants();
	void UpdateItemDisplay();
	void UpdateMasteryMaterials();
	void UpdateOwnershipIcons();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_SkinItemDisplay_C">();
	}
	static class UWBP_S_SkinItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_SkinItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_SkinItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_SkinItemDisplay_C");
static_assert(sizeof(UWBP_S_SkinItemDisplay_C) == 0x000768, "Wrong size on UWBP_S_SkinItemDisplay_C");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, UberGraphFrame) == 0x000670, "Member 'UWBP_S_SkinItemDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, ColorVariants) == 0x000678, "Member 'UWBP_S_SkinItemDisplay_C::ColorVariants' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, CrossGenIcon) == 0x000680, "Member 'UWBP_S_SkinItemDisplay_C::CrossGenIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, CTADisplay) == 0x000688, "Member 'UWBP_S_SkinItemDisplay_C::CTADisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, FXWisps_Selected) == 0x000690, "Member 'UWBP_S_SkinItemDisplay_C::FXWisps_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, GlowRarity) == 0x000698, "Member 'UWBP_S_SkinItemDisplay_C::GlowRarity' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, HoverGradient_Gold) == 0x0006A0, "Member 'UWBP_S_SkinItemDisplay_C::HoverGradient_Gold' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, HoverStroke_FX) == 0x0006A8, "Member 'UWBP_S_SkinItemDisplay_C::HoverStroke_FX' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, HoverStroke_White) == 0x0006B0, "Member 'UWBP_S_SkinItemDisplay_C::HoverStroke_White' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, IsEquippedIndicator) == 0x0006B8, "Member 'UWBP_S_SkinItemDisplay_C::IsEquippedIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, IsOwned_Overlay) == 0x0006C0, "Member 'UWBP_S_SkinItemDisplay_C::IsOwned_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, IsOwnedIcon) == 0x0006C8, "Member 'UWBP_S_SkinItemDisplay_C::IsOwnedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, IsOwnedIconBackground) == 0x0006D0, "Member 'UWBP_S_SkinItemDisplay_C::IsOwnedIconBackground' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, LineRarity) == 0x0006D8, "Member 'UWBP_S_SkinItemDisplay_C::LineRarity' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, LockedByTag_Gradient) == 0x0006E0, "Member 'UWBP_S_SkinItemDisplay_C::LockedByTag_Gradient' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, LockedByTag_Switcher) == 0x0006E8, "Member 'UWBP_S_SkinItemDisplay_C::LockedByTag_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, Mastery_Overlay) == 0x0006F0, "Member 'UWBP_S_SkinItemDisplay_C::Mastery_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, MasteryAuraIcon) == 0x0006F8, "Member 'UWBP_S_SkinItemDisplay_C::MasteryAuraIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, MasteryBounceLightIcon) == 0x000700, "Member 'UWBP_S_SkinItemDisplay_C::MasteryBounceLightIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, MasteryEmblemIcon) == 0x000708, "Member 'UWBP_S_SkinItemDisplay_C::MasteryEmblemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, PremiumPriceDisplay) == 0x000710, "Member 'UWBP_S_SkinItemDisplay_C::PremiumPriceDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, SkinImage) == 0x000718, "Member 'UWBP_S_SkinItemDisplay_C::SkinImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, SkinNameText) == 0x000720, "Member 'UWBP_S_SkinItemDisplay_C::SkinNameText' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, Status_Switcher) == 0x000728, "Member 'UWBP_S_SkinItemDisplay_C::Status_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, UnownedTint) == 0x000730, "Member 'UWBP_S_SkinItemDisplay_C::UnownedTint' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, WBP_S_PercentageTag) == 0x000738, "Member 'UWBP_S_SkinItemDisplay_C::WBP_S_PercentageTag' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, SFXHover) == 0x000740, "Member 'UWBP_S_SkinItemDisplay_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, SFXClick) == 0x000748, "Member 'UWBP_S_SkinItemDisplay_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, No_Rarity_Visibility) == 0x000750, "Member 'UWBP_S_SkinItemDisplay_C::No_Rarity_Visibility' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, RarityStyle) == 0x000754, "Member 'UWBP_S_SkinItemDisplay_C::RarityStyle' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, bShowCTA) == 0x00075C, "Member 'UWBP_S_SkinItemDisplay_C::bShowCTA' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, bShowSkinVariants) == 0x00075D, "Member 'UWBP_S_SkinItemDisplay_C::bShowSkinVariants' has a wrong offset!");
static_assert(offsetof(UWBP_S_SkinItemDisplay_C, CurrentDisplayedItem) == 0x000760, "Member 'UWBP_S_SkinItemDisplay_C::CurrentDisplayedItem' has a wrong offset!");

}

