#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PrecompiledShaderWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PrecompiledShaderWidget.WBP_S_PrecompiledShaderWidget_C
// 0x0020 (0x0628 - 0x0608)
class UWBP_S_PrecompiledShaderWidget_C final : public UHWPrecompiledShaderWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           Label;                                             // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWProgressBar*                         PrecompileProgressBar;                             // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ProgressText;                                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateTaskCount(int32 CompletedTaskCount, int32 TotalTasks);
	void UpdatePrecompiledState(EHWPrecompiledShaderState NewState);
	void ExecuteUbergraph_WBP_S_PrecompiledShaderWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PrecompiledShaderWidget_C">();
	}
	static class UWBP_S_PrecompiledShaderWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PrecompiledShaderWidget_C>();
	}
};
static_assert(alignof(UWBP_S_PrecompiledShaderWidget_C) == 0x000008, "Wrong alignment on UWBP_S_PrecompiledShaderWidget_C");
static_assert(sizeof(UWBP_S_PrecompiledShaderWidget_C) == 0x000628, "Wrong size on UWBP_S_PrecompiledShaderWidget_C");
static_assert(offsetof(UWBP_S_PrecompiledShaderWidget_C, UberGraphFrame) == 0x000608, "Member 'UWBP_S_PrecompiledShaderWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PrecompiledShaderWidget_C, Label) == 0x000610, "Member 'UWBP_S_PrecompiledShaderWidget_C::Label' has a wrong offset!");
static_assert(offsetof(UWBP_S_PrecompiledShaderWidget_C, PrecompileProgressBar) == 0x000618, "Member 'UWBP_S_PrecompiledShaderWidget_C::PrecompileProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_S_PrecompiledShaderWidget_C, ProgressText) == 0x000620, "Member 'UWBP_S_PrecompiledShaderWidget_C::ProgressText' has a wrong offset!");

}

