#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_EscMenu

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.BP_OnActivated
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V1_EscMenu_C_BP_OnActivated final
{
public:
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_EscMenu_C_BP_OnActivated) == 0x000008, "Wrong alignment on WBP_G_V1_EscMenu_C_BP_OnActivated");
static_assert(sizeof(WBP_G_V1_EscMenu_C_BP_OnActivated) == 0x000008, "Wrong size on WBP_G_V1_EscMenu_C_BP_OnActivated");
static_assert(offsetof(WBP_G_V1_EscMenu_C_BP_OnActivated, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_BP_OnActivated::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.BP_OnHandleBackAction
// 0x0003 (0x0003 - 0x0000)
struct WBP_G_V1_EscMenu_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_OnHandleBackAction_ReturnValue;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_EscMenu_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_G_V1_EscMenu_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_G_V1_EscMenu_C_BP_OnHandleBackAction) == 0x000003, "Wrong size on WBP_G_V1_EscMenu_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_G_V1_EscMenu_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_BP_OnHandleBackAction, CallFunc_RemoveViewRoute_ReturnValue) == 0x000001, "Member 'WBP_G_V1_EscMenu_C_BP_OnHandleBackAction::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_BP_OnHandleBackAction, CallFunc_BP_OnHandleBackAction_ReturnValue) == 0x000002, "Member 'WBP_G_V1_EscMenu_C_BP_OnHandleBackAction::CallFunc_BP_OnHandleBackAction_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.ExecuteUbergraph_WBP_G_V1_EscMenu
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerController*                    K2Node_DynamicCast_AsHWPlayer_Controller;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerController*                    K2Node_DynamicCast_AsHWPlayer_Controller_1;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu) == 0x000008, "Wrong alignment on WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu");
static_assert(sizeof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu) == 0x000038, "Wrong size on WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, EntryPoint) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, CallFunc_RemoveViewRoute_ReturnValue) == 0x000004, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, K2Node_DynamicCast_AsHWPlayer_Controller) == 0x000010, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::K2Node_DynamicCast_AsHWPlayer_Controller' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000020, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, K2Node_DynamicCast_AsHWPlayer_Controller_1) == 0x000028, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::K2Node_DynamicCast_AsHWPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu, CallFunc_RemoveViewRoute_ReturnValue_1) == 0x000031, "Member 'WBP_G_V1_EscMenu_C_ExecuteUbergraph_WBP_G_V1_EscMenu::CallFunc_RemoveViewRoute_ReturnValue_1' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.Handle Debug HUDSetting
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting final
{
public:
	struct FGameplayTag                           AppSettingTag;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          bValue;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGameInstance*                        CallFunc_GetHWGameInstance_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGm_ReturnValue;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBuildConfiguration_ReturnValue;        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting) == 0x000008, "Wrong alignment on WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting");
static_assert(sizeof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting) == 0x000038, "Wrong size on WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, AppSettingTag) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::AppSettingTag' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, bValue) == 0x000008, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::bValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, Temp_bool_Variable) == 0x000009, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, Temp_byte_Variable) == 0x00000A, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, Temp_byte_Variable_1) == 0x00000B, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, K2Node_Select_Default) == 0x00000C, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, CallFunc_GetHWGameInstance_ReturnValue) == 0x000010, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::CallFunc_GetHWGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, CallFunc_IsGm_ReturnValue) == 0x000018, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::CallFunc_IsGm_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, CallFunc_GetBuildConfiguration_ReturnValue) == 0x000020, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::CallFunc_GetBuildConfiguration_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000030, "Member 'WBP_G_V1_EscMenu_C_Handle_Debug_HUDSetting::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.HandleHUDEditorSetting
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V1_EscMenu_C_HandleHUDEditorSetting final
{
public:
	struct FGameplayTag                           AppSettingTag;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          bValue;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_EscMenu_C_HandleHUDEditorSetting) == 0x000004, "Wrong alignment on WBP_G_V1_EscMenu_C_HandleHUDEditorSetting");
static_assert(sizeof(WBP_G_V1_EscMenu_C_HandleHUDEditorSetting) == 0x000010, "Wrong size on WBP_G_V1_EscMenu_C_HandleHUDEditorSetting");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandleHUDEditorSetting, AppSettingTag) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_HandleHUDEditorSetting::AppSettingTag' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandleHUDEditorSetting, bValue) == 0x000008, "Member 'WBP_G_V1_EscMenu_C_HandleHUDEditorSetting::bValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandleHUDEditorSetting, Temp_bool_Variable) == 0x000009, "Member 'WBP_G_V1_EscMenu_C_HandleHUDEditorSetting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandleHUDEditorSetting, Temp_byte_Variable) == 0x00000A, "Member 'WBP_G_V1_EscMenu_C_HandleHUDEditorSetting::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandleHUDEditorSetting, Temp_byte_Variable_1) == 0x00000B, "Member 'WBP_G_V1_EscMenu_C_HandleHUDEditorSetting::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandleHUDEditorSetting, K2Node_Select_Default) == 0x00000C, "Member 'WBP_G_V1_EscMenu_C_HandleHUDEditorSetting::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.HandlePauseSetting
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V1_EscMenu_C_HandlePauseSetting final
{
public:
	struct FGameplayTag                           AppSettingTag;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          bValue;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandaloneSession_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_EscMenu_C_HandlePauseSetting) == 0x000004, "Wrong alignment on WBP_G_V1_EscMenu_C_HandlePauseSetting");
static_assert(sizeof(WBP_G_V1_EscMenu_C_HandlePauseSetting) == 0x000010, "Wrong size on WBP_G_V1_EscMenu_C_HandlePauseSetting");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, AppSettingTag) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::AppSettingTag' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, bValue) == 0x000008, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::bValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, Temp_bool_Variable) == 0x000009, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, Temp_byte_Variable) == 0x00000A, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, Temp_byte_Variable_1) == 0x00000B, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, CallFunc_IsStandaloneSession_ReturnValue) == 0x00000C, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::CallFunc_IsStandaloneSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_HandlePauseSetting, K2Node_Select_Default) == 0x00000F, "Member 'WBP_G_V1_EscMenu_C_HandlePauseSetting::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.InitializeWidget
// 0x0050 (0x0050 - 0x0000)
struct WBP_G_V1_EscMenu_C_InitializeWidget final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_LocalPlayerSubsystem*               CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandaloneSession_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& AppSettingTag, bool bValue)> K2Node_CreateDelegate_OutputDelegate; // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& AppSettingTag, bool bValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& AppSettingTag, bool bValue)> K2Node_CreateDelegate_OutputDelegate_2; // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_EscMenu_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_G_V1_EscMenu_C_InitializeWidget");
static_assert(sizeof(WBP_G_V1_EscMenu_C_InitializeWidget) == 0x000050, "Wrong size on WBP_G_V1_EscMenu_C_InitializeWidget");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, Temp_bool_Variable) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, CallFunc_GetLocalPlayerInfo_ReturnValue) == 0x000010, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::CallFunc_GetLocalPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, CallFunc_IsStandaloneSession_ReturnValue) == 0x000018, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::CallFunc_IsStandaloneSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, K2Node_Select_Default) == 0x00001A, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, K2Node_Select_Default_1) == 0x00001B, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_G_V1_EscMenu_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_G_V1_EscMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_OnFocusReceived_ReturnValue;              // 0x0100(0x00B8)()
};
static_assert(alignof(WBP_G_V1_EscMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_G_V1_EscMenu_C_OnFocusReceived");
static_assert(sizeof(WBP_G_V1_EscMenu_C_OnFocusReceived) == 0x0001B8, "Wrong size on WBP_G_V1_EscMenu_C_OnFocusReceived");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_G_V1_EscMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_G_V1_EscMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnFocusReceived, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x0000F8, "Member 'WBP_G_V1_EscMenu_C_OnFocusReceived::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnFocusReceived, CallFunc_OnFocusReceived_ReturnValue) == 0x000100, "Member 'WBP_G_V1_EscMenu_C_OnFocusReceived::CallFunc_OnFocusReceived_ReturnValue' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.OnShown
// 0x0058 (0x0058 - 0x0000)
struct WBP_G_V1_EscMenu_C_OnShown final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          CallFunc_IsMatchmadeSession_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0018)()
};
static_assert(alignof(WBP_G_V1_EscMenu_C_OnShown) == 0x000008, "Wrong alignment on WBP_G_V1_EscMenu_C_OnShown");
static_assert(sizeof(WBP_G_V1_EscMenu_C_OnShown) == 0x000058, "Wrong size on WBP_G_V1_EscMenu_C_OnShown");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnShown, Temp_bool_Variable) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_OnShown::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnShown, Temp_text_Variable) == 0x000008, "Member 'WBP_G_V1_EscMenu_C_OnShown::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnShown, Temp_text_Variable_1) == 0x000020, "Member 'WBP_G_V1_EscMenu_C_OnShown::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnShown, CallFunc_IsMatchmadeSession_ReturnValue) == 0x000038, "Member 'WBP_G_V1_EscMenu_C_OnShown::CallFunc_IsMatchmadeSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V1_EscMenu_C_OnShown, K2Node_Select_Default) == 0x000040, "Member 'WBP_G_V1_EscMenu_C_OnShown::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V1_EscMenu.WBP_G_V1_EscMenu_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V1_EscMenu_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V1_EscMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V1_EscMenu_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V1_EscMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V1_EscMenu_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V1_EscMenu_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V1_EscMenu_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

