#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_StatsDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_StatsDisplay.WBP_S_GodBuilder_StatsDisplay_C
// 0x0020 (0x06E8 - 0x06C8)
class UWBP_S_GodBuilder_StatsDisplay_C final : public UHWGodBuilderStatsDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_MultiPromptWidget_C*             LeftButtonPrompt;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightButtonPrompt;                                 // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TitleText;                                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_S_GodBuilder_StatsDisplay(int32 EntryPoint);
	void InitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_StatsDisplay_C">();
	}
	static class UWBP_S_GodBuilder_StatsDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_StatsDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_StatsDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_StatsDisplay_C");
static_assert(sizeof(UWBP_S_GodBuilder_StatsDisplay_C) == 0x0006E8, "Wrong size on UWBP_S_GodBuilder_StatsDisplay_C");
static_assert(offsetof(UWBP_S_GodBuilder_StatsDisplay_C, UberGraphFrame) == 0x0006C8, "Member 'UWBP_S_GodBuilder_StatsDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_StatsDisplay_C, LeftButtonPrompt) == 0x0006D0, "Member 'UWBP_S_GodBuilder_StatsDisplay_C::LeftButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_StatsDisplay_C, RightButtonPrompt) == 0x0006D8, "Member 'UWBP_S_GodBuilder_StatsDisplay_C::RightButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_StatsDisplay_C, TitleText) == 0x0006E0, "Member 'UWBP_S_GodBuilder_StatsDisplay_C::TitleText' has a wrong offset!");

}

