#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_Skin_ColorVariants

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_S_Skin_ColorVariants.WBP_S_Skin_ColorVariants_C.ExecuteUbergraph_WBP_S_Skin_ColorVariants
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWStoreItemDisplayWidget*              CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants) == 0x000008, "Wrong alignment on WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants");
static_assert(sizeof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants) == 0x000028, "Wrong size on WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants, EntryPoint) == 0x000000, "Member 'WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants, Temp_int_Variable) == 0x000008, "Member 'WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000020, "Member 'WBP_S_Skin_ColorVariants_C_ExecuteUbergraph_WBP_S_Skin_ColorVariants::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function WBP_S_Skin_ColorVariants.WBP_S_Skin_ColorVariants_C.PipWidgetAdded
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_Skin_ColorVariants_C_PipWidgetAdded final
{
public:
	class UHWStoreItemDisplayWidget*              PipWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_Skin_ColorVariants_C_PipWidgetAdded) == 0x000008, "Wrong alignment on WBP_S_Skin_ColorVariants_C_PipWidgetAdded");
static_assert(sizeof(WBP_S_Skin_ColorVariants_C_PipWidgetAdded) == 0x000010, "Wrong size on WBP_S_Skin_ColorVariants_C_PipWidgetAdded");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_PipWidgetAdded, PipWidget) == 0x000000, "Member 'WBP_S_Skin_ColorVariants_C_PipWidgetAdded::PipWidget' has a wrong offset!");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_PipWidgetAdded, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000008, "Member 'WBP_S_Skin_ColorVariants_C_PipWidgetAdded::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");

// Function WBP_S_Skin_ColorVariants.WBP_S_Skin_ColorVariants_C.PipWidgetRemoved
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_Skin_ColorVariants_C_PipWidgetRemoved final
{
public:
	class UHWStoreItemDisplayWidget*              PipWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_Skin_ColorVariants_C_PipWidgetRemoved) == 0x000008, "Wrong alignment on WBP_S_Skin_ColorVariants_C_PipWidgetRemoved");
static_assert(sizeof(WBP_S_Skin_ColorVariants_C_PipWidgetRemoved) == 0x000010, "Wrong size on WBP_S_Skin_ColorVariants_C_PipWidgetRemoved");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_PipWidgetRemoved, PipWidget) == 0x000000, "Member 'WBP_S_Skin_ColorVariants_C_PipWidgetRemoved::PipWidget' has a wrong offset!");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_PipWidgetRemoved, CallFunc_RemoveChild_ReturnValue) == 0x000008, "Member 'WBP_S_Skin_ColorVariants_C_PipWidgetRemoved::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function WBP_S_Skin_ColorVariants.WBP_S_Skin_ColorVariants_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_Skin_ColorVariants_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_Skin_ColorVariants_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_Skin_ColorVariants_C_PreConstruct");
static_assert(sizeof(WBP_S_Skin_ColorVariants_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_Skin_ColorVariants_C_PreConstruct");
static_assert(offsetof(WBP_S_Skin_ColorVariants_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_Skin_ColorVariants_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

