#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_SinglePromptWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_SinglePromptWidget.WBP_S_SinglePromptWidget_C
// 0x0030 (0x0648 - 0x0618)
class UWBP_S_SinglePromptWidget_C final : public UHWSinglePromptWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               HoldProgressBackground;                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Icon;                                              // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             KeyBackground;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           KeyText;                                           // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PressedOverlay;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayIconOnly(const struct FSlateBrush& Brush);
	void DisplayKeyPressed(bool bIsPressed);
	void DisplayKeyTextOnly(const class FText& Label);
	void DisplayKeyWithBackground(const struct FSlateBrush& Brush, const class FText& Label);
	void ExecuteUbergraph_WBP_S_SinglePromptWidget(int32 EntryPoint);
	void HoldActionProgressed(float HoldPercent);
	void SetIsHoldAction(bool bIsHold);
	void UninitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_SinglePromptWidget_C">();
	}
	static class UWBP_S_SinglePromptWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_SinglePromptWidget_C>();
	}
};
static_assert(alignof(UWBP_S_SinglePromptWidget_C) == 0x000008, "Wrong alignment on UWBP_S_SinglePromptWidget_C");
static_assert(sizeof(UWBP_S_SinglePromptWidget_C) == 0x000648, "Wrong size on UWBP_S_SinglePromptWidget_C");
static_assert(offsetof(UWBP_S_SinglePromptWidget_C, UberGraphFrame) == 0x000618, "Member 'UWBP_S_SinglePromptWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_SinglePromptWidget_C, HoldProgressBackground) == 0x000620, "Member 'UWBP_S_SinglePromptWidget_C::HoldProgressBackground' has a wrong offset!");
static_assert(offsetof(UWBP_S_SinglePromptWidget_C, Icon) == 0x000628, "Member 'UWBP_S_SinglePromptWidget_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_S_SinglePromptWidget_C, KeyBackground) == 0x000630, "Member 'UWBP_S_SinglePromptWidget_C::KeyBackground' has a wrong offset!");
static_assert(offsetof(UWBP_S_SinglePromptWidget_C, KeyText) == 0x000638, "Member 'UWBP_S_SinglePromptWidget_C::KeyText' has a wrong offset!");
static_assert(offsetof(UWBP_S_SinglePromptWidget_C, PressedOverlay) == 0x000640, "Member 'UWBP_S_SinglePromptWidget_C::PressedOverlay' has a wrong offset!");

}

