#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_RolePrerenceButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_C_RolePrerenceButton.WBP_C_RolePrerenceButton_C.ExecuteUbergraph_WBP_C_RolePrerenceButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsLoading;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton) == 0x000004, "Wrong alignment on WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton");
static_assert(sizeof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton) == 0x000018, "Wrong size on WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton, EntryPoint) == 0x000000, "Member 'WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton, Temp_bool_Variable) == 0x000004, "Member 'WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton, Temp_int_Variable) == 0x000008, "Member 'WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton, Temp_int_Variable_1) == 0x00000C, "Member 'WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton, CallFunc_AddViewRoute_ReturnValue) == 0x000010, "Member 'WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton, K2Node_Event_bIsLoading) == 0x000011, "Member 'WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton::K2Node_Event_bIsLoading' has a wrong offset!");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton, K2Node_Select_Default) == 0x000014, "Member 'WBP_C_RolePrerenceButton_C_ExecuteUbergraph_WBP_C_RolePrerenceButton::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_RolePrerenceButton.WBP_C_RolePrerenceButton_C.SetIsLoading
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_RolePrerenceButton_C_SetIsLoading final
{
public:
	bool                                          bIsLoading;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_RolePrerenceButton_C_SetIsLoading) == 0x000001, "Wrong alignment on WBP_C_RolePrerenceButton_C_SetIsLoading");
static_assert(sizeof(WBP_C_RolePrerenceButton_C_SetIsLoading) == 0x000001, "Wrong size on WBP_C_RolePrerenceButton_C_SetIsLoading");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_SetIsLoading, bIsLoading) == 0x000000, "Member 'WBP_C_RolePrerenceButton_C_SetIsLoading::bIsLoading' has a wrong offset!");

// Function WBP_C_RolePrerenceButton.WBP_C_RolePrerenceButton_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_RolePrerenceButton_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_RolePrerenceButton_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_RolePrerenceButton_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_RolePrerenceButton_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_RolePrerenceButton_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_RolePrerenceButton_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_RolePrerenceButton_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

