#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodAbilityLevelBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodAbilityLevelBar.WBP_G_V2_GodAbilityLevelBar_C.ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar
// 0x000C (0x000C - 0x0000)
struct WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStartingLevel_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar) == 0x000004, "Wrong alignment on WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar");
static_assert(sizeof(WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar) == 0x00000C, "Wrong size on WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar, CallFunc_GetStartingLevel_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityLevelBar_C_ExecuteUbergraph_WBP_G_V2_GodAbilityLevelBar::CallFunc_GetStartingLevel_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityLevelBar.WBP_G_V2_GodAbilityLevelBar_C.LevelUpdated
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLevel_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated) == 0x000004, "Wrong alignment on WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated");
static_assert(sizeof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated) == 0x000028, "Wrong size on WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated, Temp_bool_Variable) == 0x000000, "Member 'WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated, Temp_struct_Variable) == 0x000004, "Member 'WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated, Temp_struct_Variable_1) == 0x00000C, "Member 'WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated, CallFunc_GetCurrentLevel_ReturnValue) == 0x000014, "Member 'WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated::CallFunc_GetCurrentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated, CallFunc_GetMaxLevel_ReturnValue) == 0x000018, "Member 'WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated::CallFunc_GetMaxLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated, K2Node_Select_Default) == 0x000020, "Member 'WBP_G_V2_GodAbilityLevelBar_C_LevelUpdated::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_GodAbilityLevelBar.WBP_G_V2_GodAbilityLevelBar_C.PipWidgetAdded
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded final
{
public:
	class UHWImage*                               Pip;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded");
static_assert(sizeof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded) == 0x000028, "Wrong size on WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded, Pip) == 0x000000, "Member 'WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded::Pip' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded, Level) == 0x000008, "Member 'WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded::Level' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded, K2Node_MakeStruct_Margin) == 0x00000C, "Member 'WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000020, "Member 'WBP_G_V2_GodAbilityLevelBar_C_PipWidgetAdded::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityLevelBar.WBP_G_V2_GodAbilityLevelBar_C.PipWidgetRemoved
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved final
{
public:
	class UHWImage*                               Pip;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved");
static_assert(sizeof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved) == 0x000010, "Wrong size on WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved, Pip) == 0x000000, "Member 'WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved::Pip' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved, CallFunc_RemoveChild_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityLevelBar_C_PipWidgetRemoved::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityLevelBar.WBP_G_V2_GodAbilityLevelBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodAbilityLevelBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityLevelBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_GodAbilityLevelBar_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_GodAbilityLevelBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_GodAbilityLevelBar_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_GodAbilityLevelBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_GodAbilityLevelBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

