#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_McAfeeErrorScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_McAfeeErrorScreen.WBP_McAfeeErrorScreen_C.BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_McAfeeErrorScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_McAfeeErrorScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_McAfeeErrorScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_McAfeeErrorScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_McAfeeErrorScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_McAfeeErrorScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_McAfeeErrorScreen_C_BndEvt__WBP_McAfeeErrorScreen_StandardButton_02_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_McAfeeErrorScreen.WBP_McAfeeErrorScreen_C.ExecuteUbergraph_WBP_McAfeeErrorScreen
// 0x0010 (0x0010 - 0x0000)
struct WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveTopViewRoute_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen) == 0x000008, "Wrong alignment on WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen");
static_assert(sizeof(WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen) == 0x000010, "Wrong size on WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen");
static_assert(offsetof(WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen, EntryPoint) == 0x000000, "Member 'WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen, CallFunc_RemoveTopViewRoute_ReturnValue) == 0x000004, "Member 'WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen::CallFunc_RemoveTopViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen, K2Node_ComponentBoundEvent_Widget) == 0x000008, "Member 'WBP_McAfeeErrorScreen_C_ExecuteUbergraph_WBP_McAfeeErrorScreen::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");

}

