#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoucherOrder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.TickScroll
// 0x0088 (0x0088 - 0x0000)
struct WBP_VoucherOrder_C_TickScroll final
{
public:
	float                                         Percentage;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_TickScroll) == 0x000008, "Wrong alignment on WBP_VoucherOrder_C_TickScroll");
static_assert(sizeof(WBP_VoucherOrder_C_TickScroll) == 0x000088, "Wrong size on WBP_VoucherOrder_C_TickScroll");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, Percentage) == 0x000000, "Member 'WBP_VoucherOrder_C_TickScroll::Percentage' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_GetDesiredSize_ReturnValue) == 0x000008, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_BreakVector2D_X) == 0x000020, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_BreakVector2D_Y) == 0x000028, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_GetSize_ReturnValue) == 0x000030, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_BreakVector2D_X_1) == 0x000040, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_BreakVector2D_Y_1) == 0x000048, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000050, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_GetScrollOffset_ReturnValue) == 0x000060, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_FClamp_ReturnValue) == 0x000070, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_TickScroll, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000080, "Member 'WBP_VoucherOrder_C_TickScroll::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_VoucherOrder_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_Tick) == 0x000004, "Wrong alignment on WBP_VoucherOrder_C_Tick");
static_assert(sizeof(WBP_VoucherOrder_C_Tick) == 0x00003C, "Wrong size on WBP_VoucherOrder_C_Tick");
static_assert(offsetof(WBP_VoucherOrder_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_VoucherOrder_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_VoucherOrder_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.OnScrollRight
// 0x0002 (0x0002 - 0x0000)
struct WBP_VoucherOrder_C_OnScrollRight final
{
public:
	EContextActionHoldReleaseState                Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_OnScrollRight) == 0x000001, "Wrong alignment on WBP_VoucherOrder_C_OnScrollRight");
static_assert(sizeof(WBP_VoucherOrder_C_OnScrollRight) == 0x000002, "Wrong size on WBP_VoucherOrder_C_OnScrollRight");
static_assert(offsetof(WBP_VoucherOrder_C_OnScrollRight, Status) == 0x000000, "Member 'WBP_VoucherOrder_C_OnScrollRight::Status' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnScrollRight, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_VoucherOrder_C_OnScrollRight::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.OnScrollLeft
// 0x0002 (0x0002 - 0x0000)
struct WBP_VoucherOrder_C_OnScrollLeft final
{
public:
	EContextActionHoldReleaseState                Status;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_OnScrollLeft) == 0x000001, "Wrong alignment on WBP_VoucherOrder_C_OnScrollLeft");
static_assert(sizeof(WBP_VoucherOrder_C_OnScrollLeft) == 0x000002, "Wrong size on WBP_VoucherOrder_C_OnScrollLeft");
static_assert(offsetof(WBP_VoucherOrder_C_OnScrollLeft, Status) == 0x000000, "Member 'WBP_VoucherOrder_C_OnScrollLeft::Status' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnScrollLeft, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_VoucherOrder_C_OnScrollLeft::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.OnRedeemVouchersRequested
// 0x0002 (0x0002 - 0x0000)
struct WBP_VoucherOrder_C_OnRedeemVouchersRequested final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveTopViewRoute_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_OnRedeemVouchersRequested) == 0x000001, "Wrong alignment on WBP_VoucherOrder_C_OnRedeemVouchersRequested");
static_assert(sizeof(WBP_VoucherOrder_C_OnRedeemVouchersRequested) == 0x000002, "Wrong size on WBP_VoucherOrder_C_OnRedeemVouchersRequested");
static_assert(offsetof(WBP_VoucherOrder_C_OnRedeemVouchersRequested, bSuccess) == 0x000000, "Member 'WBP_VoucherOrder_C_OnRedeemVouchersRequested::bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnRedeemVouchersRequested, CallFunc_RemoveTopViewRoute_ReturnValue) == 0x000001, "Member 'WBP_VoucherOrder_C_OnRedeemVouchersRequested::CallFunc_RemoveTopViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.OnRedeemDLC
// 0x0018 (0x0018 - 0x0000)
struct WBP_VoucherOrder_C_OnRedeemDLC final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_OnRedeemDLC) == 0x000008, "Wrong alignment on WBP_VoucherOrder_C_OnRedeemDLC");
static_assert(sizeof(WBP_VoucherOrder_C_OnRedeemDLC) == 0x000018, "Wrong size on WBP_VoucherOrder_C_OnRedeemDLC");
static_assert(offsetof(WBP_VoucherOrder_C_OnRedeemDLC, Widget) == 0x000000, "Member 'WBP_VoucherOrder_C_OnRedeemDLC::Widget' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnRedeemDLC, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_VoucherOrder_C_OnRedeemDLC::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.OnGetVoucherOrders
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_VoucherOrder_C_OnGetVoucherOrders final
{
public:
	TArray<class URHStoreItem*>                   PurchaseItems;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<TSoftObjectPtr<class UPlatformInventoryItem>> CurrencyItems;                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPlatformInventoryItem>  CallFunc_Array_Get_Item;                           // 0x0038(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformInventoryItem*                 K2Node_DynamicCast_AsPlatform_Inventory_Item;      // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0080(0x0018)()
	class URHCurrency*                            K2Node_DynamicCast_AsRHCurrency;                   // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveTopViewRoute_ReturnValue;           // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetFullSplash_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_OnGetVoucherOrders) == 0x000008, "Wrong alignment on WBP_VoucherOrder_C_OnGetVoucherOrders");
static_assert(sizeof(WBP_VoucherOrder_C_OnGetVoucherOrders) == 0x0000B0, "Wrong size on WBP_VoucherOrder_C_OnGetVoucherOrders");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, PurchaseItems) == 0x000000, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::PurchaseItems' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CurrencyItems) == 0x000010, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CurrencyItems' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_SelectInt_ReturnValue) == 0x000030, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000060, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000068, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, K2Node_DynamicCast_AsPlatform_Inventory_Item) == 0x000070, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::K2Node_DynamicCast_AsPlatform_Inventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_GetItemName_ReturnValue) == 0x000080, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, K2Node_DynamicCast_AsRHCurrency) == 0x000098, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::K2Node_DynamicCast_AsRHCurrency' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_RemoveTopViewRoute_ReturnValue) == 0x0000A1, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_RemoveTopViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_OnGetVoucherOrders, CallFunc_GetFullSplash_ReturnValue) == 0x0000A8, "Member 'WBP_VoucherOrder_C_OnGetVoucherOrders::CallFunc_GetFullSplash_ReturnValue' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.NavigateBack
// 0x0001 (0x0001 - 0x0000)
struct WBP_VoucherOrder_C_NavigateBack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_NavigateBack) == 0x000001, "Wrong alignment on WBP_VoucherOrder_C_NavigateBack");
static_assert(sizeof(WBP_VoucherOrder_C_NavigateBack) == 0x000001, "Wrong size on WBP_VoucherOrder_C_NavigateBack");
static_assert(offsetof(WBP_VoucherOrder_C_NavigateBack, ReturnValue) == 0x000000, "Member 'WBP_VoucherOrder_C_NavigateBack::ReturnValue' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.ExecuteUbergraph_WBP_VoucherOrder
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	TDelegate<void(float fPercentage)>            K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EContextActionHoldReleaseState Status)> K2Node_CreateDelegate_OutputDelegate_2;   // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EContextActionHoldReleaseState Status)> K2Node_CreateDelegate_OutputDelegate_3;   // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder) == 0x000008, "Wrong alignment on WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder");
static_assert(sizeof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder) == 0x0000A0, "Wrong size on WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, EntryPoint) == 0x000000, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, K2Node_MakeArray_Array) == 0x000018, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, K2Node_Event_MyGeometry) == 0x000058, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, K2Node_Event_InDeltaTime) == 0x000090, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'WBP_VoucherOrder_C_ExecuteUbergraph_WBP_VoucherOrder::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.DisplayVoucherOrders
// 0x0010 (0x0010 - 0x0000)
struct WBP_VoucherOrder_C_DisplayVoucherOrders final
{
public:
	TDelegate<void(const TArray<class URHStoreItem*>& PurchaseItems, const TArray<TSoftObjectPtr<class UPlatformInventoryItem>>& CurrencyItems)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_DisplayVoucherOrders) == 0x000004, "Wrong alignment on WBP_VoucherOrder_C_DisplayVoucherOrders");
static_assert(sizeof(WBP_VoucherOrder_C_DisplayVoucherOrders) == 0x000010, "Wrong size on WBP_VoucherOrder_C_DisplayVoucherOrders");
static_assert(offsetof(WBP_VoucherOrder_C_DisplayVoucherOrders, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_VoucherOrder_C_DisplayVoucherOrders::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.AttemptGetOrder
// 0x0020 (0x0020 - 0x0000)
struct WBP_VoucherOrder_C_AttemptGetOrder final
{
public:
	bool                                          CallFunc_RemoveTopViewRoute_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHOrderSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHOrder*                               CallFunc_GetNextOrder_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddViewRoute_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_AttemptGetOrder) == 0x000008, "Wrong alignment on WBP_VoucherOrder_C_AttemptGetOrder");
static_assert(sizeof(WBP_VoucherOrder_C_AttemptGetOrder) == 0x000020, "Wrong size on WBP_VoucherOrder_C_AttemptGetOrder");
static_assert(offsetof(WBP_VoucherOrder_C_AttemptGetOrder, CallFunc_RemoveTopViewRoute_ReturnValue) == 0x000000, "Member 'WBP_VoucherOrder_C_AttemptGetOrder::CallFunc_RemoveTopViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_AttemptGetOrder, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_VoucherOrder_C_AttemptGetOrder::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_AttemptGetOrder, CallFunc_GetNextOrder_ReturnValue) == 0x000010, "Member 'WBP_VoucherOrder_C_AttemptGetOrder::CallFunc_GetNextOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_AttemptGetOrder, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_VoucherOrder_C_AttemptGetOrder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_AttemptGetOrder, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_VoucherOrder_C_AttemptGetOrder::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_AttemptGetOrder, CallFunc_AddViewRoute_ReturnValue) == 0x00001A, "Member 'WBP_VoucherOrder_C_AttemptGetOrder::CallFunc_AddViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_VoucherOrder.WBP_VoucherOrder_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_VoucherOrder_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VoucherOrder_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_VoucherOrder_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_VoucherOrder_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_VoucherOrder_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_VoucherOrder_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_VoucherOrder_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VoucherOrder_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_VoucherOrder_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

