#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_BuildsIntoWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ItemStore_BuildsIntoWidget.WBP_G_V2_ItemStore_BuildsIntoWidget_C
// 0x0028 (0x0698 - 0x0670)
class UWBP_G_V2_ItemStore_BuildsIntoWidget_C final : public UHWItemStoreBuildsIntoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWInputKeyScrollBox*                   BuildsIntoInputKeyScrollbox;                       // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             GotoBuildsIntoPrompt;                              // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_36;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              OverflowButton;                                    // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool BP_OnHandleBackAction();
	void DisplayButtonPrompt(bool bShowPrompt);
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_G_V2_ItemStore_BuildsIntoWidget(int32 EntryPoint);
	void OnBuildsIntoGridCreated();
	void OnInitialized();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ItemStore_BuildsIntoWidget_C">();
	}
	static class UWBP_G_V2_ItemStore_BuildsIntoWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ItemStore_BuildsIntoWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ItemStore_BuildsIntoWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ItemStore_BuildsIntoWidget_C");
static_assert(sizeof(UWBP_G_V2_ItemStore_BuildsIntoWidget_C) == 0x000698, "Wrong size on UWBP_G_V2_ItemStore_BuildsIntoWidget_C");
static_assert(offsetof(UWBP_G_V2_ItemStore_BuildsIntoWidget_C, UberGraphFrame) == 0x000670, "Member 'UWBP_G_V2_ItemStore_BuildsIntoWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_BuildsIntoWidget_C, BuildsIntoInputKeyScrollbox) == 0x000678, "Member 'UWBP_G_V2_ItemStore_BuildsIntoWidget_C::BuildsIntoInputKeyScrollbox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_BuildsIntoWidget_C, GotoBuildsIntoPrompt) == 0x000680, "Member 'UWBP_G_V2_ItemStore_BuildsIntoWidget_C::GotoBuildsIntoPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_BuildsIntoWidget_C, HWImage_36) == 0x000688, "Member 'UWBP_G_V2_ItemStore_BuildsIntoWidget_C::HWImage_36' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ItemStore_BuildsIntoWidget_C, OverflowButton) == 0x000690, "Member 'UWBP_G_V2_ItemStore_BuildsIntoWidget_C::OverflowButton' has a wrong offset!");

}

