#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GenericFloatingNumber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_GenericFloatingNumber.WBP_G_V2_GenericFloatingNumber_C
// 0x0080 (0x0728 - 0x06A8)
class UWBP_G_V2_GenericFloatingNumber_C final : public UHWFloatingTextScaleWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimMoveAndFade;                                   // 0x06B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           DamageText;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               DamageTypeIcon;                                    // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateFontInfo                         FontInfo;                                          // 0x06C8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 Instigator;                                        // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimateNumber(int32 Number, const struct FGameplayCueParameters& Parameters, class AActor* OwnerActor);
	void ApplyFontSize(int32 Size);
	void ExecuteUbergraph_WBP_G_V2_GenericFloatingNumber(int32 EntryPoint);
	void GetDamageTypeIcon(struct FGameplayCueParameters& CueParameters, class UTexture2D** Texture);
	void GetFontColorTag(int32 Number, struct FGameplayCueParameters& Parameters, class AActor* EffectOwner, struct FGameplayTag* ColorTag);
	void InitializeWidget();
	void OnShown();
	void UpdateNumber(int32 Number, const struct FGameplayCueParameters& Parameters, class AActor* OwnerActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_GenericFloatingNumber_C">();
	}
	static class UWBP_G_V2_GenericFloatingNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_GenericFloatingNumber_C>();
	}
};
static_assert(alignof(UWBP_G_V2_GenericFloatingNumber_C) == 0x000008, "Wrong alignment on UWBP_G_V2_GenericFloatingNumber_C");
static_assert(sizeof(UWBP_G_V2_GenericFloatingNumber_C) == 0x000728, "Wrong size on UWBP_G_V2_GenericFloatingNumber_C");
static_assert(offsetof(UWBP_G_V2_GenericFloatingNumber_C, UberGraphFrame) == 0x0006A8, "Member 'UWBP_G_V2_GenericFloatingNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GenericFloatingNumber_C, AnimMoveAndFade) == 0x0006B0, "Member 'UWBP_G_V2_GenericFloatingNumber_C::AnimMoveAndFade' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GenericFloatingNumber_C, DamageText) == 0x0006B8, "Member 'UWBP_G_V2_GenericFloatingNumber_C::DamageText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GenericFloatingNumber_C, DamageTypeIcon) == 0x0006C0, "Member 'UWBP_G_V2_GenericFloatingNumber_C::DamageTypeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GenericFloatingNumber_C, FontInfo) == 0x0006C8, "Member 'UWBP_G_V2_GenericFloatingNumber_C::FontInfo' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_GenericFloatingNumber_C, Instigator) == 0x000720, "Member 'UWBP_G_V2_GenericFloatingNumber_C::Instigator' has a wrong offset!");

}

