#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodDetails_AbilitySet_PipEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodDetails_AbilitySet_PipEntry.WBP_C_GodDetails_AbilitySet_PipEntry_C
// 0x0028 (0x0620 - 0x05F8)
class UWBP_C_GodDetails_AbilitySet_PipEntry_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              HitTarget;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PipFill;                                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_C_GodDetails_AbilitySet_PipEntry_C* PipEntry)> OnPipClicked; // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_C_GodDetails_AbilitySet_PipEntry_HitTarget_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_C_GodDetails_AbilitySet_PipEntry(int32 EntryPoint);
	void SetFilled(bool bFilled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodDetails_AbilitySet_PipEntry_C">();
	}
	static class UWBP_C_GodDetails_AbilitySet_PipEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodDetails_AbilitySet_PipEntry_C>();
	}
};
static_assert(alignof(UWBP_C_GodDetails_AbilitySet_PipEntry_C) == 0x000008, "Wrong alignment on UWBP_C_GodDetails_AbilitySet_PipEntry_C");
static_assert(sizeof(UWBP_C_GodDetails_AbilitySet_PipEntry_C) == 0x000620, "Wrong size on UWBP_C_GodDetails_AbilitySet_PipEntry_C");
static_assert(offsetof(UWBP_C_GodDetails_AbilitySet_PipEntry_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_GodDetails_AbilitySet_PipEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_AbilitySet_PipEntry_C, HitTarget) == 0x000600, "Member 'UWBP_C_GodDetails_AbilitySet_PipEntry_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_AbilitySet_PipEntry_C, PipFill) == 0x000608, "Member 'UWBP_C_GodDetails_AbilitySet_PipEntry_C::PipFill' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodDetails_AbilitySet_PipEntry_C, OnPipClicked) == 0x000610, "Member 'UWBP_C_GodDetails_AbilitySet_PipEntry_C::OnPipClicked' has a wrong offset!");

}

