#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_SelectionItemGrid

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStore_SelectionItemGrid.WBP_G_V2_ItemStore_SelectionItemGrid_C.BP_GetDesiredFocusTarget
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWItemStoreItemEntry*                  CallFunc_GetFirstVisibleItemEntry_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWItemStoreItemEntry*                  CallFunc_GetItemToFocus_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget) == 0x000038, "Wrong size on WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget, CallFunc_GetFirstVisibleItemEntry_ReturnValue) == 0x000008, "Member 'WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget::CallFunc_GetFirstVisibleItemEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget, CallFunc_GetItemToFocus_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget::CallFunc_GetItemToFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget, CallFunc_IsVisible_ReturnValue) == 0x000029, "Member 'WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue_1) == 0x000030, "Member 'WBP_G_V2_ItemStore_SelectionItemGrid_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue_1' has a wrong offset!");

}

