#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Courier

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Prototype_Courier.WBP_G_Prototype_Courier_C.BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature
// 0x0700 (0x0700 - 0x0000)
struct WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature final
{
public:
	struct FActiveGameplayEffect                  ActiveEffect;                                      // 0x0000(0x0400)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHWTrackedEffectData                   EffectData;                                        // 0x0400(0x0300)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature");
static_assert(sizeof(WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature) == 0x000700, "Wrong size on WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature");
static_assert(offsetof(WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature, ActiveEffect) == 0x000000, "Member 'WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature::ActiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature, EffectData) == 0x000400, "Member 'WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_1_OnEffectTrackStarted__DelegateSignature::EffectData' has a wrong offset!");

// Function WBP_G_Prototype_Courier.WBP_G_Prototype_Courier_C.BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature
// 0x0700 (0x0700 - 0x0000)
struct WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature final
{
public:
	struct FActiveGameplayEffect                  ActiveEffect;                                      // 0x0000(0x0400)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHWTrackedEffectData                   EffectData;                                        // 0x0400(0x0300)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature");
static_assert(sizeof(WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature) == 0x000700, "Wrong size on WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature");
static_assert(offsetof(WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature, ActiveEffect) == 0x000000, "Member 'WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature::ActiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature, EffectData) == 0x000400, "Member 'WBP_G_Prototype_Courier_C_BndEvt__WBP_G_Prototype_Courier_CourierListener_K2Node_ComponentBoundEvent_2_OnEffectTrackEnded__DelegateSignature::EffectData' has a wrong offset!");

// Function WBP_G_Prototype_Courier.WBP_G_Prototype_Courier_C.ExecuteUbergraph_WBP_G_Prototype_Courier
// 0x0E58 (0x0E58 - 0x0000)
struct WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffect                  K2Node_ComponentBoundEvent_ActiveEffect_1;         // 0x0020(0x0400)(ConstParm)
	struct FHWTrackedEffectData                   K2Node_ComponentBoundEvent_EffectData_1;           // 0x0420(0x0300)(ConstParm)
	struct FActiveGameplayEffect                  K2Node_ComponentBoundEvent_ActiveEffect;           // 0x0720(0x0400)(ConstParm)
	struct FHWTrackedEffectData                   K2Node_ComponentBoundEvent_EffectData;             // 0x0B20(0x0300)(ConstParm)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0E20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1; // 0x0E21(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         K2Node_Event_TeamId;                               // 0x0E22(0x0001)(ConstParm, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 K2Node_Event_AttitudeTowardsLocal;                 // 0x0E23(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E24[0x4];                                      // 0x0E24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWCharacter_Base*                      K2Node_Event_NewCharacter;                         // 0x0E28(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         K2Node_Event_NewPlayerState;                       // 0x0E30(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0E38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E39[0x7];                                      // 0x0E39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0E40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerState_Conquest_C*             K2Node_DynamicCast_AsBP_Player_State_Conquest;     // 0x0E48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0E50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier) == 0x000008, "Wrong alignment on WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier");
static_assert(sizeof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier) == 0x000E58, "Wrong size on WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, EntryPoint) == 0x000000, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_ComponentBoundEvent_ActiveEffect_1) == 0x000020, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_ComponentBoundEvent_ActiveEffect_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_ComponentBoundEvent_EffectData_1) == 0x000420, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_ComponentBoundEvent_EffectData_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_ComponentBoundEvent_ActiveEffect) == 0x000720, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_ComponentBoundEvent_ActiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_ComponentBoundEvent_EffectData) == 0x000B20, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_ComponentBoundEvent_EffectData' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000E20, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1) == 0x000E21, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_Event_TeamId) == 0x000E22, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_Event_TeamId' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_Event_AttitudeTowardsLocal) == 0x000E23, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_Event_AttitudeTowardsLocal' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_Event_NewCharacter) == 0x000E28, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_Event_NewCharacter' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_Event_NewPlayerState) == 0x000E30, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_Event_NewPlayerState' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, CallFunc_Not_PreBool_ReturnValue) == 0x000E38, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000E40, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_DynamicCast_AsBP_Player_State_Conquest) == 0x000E48, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_DynamicCast_AsBP_Player_State_Conquest' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier, K2Node_DynamicCast_bSuccess) == 0x000E50, "Member 'WBP_G_Prototype_Courier_C_ExecuteUbergraph_WBP_G_Prototype_Courier::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_G_Prototype_Courier.WBP_G_Prototype_Courier_C.OnLocalTeamUpdated
// 0x0002 (0x0002 - 0x0000)
struct WBP_G_Prototype_Courier_C_OnLocalTeamUpdated final
{
public:
	struct FGenericTeamId                         TeamId;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 AttitudeTowardsLocal;                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Courier_C_OnLocalTeamUpdated) == 0x000001, "Wrong alignment on WBP_G_Prototype_Courier_C_OnLocalTeamUpdated");
static_assert(sizeof(WBP_G_Prototype_Courier_C_OnLocalTeamUpdated) == 0x000002, "Wrong size on WBP_G_Prototype_Courier_C_OnLocalTeamUpdated");
static_assert(offsetof(WBP_G_Prototype_Courier_C_OnLocalTeamUpdated, TeamId) == 0x000000, "Member 'WBP_G_Prototype_Courier_C_OnLocalTeamUpdated::TeamId' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_OnLocalTeamUpdated, AttitudeTowardsLocal) == 0x000001, "Member 'WBP_G_Prototype_Courier_C_OnLocalTeamUpdated::AttitudeTowardsLocal' has a wrong offset!");

// Function WBP_G_Prototype_Courier.WBP_G_Prototype_Courier_C.TrackedCharacterChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Prototype_Courier_C_TrackedCharacterChanged final
{
public:
	class AHWCharacter_Base*                      NewCharacter;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Courier_C_TrackedCharacterChanged) == 0x000008, "Wrong alignment on WBP_G_Prototype_Courier_C_TrackedCharacterChanged");
static_assert(sizeof(WBP_G_Prototype_Courier_C_TrackedCharacterChanged) == 0x000008, "Wrong size on WBP_G_Prototype_Courier_C_TrackedCharacterChanged");
static_assert(offsetof(WBP_G_Prototype_Courier_C_TrackedCharacterChanged, NewCharacter) == 0x000000, "Member 'WBP_G_Prototype_Courier_C_TrackedCharacterChanged::NewCharacter' has a wrong offset!");

// Function WBP_G_Prototype_Courier.WBP_G_Prototype_Courier_C.TrackedPlayerStateChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Prototype_Courier_C_TrackedPlayerStateChanged final
{
public:
	class AHWPlayerState*                         NewPlayerState;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Courier_C_TrackedPlayerStateChanged) == 0x000008, "Wrong alignment on WBP_G_Prototype_Courier_C_TrackedPlayerStateChanged");
static_assert(sizeof(WBP_G_Prototype_Courier_C_TrackedPlayerStateChanged) == 0x000008, "Wrong size on WBP_G_Prototype_Courier_C_TrackedPlayerStateChanged");
static_assert(offsetof(WBP_G_Prototype_Courier_C_TrackedPlayerStateChanged, NewPlayerState) == 0x000000, "Member 'WBP_G_Prototype_Courier_C_TrackedPlayerStateChanged::NewPlayerState' has a wrong offset!");

// Function WBP_G_Prototype_Courier.WBP_G_Prototype_Courier_C.GetEffectWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Prototype_Courier_C_GetEffectWidgets final
{
public:
	TArray<class UHWGameplayEffectWidget*>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayEffectWidget*>        K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_Prototype_Courier_C_GetEffectWidgets) == 0x000008, "Wrong alignment on WBP_G_Prototype_Courier_C_GetEffectWidgets");
static_assert(sizeof(WBP_G_Prototype_Courier_C_GetEffectWidgets) == 0x000020, "Wrong size on WBP_G_Prototype_Courier_C_GetEffectWidgets");
static_assert(offsetof(WBP_G_Prototype_Courier_C_GetEffectWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_Prototype_Courier_C_GetEffectWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Courier_C_GetEffectWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_Prototype_Courier_C_GetEffectWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

