#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_SystemWarningsWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_SystemWarningsWidget.WBP_S_SystemWarningsWidget_C
// 0x0018 (0x0610 - 0x05F8)
class UWBP_S_SystemWarningsWidget_C final : public UHWSystemWarningsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_Gem_Button_Green_C*              ContinueButton;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Gold_C*                TroubleshootButton;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_S_SystemWarningsWidget_ContinueButton_K2Node_ComponentBoundEvent_1_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_S_SystemWarningsWidget_TroubleshootButton_K2Node_ComponentBoundEvent_2_OnHWButtonEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_S_SystemWarningsWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_SystemWarningsWidget_C">();
	}
	static class UWBP_S_SystemWarningsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_SystemWarningsWidget_C>();
	}
};
static_assert(alignof(UWBP_S_SystemWarningsWidget_C) == 0x000008, "Wrong alignment on UWBP_S_SystemWarningsWidget_C");
static_assert(sizeof(UWBP_S_SystemWarningsWidget_C) == 0x000610, "Wrong size on UWBP_S_SystemWarningsWidget_C");
static_assert(offsetof(UWBP_S_SystemWarningsWidget_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_S_SystemWarningsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_SystemWarningsWidget_C, ContinueButton) == 0x000600, "Member 'UWBP_S_SystemWarningsWidget_C::ContinueButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_SystemWarningsWidget_C, TroubleshootButton) == 0x000608, "Member 'UWBP_S_SystemWarningsWidget_C::TroubleshootButton' has a wrong offset!");

}

