#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_Player

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_Scoreboard_Player.WBP_G_V2_Scoreboard_Player_C
// 0x0150 (0x07E0 - 0x0690)
class UWBP_G_V2_Scoreboard_Player_C final : public UHWScoreboardPlayerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BottomEdge;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BottomLeft_CornerDeco;                             // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BottomRight_CornerDeco;                            // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_InventoryGrid_C*   Consumables;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             DamageSizeBox;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_GodPortrait_BasicAttack_C*    DamageType;                                        // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Disconnect_SizeBox;                                // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodName;                                           // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodPortrait;                                       // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              GodPortrait_HitBox;                                // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodPortraitGradient_Darken;                        // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodPortraitGradient_Dynamic;                       // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Gold;                                              // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitBox;                                            // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_InventoryGrid_C*   Items;                                             // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Items_Divider1;                                    // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Items_Divider2;                                    // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Items_Divider3;                                    // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_Player_KDA_C*      KDA;                                               // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_Player_Level_C*    LevelDisplay;                                      // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Main_BGFill;                                       // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Main_BGOverlay;                                    // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_MuteGrid_C*        Mute;                                              // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformIcon_C*                    PlatformIcon;                                      // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Portrait_HoverStroke;                              // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_InventoryGrid_C*   Relic;                                             // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Respawn_Overlay;                                   // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           RespawnTimer;                                      // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RoleIcon;                                          // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             RoleIcon_Overlay;                                  // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RoleIcon_Shadow;                                   // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_InventoryGrid_C*   Starter;                                           // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_G_V2_Scoreboard_InventoryGrid_C*   Talent;                                            // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TopEdge;                                           // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TopLeft_CornerDeco;                                // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               TopRight_CornerDeco;                               // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstance*                      GodPortraitMI;                                     // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FGuid& PlayerUuid, class UHWWidget* Widget)> OnPlayerMuteClicked; // 0x07D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_G_V2_Scoreboard_Player_GodPortrait_HitBox_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_Scoreboard_Player_GodPortrait_HitBox_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_Scoreboard_Player_GodPortrait_HitBox_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_Scoreboard_Player_HitBox_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_Scoreboard_Player_HitBox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_Scoreboard_Player_HitBox_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void CharacterItemChanged(const class UHWCharacterItem* NewCharacterItem);
	void CharacterTeamUpdated(const struct FGenericTeamId& GenericTeamId, ETeamAttitude AttitudeTowardsLocal);
	void DeselectGodPortrait();
	void DisconnectionStateChanged(bool bDisconnected);
	void DisplayCharacterRespawnState(bool bIsAlive, float RemainingRespawnTime);
	void ExecuteUbergraph_WBP_G_V2_Scoreboard_Player(int32 EntryPoint);
	struct FGeometry GetPlayerNameGeometry();
	void Handle_AI_Overtake_Status_Changed(class AHWPlayerState* PlayerState, bool bNewIsOvertakenByAI);
	void Handle_Assigned_Role_Changed(ECharacterRole AssignedRole);
	void HandleMuteGridClicked(const struct FGuid& PlayerUuid, class UHWWidget* Widget);
	void InitializeWidget();
	void ManuallyDisplayHighlight();
	void RemoveHighlight();
	void SetVoiceChatState(bool bInVoiceChannel, bool bIsTalking, bool bIsMuted);
	void TrackedPlayerStateChanged(class AHWPlayerState* NewPlayerState);
	void Update_Text_Styling(bool bIsLocalPlayer, ETeamAttitude TeamAttitude);
	void UpdateCharacterRespawnTime(float RemainingRespawnTime);
	void UpdatePlayerName(class URH_PlayerInfo* PlayerInfo);
	void UpdatePlayerPlatformIcon(ERHPlatformDisplayType NewPlatform);
	void UpdateTotalGold(int32 OldTotalGold, int32 NewTotalGold);

	class UWidget* BP_GetDesiredFocusTarget() const;
	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;
	TArray<class UHWCharacterWidget*> GetCharacterWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_Scoreboard_Player_C">();
	}
	static class UWBP_G_V2_Scoreboard_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_Scoreboard_Player_C>();
	}
};
static_assert(alignof(UWBP_G_V2_Scoreboard_Player_C) == 0x000008, "Wrong alignment on UWBP_G_V2_Scoreboard_Player_C");
static_assert(sizeof(UWBP_G_V2_Scoreboard_Player_C) == 0x0007E0, "Wrong size on UWBP_G_V2_Scoreboard_Player_C");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, UberGraphFrame) == 0x000690, "Member 'UWBP_G_V2_Scoreboard_Player_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, BottomEdge) == 0x000698, "Member 'UWBP_G_V2_Scoreboard_Player_C::BottomEdge' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, BottomLeft_CornerDeco) == 0x0006A0, "Member 'UWBP_G_V2_Scoreboard_Player_C::BottomLeft_CornerDeco' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, BottomRight_CornerDeco) == 0x0006A8, "Member 'UWBP_G_V2_Scoreboard_Player_C::BottomRight_CornerDeco' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Consumables) == 0x0006B0, "Member 'UWBP_G_V2_Scoreboard_Player_C::Consumables' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, DamageSizeBox) == 0x0006B8, "Member 'UWBP_G_V2_Scoreboard_Player_C::DamageSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, DamageType) == 0x0006C0, "Member 'UWBP_G_V2_Scoreboard_Player_C::DamageType' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Disconnect_SizeBox) == 0x0006C8, "Member 'UWBP_G_V2_Scoreboard_Player_C::Disconnect_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, GodName) == 0x0006D0, "Member 'UWBP_G_V2_Scoreboard_Player_C::GodName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, GodPortrait) == 0x0006D8, "Member 'UWBP_G_V2_Scoreboard_Player_C::GodPortrait' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, GodPortrait_HitBox) == 0x0006E0, "Member 'UWBP_G_V2_Scoreboard_Player_C::GodPortrait_HitBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, GodPortraitGradient_Darken) == 0x0006E8, "Member 'UWBP_G_V2_Scoreboard_Player_C::GodPortraitGradient_Darken' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, GodPortraitGradient_Dynamic) == 0x0006F0, "Member 'UWBP_G_V2_Scoreboard_Player_C::GodPortraitGradient_Dynamic' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Gold) == 0x0006F8, "Member 'UWBP_G_V2_Scoreboard_Player_C::Gold' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, HitBox) == 0x000700, "Member 'UWBP_G_V2_Scoreboard_Player_C::HitBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, HoverStroke) == 0x000708, "Member 'UWBP_G_V2_Scoreboard_Player_C::HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Items) == 0x000710, "Member 'UWBP_G_V2_Scoreboard_Player_C::Items' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Items_Divider1) == 0x000718, "Member 'UWBP_G_V2_Scoreboard_Player_C::Items_Divider1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Items_Divider2) == 0x000720, "Member 'UWBP_G_V2_Scoreboard_Player_C::Items_Divider2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Items_Divider3) == 0x000728, "Member 'UWBP_G_V2_Scoreboard_Player_C::Items_Divider3' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, KDA) == 0x000730, "Member 'UWBP_G_V2_Scoreboard_Player_C::KDA' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, LevelDisplay) == 0x000738, "Member 'UWBP_G_V2_Scoreboard_Player_C::LevelDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Main_BGFill) == 0x000740, "Member 'UWBP_G_V2_Scoreboard_Player_C::Main_BGFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Main_BGOverlay) == 0x000748, "Member 'UWBP_G_V2_Scoreboard_Player_C::Main_BGOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Mute) == 0x000750, "Member 'UWBP_G_V2_Scoreboard_Player_C::Mute' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, PlatformIcon) == 0x000758, "Member 'UWBP_G_V2_Scoreboard_Player_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, PlayerNameDisplay) == 0x000760, "Member 'UWBP_G_V2_Scoreboard_Player_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Portrait_HoverStroke) == 0x000768, "Member 'UWBP_G_V2_Scoreboard_Player_C::Portrait_HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Relic) == 0x000770, "Member 'UWBP_G_V2_Scoreboard_Player_C::Relic' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Respawn_Overlay) == 0x000778, "Member 'UWBP_G_V2_Scoreboard_Player_C::Respawn_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, RespawnTimer) == 0x000780, "Member 'UWBP_G_V2_Scoreboard_Player_C::RespawnTimer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, RoleIcon) == 0x000788, "Member 'UWBP_G_V2_Scoreboard_Player_C::RoleIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, RoleIcon_Overlay) == 0x000790, "Member 'UWBP_G_V2_Scoreboard_Player_C::RoleIcon_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, RoleIcon_Shadow) == 0x000798, "Member 'UWBP_G_V2_Scoreboard_Player_C::RoleIcon_Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Starter) == 0x0007A0, "Member 'UWBP_G_V2_Scoreboard_Player_C::Starter' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, Talent) == 0x0007A8, "Member 'UWBP_G_V2_Scoreboard_Player_C::Talent' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, TopEdge) == 0x0007B0, "Member 'UWBP_G_V2_Scoreboard_Player_C::TopEdge' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, TopLeft_CornerDeco) == 0x0007B8, "Member 'UWBP_G_V2_Scoreboard_Player_C::TopLeft_CornerDeco' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, TopRight_CornerDeco) == 0x0007C0, "Member 'UWBP_G_V2_Scoreboard_Player_C::TopRight_CornerDeco' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, GodPortraitMI) == 0x0007C8, "Member 'UWBP_G_V2_Scoreboard_Player_C::GodPortraitMI' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_Scoreboard_Player_C, OnPlayerMuteClicked) == 0x0007D0, "Member 'UWBP_G_V2_Scoreboard_Player_C::OnPlayerMuteClicked' has a wrong offset!");

}

