#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StorePurchaseCurrency

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_C_StorePurchaseCurrency.WBP_C_StorePurchaseCurrency_C.ExecuteUbergraph_WBP_C_StorePurchaseCurrency
// 0x0028 (0x0028 - 0x0000)
struct WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWClientHUD*                           CallFunc_GetLocalHUDAsClient_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenCurrencyPurchaseScreen_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWClientHUD*                           CallFunc_GetLocalHUDAsClient_ReturnValue_1;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenCurrencyPurchaseScreen_ReturnValue_1; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency) == 0x000008, "Wrong alignment on WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency");
static_assert(sizeof(WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency) == 0x000028, "Wrong size on WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency");
static_assert(offsetof(WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency, EntryPoint) == 0x000000, "Member 'WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency, CallFunc_GetLocalHUDAsClient_ReturnValue) == 0x000008, "Member 'WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency::CallFunc_GetLocalHUDAsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency, CallFunc_OpenCurrencyPurchaseScreen_ReturnValue) == 0x000010, "Member 'WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency::CallFunc_OpenCurrencyPurchaseScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency, CallFunc_GetLocalHUDAsClient_ReturnValue_1) == 0x000018, "Member 'WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency::CallFunc_GetLocalHUDAsClient_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency, CallFunc_OpenCurrencyPurchaseScreen_ReturnValue_1) == 0x000020, "Member 'WBP_C_StorePurchaseCurrency_C_ExecuteUbergraph_WBP_C_StorePurchaseCurrency::CallFunc_OpenCurrencyPurchaseScreen_ReturnValue_1' has a wrong offset!");

// Function WBP_C_StorePurchaseCurrency.WBP_C_StorePurchaseCurrency_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_C_StorePurchaseCurrency_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_StorePurchaseCurrency_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_C_StorePurchaseCurrency_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_C_StorePurchaseCurrency_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_C_StorePurchaseCurrency_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_C_StorePurchaseCurrency_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_C_StorePurchaseCurrency_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

