#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_HomeScreen

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_HomeScreen.WBP_C_HomeScreen_C
// 0x0140 (0x0870 - 0x0730)
class UWBP_C_HomeScreen_C final : public UHWHomeScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0730(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HomeScreenSkinButton;                              // 0x0738(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Content;                                           // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerContextMenu_C*               ContextMenu;                                       // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CrossplayLabel;                                    // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CrossplaySettingWrapper;                           // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CrossplayValue;                                    // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             CycleCallout;                                      // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FocusBlocker;                                      // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_HomeQuestWidget_C*               HomeQuestWidget;                                   // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HomeScreenNewSkinText;                             // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HomeScreenSkinHitArea;                             // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HomeScreenSkinName;                                // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_42;                                        // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AsyncIcon_C*                       InputTypeIcon;                                     // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InputTypeLabel;                                    // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         InputTypeSettingWrapper;                           // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InputTypeValue;                                    // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_LobbyModelPlayer_C*              ModelPlayer;                                       // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              NewQueuesButton;                                   // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NewsRotatorWidget_C*               NewsRotator;                                       // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NewsSection;                                       // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RegionLabel;                                       // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RegionValue;                                       // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_Skin_ColorVariants_C*            SkinRotatorPips;                                   // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SupplementaryBtn_Overlay;                          // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SupplementaryBtnChangeMode;                        // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_RolePrerenceButton_C*            WBP_C_RolePrerenceButton;                          // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HomeQuickPlay_C*                   WBP_HomeQuickPlay;                                 // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyModule_C*                     WBP_PartyModule;                                   // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 XboxIcon;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowEMOL;                                          // 0x0830(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ViewManagerWidget;                                 // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           LoadoutRoutes;                                     // 0x0840(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ALevelSequenceActor*                    HomescreenSequencer;                               // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ASceneArtManager_C*                     SceneArtManagerActor;                              // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         DefaultSequencer;                                  // 0x0860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         BackgroundSequencer;                               // 0x0868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindLobbyAnimationHandling();
	void BndEvt__WBP_C_HomeScreen_HomeScreenSkinHitArea_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_HomeScreen_HomeScreenSkinHitArea_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_HomeScreen_HomeScreenSkinHitArea_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_HomeScreen_NewQueuesButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_HomeScreen_SkinRotatorPips_K2Node_ComponentBoundEvent_0_HWOnStorePipRequestSelect__DelegateSignature(class UHWStoreItemDisplayWidget* PipWidget);
	void CanFocus(bool* bAllowFous);
	void CheckSelectedRegion();
	void ExecuteUbergraph_WBP_C_HomeScreen(int32 EntryPoint);
	void GetCharacterHomeScreenSequence(class ULevelSequence** OutSequence);
	void Handle_Party_Player_Card_Selected(class UWBP_player_card_module_C* Selected_Player_Card);
	void Handle_Player_Card_Back_Button();
	void HandleNewQueuesAppSettingUpdate(const struct FGameplayTag& AppSettingTag, bool bValue);
	void HandleNewsActionFired();
	void HandleQueueStatusChange(ERH_MatchStatus NewStatus);
	void HandleViewSocial();
	void HideQuickPlayAnim(float ElapsedTime, float ElapsedAlpha);
	void HideQuickPlayFinished();
	class UWidget* HomeSkinNavigateRight(EUINavigation Navigation_0);
	void InitHideAnimation();
	void InitializeContentWidgets();
	void InitializeTickAnimations();
	void InitializeWidget();
	void InpActEvt_GamepadSpecialLeftButton_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	bool NavigateBack();
	void NewsPanelVisibilityChanged(bool IsVisible_0);
	void OnCrossplaySettingChanged();
	void OnHide();
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnSetQueueInputState(ERH_INPUT_STATE InputState);
	void OnShown();
	class UWidget* PartyNavigateLeft(EUINavigation Navigation_0);
	void PlayPromoSequencer();
	class UWidget* QueueNavigateUp(EUINavigation Navigation_0);
	class UWidget* RolePreferenceNavigateDown(EUINavigation Navigation_0);
	void SetHideAll(bool Hide);
	void ShowQuickPlayAnim(float ElapsedTime, float ElapsedAlpha);
	void ShowQuickPlayFinished();
	void StartCheckingSelectedRegion();
	void StartHideAnim();
	void StartShowAnim();
	void StopConflictingAnimation(class FName AnimName);
	void Toggle_Background_Seqeuncer(bool TurnOn);
	void ToggleCharacterHomescreen(bool TurnOn);
	void UnbindLobbyAnimationHandling();
	void UninitializeWidget();
	void Update_Region();
	void UpdateContextPrompts();
	void UpdateCrossplay();
	void UpdateDisplayedModelSkin(const class UHWSkinItem* InModelSkinItem);
	void UpdateDisplayedOptions(const TArray<class URHStoreItem*>& InOptions);
	void UpdateDisplayedRedirect(const class UHWCollectionItem* InRedirectCollection);
	void ViewRouteChanged(const struct FGameplayTag& CurrentRoute, const struct FGameplayTag& NextRoute, EViewManagerLayer Layer);
	void ViewRouteRemoved(const struct FGameplayTag& ViewRouteTag);

	class UWidget* BP_GetDesiredFocusTarget() const;
	class UWidget* GetWidgetToFade() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_HomeScreen_C">();
	}
	static class UWBP_C_HomeScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_HomeScreen_C>();
	}
};
static_assert(alignof(UWBP_C_HomeScreen_C) == 0x000008, "Wrong alignment on UWBP_C_HomeScreen_C");
static_assert(sizeof(UWBP_C_HomeScreen_C) == 0x000870, "Wrong size on UWBP_C_HomeScreen_C");
static_assert(offsetof(UWBP_C_HomeScreen_C, UberGraphFrame) == 0x000730, "Member 'UWBP_C_HomeScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, HomeScreenSkinButton) == 0x000738, "Member 'UWBP_C_HomeScreen_C::HomeScreenSkinButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, CanvasPanel_0) == 0x000740, "Member 'UWBP_C_HomeScreen_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, Content) == 0x000748, "Member 'UWBP_C_HomeScreen_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, ContextMenu) == 0x000750, "Member 'UWBP_C_HomeScreen_C::ContextMenu' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, CrossplayLabel) == 0x000758, "Member 'UWBP_C_HomeScreen_C::CrossplayLabel' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, CrossplaySettingWrapper) == 0x000760, "Member 'UWBP_C_HomeScreen_C::CrossplaySettingWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, CrossplayValue) == 0x000768, "Member 'UWBP_C_HomeScreen_C::CrossplayValue' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, CycleCallout) == 0x000770, "Member 'UWBP_C_HomeScreen_C::CycleCallout' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, FocusBlocker) == 0x000778, "Member 'UWBP_C_HomeScreen_C::FocusBlocker' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, HomeQuestWidget) == 0x000780, "Member 'UWBP_C_HomeScreen_C::HomeQuestWidget' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, HomeScreenNewSkinText) == 0x000788, "Member 'UWBP_C_HomeScreen_C::HomeScreenNewSkinText' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, HomeScreenSkinHitArea) == 0x000790, "Member 'UWBP_C_HomeScreen_C::HomeScreenSkinHitArea' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, HomeScreenSkinName) == 0x000798, "Member 'UWBP_C_HomeScreen_C::HomeScreenSkinName' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, HWImage_42) == 0x0007A0, "Member 'UWBP_C_HomeScreen_C::HWImage_42' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, InputTypeIcon) == 0x0007A8, "Member 'UWBP_C_HomeScreen_C::InputTypeIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, InputTypeLabel) == 0x0007B0, "Member 'UWBP_C_HomeScreen_C::InputTypeLabel' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, InputTypeSettingWrapper) == 0x0007B8, "Member 'UWBP_C_HomeScreen_C::InputTypeSettingWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, InputTypeValue) == 0x0007C0, "Member 'UWBP_C_HomeScreen_C::InputTypeValue' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, ModelPlayer) == 0x0007C8, "Member 'UWBP_C_HomeScreen_C::ModelPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, NewQueuesButton) == 0x0007D0, "Member 'UWBP_C_HomeScreen_C::NewQueuesButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, NewsRotator) == 0x0007D8, "Member 'UWBP_C_HomeScreen_C::NewsRotator' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, NewsSection) == 0x0007E0, "Member 'UWBP_C_HomeScreen_C::NewsSection' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, RegionLabel) == 0x0007E8, "Member 'UWBP_C_HomeScreen_C::RegionLabel' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, RegionValue) == 0x0007F0, "Member 'UWBP_C_HomeScreen_C::RegionValue' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, SkinRotatorPips) == 0x0007F8, "Member 'UWBP_C_HomeScreen_C::SkinRotatorPips' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, SupplementaryBtn_Overlay) == 0x000800, "Member 'UWBP_C_HomeScreen_C::SupplementaryBtn_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, SupplementaryBtnChangeMode) == 0x000808, "Member 'UWBP_C_HomeScreen_C::SupplementaryBtnChangeMode' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, WBP_C_RolePrerenceButton) == 0x000810, "Member 'UWBP_C_HomeScreen_C::WBP_C_RolePrerenceButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, WBP_HomeQuickPlay) == 0x000818, "Member 'UWBP_C_HomeScreen_C::WBP_HomeQuickPlay' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, WBP_PartyModule) == 0x000820, "Member 'UWBP_C_HomeScreen_C::WBP_PartyModule' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, XboxIcon) == 0x000828, "Member 'UWBP_C_HomeScreen_C::XboxIcon' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, ShowEMOL) == 0x000830, "Member 'UWBP_C_HomeScreen_C::ShowEMOL' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, ViewManagerWidget) == 0x000838, "Member 'UWBP_C_HomeScreen_C::ViewManagerWidget' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, LoadoutRoutes) == 0x000840, "Member 'UWBP_C_HomeScreen_C::LoadoutRoutes' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, HomescreenSequencer) == 0x000850, "Member 'UWBP_C_HomeScreen_C::HomescreenSequencer' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, SceneArtManagerActor) == 0x000858, "Member 'UWBP_C_HomeScreen_C::SceneArtManagerActor' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, DefaultSequencer) == 0x000860, "Member 'UWBP_C_HomeScreen_C::DefaultSequencer' has a wrong offset!");
static_assert(offsetof(UWBP_C_HomeScreen_C, BackgroundSequencer) == 0x000868, "Member 'UWBP_C_HomeScreen_C::BackgroundSequencer' has a wrong offset!");

}

