#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Friends_Tab

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_Friends_Tab.WBP_Social_Friends_Tab_C
// 0x0028 (0x0658 - 0x0630)
class UWBP_Social_Friends_Tab_C final : public URHSocialFriendsPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0630(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URHTreeView*                            PlayerList;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                ClickSocialFriendsSFX;                             // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnPlayerListScrolled;                              // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_Social_Friends_Tab_PlayerList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void ExecuteUbergraph_WBP_Social_Friends_Tab(int32 EntryPoint);
	void FindFirstOnlinePlayerOrDefault(class UObject** Item);
	void FocusFirstItem();
	void FocusFirstOnlinePlayer();
	void GetFocusTarget(class UWidget** Target);
	void HandleItemClicked(const class UObject* Item);
	void InitializeWidget();
	void InitializeWidgetNavigation();
	bool NavigateConfirm();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInputStateChanged(ERH_INPUT_STATE InputState);
	void OnItemScrolledIntoView(class UObject* Item, class UUserWidget* Widget);
	void OnShown();
	void TryGetFirstItemForCategory(ERHSocialOverlaySection Category, class UObject** Output);
	void UninitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_Friends_Tab_C">();
	}
	static class UWBP_Social_Friends_Tab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_Friends_Tab_C>();
	}
};
static_assert(alignof(UWBP_Social_Friends_Tab_C) == 0x000008, "Wrong alignment on UWBP_Social_Friends_Tab_C");
static_assert(sizeof(UWBP_Social_Friends_Tab_C) == 0x000658, "Wrong size on UWBP_Social_Friends_Tab_C");
static_assert(offsetof(UWBP_Social_Friends_Tab_C, UberGraphFrame) == 0x000630, "Member 'UWBP_Social_Friends_Tab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Friends_Tab_C, PlayerList) == 0x000638, "Member 'UWBP_Social_Friends_Tab_C::PlayerList' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Friends_Tab_C, ClickSocialFriendsSFX) == 0x000640, "Member 'UWBP_Social_Friends_Tab_C::ClickSocialFriendsSFX' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Friends_Tab_C, OnPlayerListScrolled) == 0x000648, "Member 'UWBP_Social_Friends_Tab_C::OnPlayerListScrolled' has a wrong offset!");

}

