#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAscension_Purchase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C.BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature final
{
public:
	class URHWidget*                              Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bEntered;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature");
static_assert(sizeof(WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature) == 0x000010, "Wrong size on WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature, Widget) == 0x000000, "Member 'WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature, bEntered) == 0x000008, "Member 'WBP_C_GodAscension_Purchase_C_BndEvt__WBP_C_GodAscension_Purchase_PurchaseAscension_K2Node_ComponentBoundEvent_6_RHWidgetMouseEntered__DelegateSignature::bEntered' has a wrong offset!");

// Function WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C.ExecuteUbergraph_WBP_C_GodAscension_Purchase
// 0x0148 (0x0148 - 0x0000)
struct WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x006C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_GodAscension_SingleItemDisplay_C* K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Display; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     K2Node_DynamicCast_AsHorizontal_Box_Slot;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHWidget*                              K2Node_ComponentBoundEvent_Widget;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bEntered;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWItemDisplayWidget*                   K2Node_Event_EntryWidget;                          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UPlatformInventoryItem*           K2Node_Event_InventoryItem;                        // 0x00E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_GodAscension_SingleItem_Purchase_C* K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Purchase; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_GodAscension_SingleItem_Purchase_C* K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Purchase_1; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase) == 0x000008, "Wrong alignment on WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase");
static_assert(sizeof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase) == 0x000148, "Wrong size on WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, EntryPoint) == 0x000000, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_struct_Variable) == 0x000004, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_MakeStruct_Margin) == 0x000024, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_int_Array_Index_Variable) == 0x000034, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_struct_Variable_1) == 0x000044, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_IsHovered_ReturnValue) == 0x000054, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_Event_IsDesignTime) == 0x000055, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_int_Loop_Counter_Variable_2) == 0x000060, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Add_IntInt_ReturnValue_2) == 0x000064, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_bool_Variable) == 0x000068, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_byte_Variable) == 0x000069, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_Select_Default) == 0x00006C, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_Event_bVisible) == 0x00007C, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Not_PreBool_ReturnValue) == 0x00007D, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_GetAllChildren_ReturnValue) == 0x000080, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_int_Array_Index_Variable_2) == 0x000094, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Less_IntInt_ReturnValue) == 0x000098, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Display) == 0x0000A8, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Display' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_DynamicCast_AsHorizontal_Box_Slot) == 0x0000B8, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_DynamicCast_AsHorizontal_Box_Slot' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_ComponentBoundEvent_Widget) == 0x0000C8, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_ComponentBoundEvent_bEntered) == 0x0000D0, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_ComponentBoundEvent_bEntered' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_Event_EntryWidget) == 0x0000D8, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_Event_EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_Event_InventoryItem) == 0x0000E0, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_Event_InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_GetAllChildren_ReturnValue_1) == 0x0000E8, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Array_Get_Item_1) == 0x0000F8, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Array_Length_ReturnValue_1) == 0x000100, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Purchase) == 0x000108, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Purchase' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Less_IntInt_ReturnValue_1) == 0x000111, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_byte_Variable_1) == 0x000112, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_GetAllChildren_ReturnValue_2) == 0x000118, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_GetAllChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Array_Get_Item_2) == 0x000128, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Array_Length_ReturnValue_2) == 0x000130, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000134, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, CallFunc_Less_IntInt_ReturnValue_2) == 0x000135, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Purchase_1) == 0x000138, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_DynamicCast_AsWBP_C_God_Ascension_Single_Item_Purchase_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_DynamicCast_bSuccess_3) == 0x000140, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, Temp_bool_Variable_1) == 0x000141, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase, K2Node_Select_Default_1) == 0x000142, "Member 'WBP_C_GodAscension_Purchase_C_ExecuteUbergraph_WBP_C_GodAscension_Purchase::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C.HandleInputMethodChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              NewInputType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged) == 0x000001, "Wrong alignment on WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged");
static_assert(sizeof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged) == 0x000010, "Wrong size on WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, NewInputType) == 0x000000, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::NewInputType' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_4) == 0x000005, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_5) == 0x000006, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_6) == 0x000007, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, K2Node_Select_Default) == 0x000008, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_7) == 0x000009, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_8) == 0x00000A, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_9) == 0x00000B, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_bool_Variable) == 0x00000C, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, Temp_byte_Variable_10) == 0x00000D, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, K2Node_Select_Default_1) == 0x00000E, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged, K2Node_Select_Default_2) == 0x00000F, "Member 'WBP_C_GodAscension_Purchase_C_HandleInputMethodChanged::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C.OnSelectItem
// 0x0010 (0x0010 - 0x0000)
struct WBP_C_GodAscension_Purchase_C_OnSelectItem final
{
public:
	class UHWItemDisplayWidget*                   EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UPlatformInventoryItem*           InventoryItem;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_Purchase_C_OnSelectItem) == 0x000008, "Wrong alignment on WBP_C_GodAscension_Purchase_C_OnSelectItem");
static_assert(sizeof(WBP_C_GodAscension_Purchase_C_OnSelectItem) == 0x000010, "Wrong size on WBP_C_GodAscension_Purchase_C_OnSelectItem");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_OnSelectItem, EntryWidget) == 0x000000, "Member 'WBP_C_GodAscension_Purchase_C_OnSelectItem::EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_OnSelectItem, InventoryItem) == 0x000008, "Member 'WBP_C_GodAscension_Purchase_C_OnSelectItem::InventoryItem' has a wrong offset!");

// Function WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_Purchase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_Purchase_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_C_GodAscension_Purchase_C_PreConstruct");
static_assert(sizeof(WBP_C_GodAscension_Purchase_C_PreConstruct) == 0x000001, "Wrong size on WBP_C_GodAscension_Purchase_C_PreConstruct");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_C_GodAscension_Purchase_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C.SetSubListVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_C_GodAscension_Purchase_C_SetSubListVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_Purchase_C_SetSubListVisibility) == 0x000001, "Wrong alignment on WBP_C_GodAscension_Purchase_C_SetSubListVisibility");
static_assert(sizeof(WBP_C_GodAscension_Purchase_C_SetSubListVisibility) == 0x000001, "Wrong size on WBP_C_GodAscension_Purchase_C_SetSubListVisibility");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_SetSubListVisibility, bVisible) == 0x000000, "Member 'WBP_C_GodAscension_Purchase_C_SetSubListVisibility::bVisible' has a wrong offset!");

// Function WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C.UpdatePrice
// 0x0018 (0x0018 - 0x0000)
struct WBP_C_GodAscension_Purchase_C_UpdatePrice final
{
public:
	class URHStoreItemPrice*                      PriceItem;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PriceGroup;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_Purchase_C_UpdatePrice) == 0x000008, "Wrong alignment on WBP_C_GodAscension_Purchase_C_UpdatePrice");
static_assert(sizeof(WBP_C_GodAscension_Purchase_C_UpdatePrice) == 0x000018, "Wrong size on WBP_C_GodAscension_Purchase_C_UpdatePrice");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_UpdatePrice, PriceItem) == 0x000000, "Member 'WBP_C_GodAscension_Purchase_C_UpdatePrice::PriceItem' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_UpdatePrice, PriceGroup) == 0x000008, "Member 'WBP_C_GodAscension_Purchase_C_UpdatePrice::PriceGroup' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_UpdatePrice, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'WBP_C_GodAscension_Purchase_C_UpdatePrice::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function WBP_C_GodAscension_Purchase.WBP_C_GodAscension_Purchase_C.UpdatePurchasable
// 0x0170 (0x0170 - 0x0000)
struct WBP_C_GodAscension_Purchase_C_UpdatePurchasable final
{
public:
	bool                                          bAvailable;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHWAscensionPurchaseRewardItem> InRewardItems;                                     // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class URHStoreItem*                           PassItem;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 GodItemReference;                                  // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0038(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	TArray<TSoftObjectPtr<class UHWSkinItem>>     CallFunc_GetSkinItemsForCharacterItem_OutSkinItems; // 0x00B8(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UHWSkinItem>             CallFunc_Array_Get_Item;                           // 0x00D0(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWSkinItem*                            K2Node_DynamicCast_AsHWSkin_Item;                  // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWSkinItem*                            K2Node_DynamicCast_AsHWSkin_Item_1;                // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	class UWBP_S_CollectionItemDisplay_C*         K2Node_DynamicCast_AsWBP_S_Collection_Item_Display; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_GodAscension_Purchase_C_UpdatePurchasable) == 0x000008, "Wrong alignment on WBP_C_GodAscension_Purchase_C_UpdatePurchasable");
static_assert(sizeof(WBP_C_GodAscension_Purchase_C_UpdatePurchasable) == 0x000170, "Wrong size on WBP_C_GodAscension_Purchase_C_UpdatePurchasable");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_UpdatePurchasable, bAvailable) == 0x000000, "Member 'WBP_C_GodAscension_Purchase_C_UpdatePurchasable::bAvailable' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_UpdatePurchasable, InRewardItems) == 0x000008, "Member 'WBP_C_GodAscension_Purchase_C_UpdatePurchasable::InRewardItems' has a wrong offset!");
static_assert(offsetof(WBP_C_GodAscension_Purchase_C_UpdatePurchasable, PassItem) == 0x000018, "Member 'WBP_C_GodAscension_Purchase_C_UpdatePurchasable::PassItem' has a wrong offset!");
