#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spectator_PlayerStats

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Spectator_PlayerStats.WBP_G_Spectator_PlayerStats_C.CharacterItemChanged
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_Spectator_PlayerStats_C_CharacterItemChanged final
{
public:
	const class UHWCharacterItem*                 NewCharacterItem;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spectator_PlayerStats_C_CharacterItemChanged) == 0x000008, "Wrong alignment on WBP_G_Spectator_PlayerStats_C_CharacterItemChanged");
static_assert(sizeof(WBP_G_Spectator_PlayerStats_C_CharacterItemChanged) == 0x000038, "Wrong size on WBP_G_Spectator_PlayerStats_C_CharacterItemChanged");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_CharacterItemChanged, NewCharacterItem) == 0x000000, "Member 'WBP_G_Spectator_PlayerStats_C_CharacterItemChanged::NewCharacterItem' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_CharacterItemChanged, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_Spectator_PlayerStats_C_CharacterItemChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_CharacterItemChanged, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000010, "Member 'WBP_G_Spectator_PlayerStats_C_CharacterItemChanged::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");

// Function WBP_G_Spectator_PlayerStats.WBP_G_Spectator_PlayerStats_C.InitializeWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Spectator_PlayerStats_C_InitializeWidget final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spectator_PlayerStats_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_G_Spectator_PlayerStats_C_InitializeWidget");
static_assert(sizeof(WBP_G_Spectator_PlayerStats_C_InitializeWidget) == 0x000008, "Wrong size on WBP_G_Spectator_PlayerStats_C_InitializeWidget");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_InitializeWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_G_Spectator_PlayerStats_C_InitializeWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_G_Spectator_PlayerStats.WBP_G_Spectator_PlayerStats_C.PopulatePlayerInfo
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo final
{
public:
	TSoftObjectPtr<class UTexture2D>              PlayerIcon;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	struct FGenericTeamId                         TeamId;                                            // 0x0028(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x002C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0054(0x0014)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0068(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x007C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0090(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x00A4(0x0014)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x00B8(0x0014)()
};
static_assert(alignof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo) == 0x000008, "Wrong alignment on WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo");
static_assert(sizeof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo) == 0x0000D0, "Wrong size on WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, PlayerIcon) == 0x000000, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::PlayerIcon' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, TeamId) == 0x000028, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::TeamId' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, Temp_byte_Variable) == 0x000029, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, Temp_byte_Variable_1) == 0x00002A, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, K2Node_MakeStruct_SlateColor) == 0x00002C, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, K2Node_MakeStruct_SlateColor_2) == 0x000054, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, K2Node_Select_Default) == 0x000068, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, K2Node_MakeStruct_SlateColor_3) == 0x00007C, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, K2Node_MakeStruct_SlateColor_4) == 0x000090, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, K2Node_MakeStruct_SlateColor_5) == 0x0000A4, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo, K2Node_Select_Default_1) == 0x0000B8, "Member 'WBP_G_Spectator_PlayerStats_C_PopulatePlayerInfo::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_Spectator_PlayerStats.WBP_G_Spectator_PlayerStats_C.UpdatePlayerStatValues
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Percent;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	double                                        CallFunc_SetProgress_Percent_ImplicitCast;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues) == 0x000008, "Wrong alignment on WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues");
static_assert(sizeof(WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues) == 0x000028, "Wrong size on WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues, Value) == 0x000000, "Member 'WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues::Value' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues, Percent) == 0x000004, "Member 'WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues::Percent' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues, CallFunc_SetProgress_Percent_ImplicitCast) == 0x000020, "Member 'WBP_G_Spectator_PlayerStats_C_UpdatePlayerStatValues::CallFunc_SetProgress_Percent_ImplicitCast' has a wrong offset!");

}

