#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Journeys_Abilities_End

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Prototype_Journeys_Abilities_End.WBP_G_Prototype_Journeys_Abilities_End_C.DisplayCaption
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption final
{
public:
	class FText                                   CaptionText;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Duration;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption) == 0x000008, "Wrong alignment on WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption");
static_assert(sizeof(WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption) == 0x000020, "Wrong size on WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption, CaptionText) == 0x000000, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption::CaptionText' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption, Duration) == 0x000018, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_DisplayCaption::Duration' has a wrong offset!");

// Function WBP_G_Prototype_Journeys_Abilities_End.WBP_G_Prototype_Journeys_Abilities_End_C.ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End
// 0x0120 (0x0120 - 0x0000)
struct WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Points;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Details_1;                            // 0x0020(0x0018)()
	int32                                         K2Node_Event_PointsGained;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TotalPoints;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ComboCount;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_ComboDuration;                        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_Details;                              // 0x0050(0x0018)()
	class FText                                   K2Node_Event_CaptionText;                          // 0x0068(0x0018)()
	double                                        K2Node_Event_Duration;                             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0088(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameState*                           CallFunc_GetHWGameState_ReturnValue;               // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_Journey_C>        K2Node_DynamicCast_AsBPI_Journey;                  // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPoints_Points;                         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_3;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2;  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3;  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End) == 0x000008, "Wrong alignment on WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End");
static_assert(sizeof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End) == 0x000120, "Wrong size on WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, EntryPoint) == 0x000000, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000008, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_byte_Variable) == 0x000010, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_bool_Variable) == 0x000011, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_byte_Variable_2) == 0x000013, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_bool_Variable_1) == 0x000014, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_byte_Variable_3) == 0x000015, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_byte_Variable_4) == 0x000016, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_bool_Variable_2) == 0x000017, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_byte_Variable_5) == 0x000018, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_byte_Variable_6) == 0x000019, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_Points) == 0x00001C, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_Points' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_Details_1) == 0x000020, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_Details_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_PointsGained) == 0x000038, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_PointsGained' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_TotalPoints) == 0x00003C, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_TotalPoints' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_ComboCount) == 0x000040, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_ComboCount' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_ComboDuration) == 0x000048, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_ComboDuration' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_Details) == 0x000050, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_Details' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_CaptionText) == 0x000068, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_CaptionText' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_Duration) == 0x000080, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_Duration' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_MyGeometry) == 0x000088, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Event_InDeltaTime) == 0x0000C0, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_GetHWGameState_ReturnValue) == 0x0000C8, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_GetHWGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_DynamicCast_AsBPI_Journey) == 0x0000D0, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_DynamicCast_AsBPI_Journey' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_GetPoints_Points) == 0x0000E4, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_GetPoints_Points' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_byte_Variable_7) == 0x0000E8, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, Temp_bool_Variable_3) == 0x0000E9, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000F0, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x0000F8, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000100, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000101, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Select_Default) == 0x000102, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Select_Default_1) == 0x000103, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_Conv_IntToDouble_ReturnValue_2) == 0x000108, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_Conv_IntToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_Conv_IntToDouble_ReturnValue_3) == 0x000110, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_Conv_IntToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2) == 0x000118, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3) == 0x000119, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Select_Default_2) == 0x00011A, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End, K2Node_Select_Default_3) == 0x00011B, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_End::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_G_Prototype_Journeys_Abilities_End.WBP_G_Prototype_Journeys_Abilities_End_C.GetPoints
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_Prototype_Journeys_Abilities_End_C_GetPoints final
{
public:
	int32                                         Points;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Journeys_Abilities_End_C_GetPoints) == 0x000004, "Wrong alignment on WBP_G_Prototype_Journeys_Abilities_End_C_GetPoints");
static_assert(sizeof(WBP_G_Prototype_Journeys_Abilities_End_C_GetPoints) == 0x000004, "Wrong size on WBP_G_Prototype_Journeys_Abilities_End_C_GetPoints");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_GetPoints, Points) == 0x000000, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_GetPoints::Points' has a wrong offset!");

// Function WBP_G_Prototype_Journeys_Abilities_End.WBP_G_Prototype_Journeys_Abilities_End_C.PointsGained
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained final
{
public:
	int32                                         Points;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Details;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained) == 0x000008, "Wrong alignment on WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained");
static_assert(sizeof(WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained) == 0x000020, "Wrong size on WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained, Points) == 0x000000, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained::Points' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained, Details) == 0x000008, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_PointsGained::Details' has a wrong offset!");

// Function WBP_G_Prototype_Journeys_Abilities_End.WBP_G_Prototype_Journeys_Abilities_End_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_G_Prototype_Journeys_Abilities_End_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Prototype_Journeys_Abilities_End_C_Tick) == 0x000004, "Wrong alignment on WBP_G_Prototype_Journeys_Abilities_End_C_Tick");
static_assert(sizeof(WBP_G_Prototype_Journeys_Abilities_End_C_Tick) == 0x00003C, "Wrong size on WBP_G_Prototype_Journeys_Abilities_End_C_Tick");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_G_Prototype_Journeys_Abilities_End.WBP_G_Prototype_Journeys_Abilities_End_C.UpdatePointsHUD
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD final
{
public:
	int32                                         PointsGained_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalPoints;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboCount;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ComboDuration;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Details;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD) == 0x000008, "Wrong alignment on WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD");
static_assert(sizeof(WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD) == 0x000030, "Wrong size on WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD, PointsGained_0) == 0x000000, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD::PointsGained_0' has a wrong offset!");
static_assert(offsetof(WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD, TotalPoints) == 0x000004, "Member 'WBP_G_Prototype_Journeys_Abilities_End_C_UpdatePointsHUD::TotalPoints' has a wrong offset!");
