#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_HUDEditor_EntrySlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_HUDEditor_EntrySlider.WBP_G_V1_HUDEditor_EntrySlider_C
// 0x0028 (0x0630 - 0x0608)
class UWBP_G_V1_HUDEditor_EntrySlider_C final : public UHWHUDEditorEditableEntrySlider
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           CustomFieldText;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSlider*                              Slider;                                            // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        MinVal;                                            // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxVal;                                            // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V1_HUDEditor_EntrySlider_Slider_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void DisplayFieldName(const class FText& FieldName);
	void DisplaySliderLimits(float Min, float Max);
	void DisplaySliderValue(float Value);
	void ExecuteUbergraph_WBP_G_V1_HUDEditor_EntrySlider(int32 EntryPoint);
	class UWidget* HandleSliderNavigation(EUINavigation Navigation_0);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_HUDEditor_EntrySlider_C">();
	}
	static class UWBP_G_V1_HUDEditor_EntrySlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_HUDEditor_EntrySlider_C>();
	}
};
static_assert(alignof(UWBP_G_V1_HUDEditor_EntrySlider_C) == 0x000008, "Wrong alignment on UWBP_G_V1_HUDEditor_EntrySlider_C");
static_assert(sizeof(UWBP_G_V1_HUDEditor_EntrySlider_C) == 0x000630, "Wrong size on UWBP_G_V1_HUDEditor_EntrySlider_C");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntrySlider_C, UberGraphFrame) == 0x000608, "Member 'UWBP_G_V1_HUDEditor_EntrySlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntrySlider_C, CustomFieldText) == 0x000610, "Member 'UWBP_G_V1_HUDEditor_EntrySlider_C::CustomFieldText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntrySlider_C, Slider) == 0x000618, "Member 'UWBP_G_V1_HUDEditor_EntrySlider_C::Slider' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntrySlider_C, MinVal) == 0x000620, "Member 'UWBP_G_V1_HUDEditor_EntrySlider_C::MinVal' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EntrySlider_C, MaxVal) == 0x000628, "Member 'UWBP_G_V1_HUDEditor_EntrySlider_C::MaxVal' has a wrong offset!");

}

