#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_DailyLoginReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_DailyLoginReward.WBP_C_DailyLoginReward_C
// 0x0078 (0x06C8 - 0x0650)
class UWBP_C_DailyLoginReward_C final : public UHWDailyLoginRewardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0650(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              BackgroundHitBox;                                  // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Gold_C*                ClaimButton;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 ClaimingLoading;                                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             ClaimPrompt;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       DayContainer;                                      // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           NextDayLabel;                                      // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_DailyLoginRewardEntry_C*         WBP_C_DailyLoginEntry;                             // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_DailyLoginRewardEntry_C*         WBP_C_DailyLoginEntry_1;                           // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_DailyLoginRewardEntry_C*         WBP_C_DailyLoginEntry_2;                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_DailyLoginRewardEntry_C*         WBP_C_DailyLoginEntry_3;                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_DailyLoginRewardEntry_C*         WBP_C_DailyLoginEntry_4;                           // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_DailyLoginRewardEntry_C*         WBP_C_DailyLoginEntry_5;                           // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_DailyLoginRewardEntry_LastDay_C* WBP_C_DailyLoginEntry_6;                           // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ShownTimestamp;                                    // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_DailyLogin_ClaumButton_K2Node_ComponentBoundEvent_0_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_C_DailyLoginReward_BackgroundHitBox_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	bool BP_OnHandleBackAction();
	void CanClaimLoginRewardUpdated(bool bCanClaim);
	void DailyProgressUpdated(int32 ClaimedDays);
	void ExecuteUbergraph_WBP_C_DailyLoginReward(int32 EntryPoint);
	void InitializeWidget();
	void IsClaimingRewardUpdated();
	void OnHide();
	void OnShown();
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;
	TArray<class UHWDailyLoginRewardEntryWidget*> GetDailyLoginEntries() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_DailyLoginReward_C">();
	}
	static class UWBP_C_DailyLoginReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_DailyLoginReward_C>();
	}
};
static_assert(alignof(UWBP_C_DailyLoginReward_C) == 0x000008, "Wrong alignment on UWBP_C_DailyLoginReward_C");
static_assert(sizeof(UWBP_C_DailyLoginReward_C) == 0x0006C8, "Wrong size on UWBP_C_DailyLoginReward_C");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, UberGraphFrame) == 0x000650, "Member 'UWBP_C_DailyLoginReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, BackgroundHitBox) == 0x000658, "Member 'UWBP_C_DailyLoginReward_C::BackgroundHitBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, ClaimButton) == 0x000660, "Member 'UWBP_C_DailyLoginReward_C::ClaimButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, ClaimingLoading) == 0x000668, "Member 'UWBP_C_DailyLoginReward_C::ClaimingLoading' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, ClaimPrompt) == 0x000670, "Member 'UWBP_C_DailyLoginReward_C::ClaimPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, DayContainer) == 0x000678, "Member 'UWBP_C_DailyLoginReward_C::DayContainer' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, NextDayLabel) == 0x000680, "Member 'UWBP_C_DailyLoginReward_C::NextDayLabel' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, WBP_C_DailyLoginEntry) == 0x000688, "Member 'UWBP_C_DailyLoginReward_C::WBP_C_DailyLoginEntry' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, WBP_C_DailyLoginEntry_1) == 0x000690, "Member 'UWBP_C_DailyLoginReward_C::WBP_C_DailyLoginEntry_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, WBP_C_DailyLoginEntry_2) == 0x000698, "Member 'UWBP_C_DailyLoginReward_C::WBP_C_DailyLoginEntry_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, WBP_C_DailyLoginEntry_3) == 0x0006A0, "Member 'UWBP_C_DailyLoginReward_C::WBP_C_DailyLoginEntry_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, WBP_C_DailyLoginEntry_4) == 0x0006A8, "Member 'UWBP_C_DailyLoginReward_C::WBP_C_DailyLoginEntry_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, WBP_C_DailyLoginEntry_5) == 0x0006B0, "Member 'UWBP_C_DailyLoginReward_C::WBP_C_DailyLoginEntry_5' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, WBP_C_DailyLoginEntry_6) == 0x0006B8, "Member 'UWBP_C_DailyLoginReward_C::WBP_C_DailyLoginEntry_6' has a wrong offset!");
static_assert(offsetof(UWBP_C_DailyLoginReward_C, ShownTimestamp) == 0x0006C0, "Member 'UWBP_C_DailyLoginReward_C::ShownTimestamp' has a wrong offset!");

}

