#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.BndEvt__WBP_G_V2_Scoreboard_PlayerContextMenu_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_Scoreboard_C_BndEvt__WBP_G_V2_Scoreboard_PlayerContextMenu_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_BndEvt__WBP_G_V2_Scoreboard_PlayerContextMenu_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_G_V2_Scoreboard_C_BndEvt__WBP_G_V2_Scoreboard_PlayerContextMenu_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_BndEvt__WBP_G_V2_Scoreboard_PlayerContextMenu_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_G_V2_Scoreboard_C_BndEvt__WBP_G_V2_Scoreboard_PlayerContextMenu_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_BndEvt__WBP_G_V2_Scoreboard_PlayerContextMenu_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_BndEvt__WBP_G_V2_Scoreboard_PlayerContextMenu_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.CloseGodPanel
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_Scoreboard_C_CloseGodPanel final
{
public:
	bool                                          bRestoreFocusToSelectedPlayerWidget;               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_CloseGodPanel) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_C_CloseGodPanel");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_CloseGodPanel) == 0x000010, "Wrong size on WBP_G_V2_Scoreboard_C_CloseGodPanel");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_CloseGodPanel, bRestoreFocusToSelectedPlayerWidget) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_CloseGodPanel::bRestoreFocusToSelectedPlayerWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_CloseGodPanel, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_C_CloseGodPanel::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.ExecuteUbergraph_WBP_G_V2_Scoreboard
// 0x0038 (0x0038 - 0x0000)
struct WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWScoreboardTeamWidget*                CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard) == 0x000038, "Wrong size on WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, EntryPoint) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, Temp_bool_Variable_2) == 0x000006, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, Temp_bool_Variable_3) == 0x000007, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, Temp_bool_Variable_4) == 0x000008, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, Temp_int_Variable) == 0x00000C, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000010, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, Temp_byte_Variable) == 0x000019, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000028, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, K2Node_ComponentBoundEvent_InVisibility) == 0x000030, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard, K2Node_Select_Default) == 0x000031, "Member 'WBP_G_V2_Scoreboard_C_ExecuteUbergraph_WBP_G_V2_Scoreboard::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.HandlePlayerContextMenuEntryClicked
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked final
{
public:
	EHWPlayerContextActions                       EntryAction;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  PlayerUuid;                                        // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked, EntryAction) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked::EntryAction' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked, PlayerUuid) == 0x000004, "Member 'WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked::PlayerUuid' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000018, "Member 'WBP_G_V2_Scoreboard_C_HandlePlayerContextMenuEntryClicked::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.InitializeWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_Scoreboard_C_InitializeWidget final
{
public:
	TDelegate<void(EHWPlayerContextActions EntryAction, const struct FGuid& PlayerUuid)> K2Node_CreateDelegate_OutputDelegate; // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGuid& PlayerId, bool Success)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_InitializeWidget) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_C_InitializeWidget");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_InitializeWidget) == 0x000030, "Wrong size on WBP_G_V2_Scoreboard_C_InitializeWidget");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_G_V2_Scoreboard_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_G_V2_Scoreboard_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.On Player Reported
// 0x0014 (0x0014 - 0x0000)
struct WBP_G_V2_Scoreboard_C_On_Player_Reported final
{
public:
	struct FGuid                                  PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_On_Player_Reported) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_C_On_Player_Reported");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_On_Player_Reported) == 0x000014, "Wrong size on WBP_G_V2_Scoreboard_C_On_Player_Reported");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_On_Player_Reported, PlayerId) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_On_Player_Reported::PlayerId' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_On_Player_Reported, Success) == 0x000010, "Member 'WBP_G_V2_Scoreboard_C_On_Player_Reported::Success' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.OnGodPortraitEntrySelected
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected final
{
public:
	class UHWScoreboardPlayerWidget*              PlayerWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 SelectedGodItem;                                   // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHover;                                          // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWPlayerState*                         CallFunc_GetTrackedPlayerState_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected) == 0x000028, "Wrong size on WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected, PlayerWidget) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected::PlayerWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected, SelectedGodItem) == 0x000008, "Member 'WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected::SelectedGodItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected, bIsHover) == 0x000010, "Member 'WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected::bIsHover' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected, CallFunc_GetTrackedPlayerState_ReturnValue) == 0x000018, "Member 'WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected::CallFunc_GetTrackedPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000020, "Member 'WBP_G_V2_Scoreboard_C_OnGodPortraitEntrySelected::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.OnPlayerEntrySelected
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected final
{
public:
	class UHWScoreboardTeamWidget*                TeamWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWScoreboardPlayerWidget*              PlayerWidget;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerState*                           SelectedPlayer;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetTrackedPlayerInfo_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPlayerNameGeometry_ReturnValue;        // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected) == 0x000060, "Wrong size on WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected, TeamWidget) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected::TeamWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected, PlayerWidget) == 0x000008, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected::PlayerWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected, SelectedPlayer) == 0x000010, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected::SelectedPlayer' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected, CallFunc_GetTrackedPlayerInfo_ReturnValue) == 0x000018, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected::CallFunc_GetTrackedPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected, CallFunc_GetPlayerNameGeometry_ReturnValue) == 0x000020, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected::CallFunc_GetPlayerNameGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerEntrySelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.OnPlayerMuteSelected
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected final
{
public:
	class UHWScoreboardTeamWidget*                TeamWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWScoreboardPlayerWidget*              PlayerWidget;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWPlayerState*                         SelectedPlayer;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetTrackedPlayerInfo_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0020(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected) == 0x000060, "Wrong size on WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected, TeamWidget) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected::TeamWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected, PlayerWidget) == 0x000008, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected::PlayerWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected, SelectedPlayer) == 0x000010, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected::SelectedPlayer' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected, CallFunc_GetTrackedPlayerInfo_ReturnValue) == 0x000018, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected::CallFunc_GetTrackedPlayerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected, CallFunc_GetCachedGeometry_ReturnValue) == 0x000020, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_G_V2_Scoreboard_C_OnPlayerMuteSelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_Scoreboard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_Scoreboard_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_Scoreboard_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_Scoreboard.WBP_G_V2_Scoreboard_C.BP_GetDesiredFocusTarget
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue_3;      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget) == 0x000060, "Wrong size on WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget, CallFunc_IsVisible_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_C_BP_GetDesiredFocusTarget::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
