#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spectator_LineGraphs

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Spectator_LineGraphs.WBP_G_Spectator_LineGraphs_C
// 0x0058 (0x0670 - 0x0618)
class UWBP_G_Spectator_LineGraphs_C final : public UHWSpectatorGraphWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USimpleTimeSeriesPlot*                  GoldDifferenceTimeSeriesPlot;                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GoldDifferenceValue;                               // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleTimeSeriesPlot*                  XPDifferenceTimeSeriesPlot;                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           XPDifferenceValue;                                 // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   XPDifferenceName;                                  // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GoldDifferenceName;                                // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector2D>                      XpDesignTestData;                                  // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                      GoldDesignTestData;                                // 0x0660(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WBP_G_Spectator_LineGraphs(int32 EntryPoint);
	void OnTeamDataUpdated(float XPDifference, float GoldDifference, float GameElapsedTime);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Spectator_LineGraphs_C">();
	}
	static class UWBP_G_Spectator_LineGraphs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Spectator_LineGraphs_C>();
	}
};
static_assert(alignof(UWBP_G_Spectator_LineGraphs_C) == 0x000008, "Wrong alignment on UWBP_G_Spectator_LineGraphs_C");
static_assert(sizeof(UWBP_G_Spectator_LineGraphs_C) == 0x000670, "Wrong size on UWBP_G_Spectator_LineGraphs_C");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, UberGraphFrame) == 0x000618, "Member 'UWBP_G_Spectator_LineGraphs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, GoldDifferenceTimeSeriesPlot) == 0x000620, "Member 'UWBP_G_Spectator_LineGraphs_C::GoldDifferenceTimeSeriesPlot' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, GoldDifferenceValue) == 0x000628, "Member 'UWBP_G_Spectator_LineGraphs_C::GoldDifferenceValue' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, XPDifferenceTimeSeriesPlot) == 0x000630, "Member 'UWBP_G_Spectator_LineGraphs_C::XPDifferenceTimeSeriesPlot' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, XPDifferenceValue) == 0x000638, "Member 'UWBP_G_Spectator_LineGraphs_C::XPDifferenceValue' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, XPDifferenceName) == 0x000640, "Member 'UWBP_G_Spectator_LineGraphs_C::XPDifferenceName' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, GoldDifferenceName) == 0x000648, "Member 'UWBP_G_Spectator_LineGraphs_C::GoldDifferenceName' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, XpDesignTestData) == 0x000650, "Member 'UWBP_G_Spectator_LineGraphs_C::XpDesignTestData' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spectator_LineGraphs_C, GoldDesignTestData) == 0x000660, "Member 'UWBP_G_Spectator_LineGraphs_C::GoldDesignTestData' has a wrong offset!");

}

