#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spectator_ConquestHUD

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_Spectator_ConquestHUD.WBP_G_Spectator_ConquestHUD_C.GetPopupManager
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Spectator_ConquestHUD_C_GetPopupManager final
{
public:
	class URHPopupManager*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spectator_ConquestHUD_C_GetPopupManager) == 0x000008, "Wrong alignment on WBP_G_Spectator_ConquestHUD_C_GetPopupManager");
static_assert(sizeof(WBP_G_Spectator_ConquestHUD_C_GetPopupManager) == 0x000008, "Wrong size on WBP_G_Spectator_ConquestHUD_C_GetPopupManager");
static_assert(offsetof(WBP_G_Spectator_ConquestHUD_C_GetPopupManager, ReturnValue) == 0x000000, "Member 'WBP_G_Spectator_ConquestHUD_C_GetPopupManager::ReturnValue' has a wrong offset!");

// Function WBP_G_Spectator_ConquestHUD.WBP_G_Spectator_ConquestHUD_C.GetCanvasPanels
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels final
{
public:
	TArray<class UHWCanvasPanel*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWCanvasPanel*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels) == 0x000008, "Wrong alignment on WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels");
static_assert(sizeof(WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels) == 0x000020, "Wrong size on WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels");
static_assert(offsetof(WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels, ReturnValue) == 0x000000, "Member 'WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_Spectator_ConquestHUD_C_GetCanvasPanels::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_G_Spectator_ConquestHUD.WBP_G_Spectator_ConquestHUD_C.GetHWWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_Spectator_ConquestHUD_C_GetHWWidgets final
{
public:
	TArray<class UHWWidget*>                      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWWidget*>                      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_Spectator_ConquestHUD_C_GetHWWidgets) == 0x000008, "Wrong alignment on WBP_G_Spectator_ConquestHUD_C_GetHWWidgets");
static_assert(sizeof(WBP_G_Spectator_ConquestHUD_C_GetHWWidgets) == 0x000020, "Wrong size on WBP_G_Spectator_ConquestHUD_C_GetHWWidgets");
static_assert(offsetof(WBP_G_Spectator_ConquestHUD_C_GetHWWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_Spectator_ConquestHUD_C_GetHWWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spectator_ConquestHUD_C_GetHWWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_Spectator_ConquestHUD_C_GetHWWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

