#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ChatWindow

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ChatWindow.WBP_G_V2_ChatWindow_C
// 0x0090 (0x0728 - 0x0698)
class UWBP_G_V2_ChatWindow_C final : public UHWChatWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0698(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOutPreview;                               // 0x06A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_FadeOut;                                      // 0x06A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               ButtonOverlay;                                     // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         ChatMessageList;                                   // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWScrollBox*                           ChatScrollBox;                                     // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChatWindowBackground;                              // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              CloseButton;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FocusedBorder;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       HintText;                                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InputBackground;                                   // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                OpenChatButton;                                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PromptSizeBox;                                     // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         VisibleContainer;                                  // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             WindowSizeBox;                                     // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           FadeOutChatTimerHandle;                            // 0x0710(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXChatEntry;                                      // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXChatOpen;                                       // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddChatEntryToWindow(const struct FHWChatEntry& ChatEntry);
	void BndEvt__WBP_G_V2_ChatWindow_ChatScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
	void BndEvt__WBP_G_V2_ChatWindow_CloseButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_ChatWindow_EditableText_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__WBP_G_V2_ChatWindow_OpenChatButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ClearFadeOutTimer(bool bRestartTimer);
	void DoChatClick();
	void ExecuteUbergraph_WBP_G_V2_ChatWindow(int32 EntryPoint);
	void FadeOutChatWindow();
	void HandleFadeOutAnimFinished();
	void HideChatWindow(EHWChatWindowState PrevChatState);
	void InitializeWidget();
	void On_Input_Mode_Changed(ERH_INPUT_STATE InputState);
	void OnListenToChatEntries();
	void PlayChatEntryAddedSFX();
	void PlayOpenChatSFX(EHWChatWindowState PrevChatState);
	void PreviewChatWindow();
	void SetChatState(EHWChatWindowState ChatState);
	void ShowChatWindow();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ChatWindow_C">();
	}
	static class UWBP_G_V2_ChatWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ChatWindow_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ChatWindow_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ChatWindow_C");
static_assert(sizeof(UWBP_G_V2_ChatWindow_C) == 0x000728, "Wrong size on UWBP_G_V2_ChatWindow_C");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, UberGraphFrame) == 0x000698, "Member 'UWBP_G_V2_ChatWindow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, Anim_FadeOutPreview) == 0x0006A0, "Member 'UWBP_G_V2_ChatWindow_C::Anim_FadeOutPreview' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, Anim_FadeOut) == 0x0006A8, "Member 'UWBP_G_V2_ChatWindow_C::Anim_FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, ButtonOverlay) == 0x0006B0, "Member 'UWBP_G_V2_ChatWindow_C::ButtonOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, ChatMessageList) == 0x0006B8, "Member 'UWBP_G_V2_ChatWindow_C::ChatMessageList' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, ChatScrollBox) == 0x0006C0, "Member 'UWBP_G_V2_ChatWindow_C::ChatScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, ChatWindowBackground) == 0x0006C8, "Member 'UWBP_G_V2_ChatWindow_C::ChatWindowBackground' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, CloseButton) == 0x0006D0, "Member 'UWBP_G_V2_ChatWindow_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, FocusedBorder) == 0x0006D8, "Member 'UWBP_G_V2_ChatWindow_C::FocusedBorder' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, HintText) == 0x0006E0, "Member 'UWBP_G_V2_ChatWindow_C::HintText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, InputBackground) == 0x0006E8, "Member 'UWBP_G_V2_ChatWindow_C::InputBackground' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, OpenChatButton) == 0x0006F0, "Member 'UWBP_G_V2_ChatWindow_C::OpenChatButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, PromptSizeBox) == 0x0006F8, "Member 'UWBP_G_V2_ChatWindow_C::PromptSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, VisibleContainer) == 0x000700, "Member 'UWBP_G_V2_ChatWindow_C::VisibleContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, WindowSizeBox) == 0x000708, "Member 'UWBP_G_V2_ChatWindow_C::WindowSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, FadeOutChatTimerHandle) == 0x000710, "Member 'UWBP_G_V2_ChatWindow_C::FadeOutChatTimerHandle' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, SFXChatEntry) == 0x000718, "Member 'UWBP_G_V2_ChatWindow_C::SFXChatEntry' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ChatWindow_C, SFXChatOpen) == 0x000720, "Member 'UWBP_G_V2_ChatWindow_C::SFXChatOpen' has a wrong offset!");

}

