#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_OB10_01

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_OB10_01.WBP_OB10_01_C.Dialogue_Event
// 0x0020 (0x0020 - 0x0000)
struct WBP_OB10_01_C_Dialogue_Event final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   InText;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_OB10_01_C_Dialogue_Event) == 0x000008, "Wrong alignment on WBP_OB10_01_C_Dialogue_Event");
static_assert(sizeof(WBP_OB10_01_C_Dialogue_Event) == 0x000020, "Wrong size on WBP_OB10_01_C_Dialogue_Event");
static_assert(offsetof(WBP_OB10_01_C_Dialogue_Event, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_Dialogue_Event::Dialogue_0' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_Dialogue_Event, InText) == 0x000008, "Member 'WBP_OB10_01_C_Dialogue_Event::InText' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.ExecuteUbergraph_WBP_OB10_01
// 0x0050 (0x0050 - 0x0000)
struct WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWTextBlock*                           K2Node_CustomEvent_Dialogue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0018(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01) == 0x000008, "Wrong alignment on WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01");
static_assert(sizeof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01) == 0x000050, "Wrong size on WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, EntryPoint) == 0x000000, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, K2Node_CustomEvent_Dialogue) == 0x000010, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::K2Node_CustomEvent_Dialogue' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, K2Node_CustomEvent_InText) == 0x000018, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, CallFunc_PlayAnimation_ReturnValue_2) == 0x000038, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, CallFunc_PlayAnimation_ReturnValue_3) == 0x000040, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, CallFunc_BooleanAND_ReturnValue_1) == 0x000049, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01, CallFunc_BooleanAND_ReturnValue_2) == 0x00004A, "Member 'WBP_OB10_01_C_ExecuteUbergraph_WBP_OB10_01::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_OB10_01_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_OB10_01_C_PreConstruct");
static_assert(sizeof(WBP_OB10_01_C_PreConstruct) == 0x000001, "Wrong size on WBP_OB10_01_C_PreConstruct");
static_assert(offsetof(WBP_OB10_01_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_OB10_01_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_0 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_0) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_0");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_0) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_0");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_0, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_0::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_1
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_1 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_1) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_1");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_1) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_1");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_1, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_1::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_2
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_2 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_2) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_2");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_2) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_2");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_2, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_2::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_3
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_3 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_3) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_3");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_3) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_3");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_3, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_3::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_4
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_4 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_4) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_4");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_4) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_4");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_4, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_4::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_5
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_5 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_5) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_5");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_5) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_5");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_5, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_5::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_6
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_6 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_6) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_6");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_6) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_6");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_6, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_6::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_7
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_7 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_7) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_7");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_7) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_7");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_7, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_7::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_8
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_8 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_8) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_8");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_8) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_8");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_8, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_8::Dialogue_0' has a wrong offset!");

// Function WBP_OB10_01.WBP_OB10_01_C.SequenceEvent__ENTRYPOINTWBP_OB10_01_9
// 0x0008 (0x0008 - 0x0000)
struct WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_9 final
{
public:
	class UHWTextBlock*                           Dialogue_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_9) == 0x000008, "Wrong alignment on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_9");
static_assert(sizeof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_9) == 0x000008, "Wrong size on WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_9");
static_assert(offsetof(WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_9, Dialogue_0) == 0x000000, "Member 'WBP_OB10_01_C_SequenceEvent__ENTRYPOINTWBP_OB10_01_9::Dialogue_0' has a wrong offset!");

}

