#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerCard

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_PlayerCard.WBP_S_PlayerCard_C
// 0x00F0 (0x0858 - 0x0768)
class UWBP_S_PlayerCard_C final : public UHWPlayerCardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0768(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PlayerLoading;                                     // 0x0770(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_BadgeItemDisplay_C*              BadgeItem1;                                        // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_BadgeItemDisplay_C*              BadgeItem2;                                        // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_BadgeItemDisplay_C*              BadgeItem3;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BadgeWrapper;                                      // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          CardVFXIcon_Layer1;                                // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          CardVFXIcon_Layer2;                                // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Diamond;                                           // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GodandSkinlabels;                                  // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          GodCard;                                           // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GodName;                                           // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GodNameShade;                                      // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               GradientTop;                                       // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LeftLine;                                          // 0x07D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LoadingImage;                                      // 0x07E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Mastery_SB;                                        // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MasteryStarsDisplay_C*           MasteryStars;                                      // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformIcon_C*                    PlatformIcon;                                      // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               PlayerCosmeticShade;                               // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PlayerNameDisplay_C*             PlayerNameDisplay;                                 // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PlayerTitle;                                       // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RankBackground;                                    // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               RightLine;                                         // 0x0820(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SkinName;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StrokeBorderGradient_C*            TeamBorderColorStroke;                             // 0x0830(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_TrackerItemDisplay_C*            TrackerItem1;                                      // 0x0838(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_TrackerItemDisplay_C*            TrackerItem2;                                      // 0x0840(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             TrackerWrapper;                                    // 0x0848(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSkinItem*                            SkinAsset;                                         // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_S_PlayerCard(int32 EntryPoint);
	void InitializeWidget();
	void SetShouldShowBadgeCosmetics(bool ShouldShowCosmetics);
	void SetShouldShowTrackerCosmetics(bool ShouldShowCosmetics);
	void UpdateCardVFX(const class UHWCollectionItem* InCardVFXItem);
	void UpdateCharacterSkin(const class UHWSkinItem* Skin);
	void UpdateDraftCharacter(const class UHWCharacterItem* Character);
	void UpdateMasteryLevel(int32 Level);
	void UpdatePlayerInfo(class URH_PlayerInfo* InPlayerInfo);
	void UpdatePlayerLoadState(bool bPlayerIsReady);
	void UpdatePlayerName(const class FString& PlayerName);
	void UpdatePlayerPlatformIcon(ERHPlatformDisplayType NewPlatform);
	void UpdatePlayerTitle(const class UHWCollectionItem* InTitleItem);

	TArray<class UHWItemDisplayWidget*> GetBadgeWidgets() const;
	TArray<class UHWItemDisplayWidget*> GetTrackerWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_PlayerCard_C">();
	}
	static class UWBP_S_PlayerCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_PlayerCard_C>();
	}
};
static_assert(alignof(UWBP_S_PlayerCard_C) == 0x000008, "Wrong alignment on UWBP_S_PlayerCard_C");
static_assert(sizeof(UWBP_S_PlayerCard_C) == 0x000858, "Wrong size on UWBP_S_PlayerCard_C");
static_assert(offsetof(UWBP_S_PlayerCard_C, UberGraphFrame) == 0x000768, "Member 'UWBP_S_PlayerCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, PlayerLoading) == 0x000770, "Member 'UWBP_S_PlayerCard_C::PlayerLoading' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, BadgeItem1) == 0x000778, "Member 'UWBP_S_PlayerCard_C::BadgeItem1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, BadgeItem2) == 0x000780, "Member 'UWBP_S_PlayerCard_C::BadgeItem2' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, BadgeItem3) == 0x000788, "Member 'UWBP_S_PlayerCard_C::BadgeItem3' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, BadgeWrapper) == 0x000790, "Member 'UWBP_S_PlayerCard_C::BadgeWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, CardVFXIcon_Layer1) == 0x000798, "Member 'UWBP_S_PlayerCard_C::CardVFXIcon_Layer1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, CardVFXIcon_Layer2) == 0x0007A0, "Member 'UWBP_S_PlayerCard_C::CardVFXIcon_Layer2' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, Diamond) == 0x0007A8, "Member 'UWBP_S_PlayerCard_C::Diamond' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, GodandSkinlabels) == 0x0007B0, "Member 'UWBP_S_PlayerCard_C::GodandSkinlabels' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, GodCard) == 0x0007B8, "Member 'UWBP_S_PlayerCard_C::GodCard' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, GodName) == 0x0007C0, "Member 'UWBP_S_PlayerCard_C::GodName' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, GodNameShade) == 0x0007C8, "Member 'UWBP_S_PlayerCard_C::GodNameShade' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, GradientTop) == 0x0007D0, "Member 'UWBP_S_PlayerCard_C::GradientTop' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, LeftLine) == 0x0007D8, "Member 'UWBP_S_PlayerCard_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, LoadingImage) == 0x0007E0, "Member 'UWBP_S_PlayerCard_C::LoadingImage' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, Mastery_SB) == 0x0007E8, "Member 'UWBP_S_PlayerCard_C::Mastery_SB' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, MasteryStars) == 0x0007F0, "Member 'UWBP_S_PlayerCard_C::MasteryStars' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, PlatformIcon) == 0x0007F8, "Member 'UWBP_S_PlayerCard_C::PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, PlayerCosmeticShade) == 0x000800, "Member 'UWBP_S_PlayerCard_C::PlayerCosmeticShade' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, PlayerNameDisplay) == 0x000808, "Member 'UWBP_S_PlayerCard_C::PlayerNameDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, PlayerTitle) == 0x000810, "Member 'UWBP_S_PlayerCard_C::PlayerTitle' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, RankBackground) == 0x000818, "Member 'UWBP_S_PlayerCard_C::RankBackground' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, RightLine) == 0x000820, "Member 'UWBP_S_PlayerCard_C::RightLine' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, SkinName) == 0x000828, "Member 'UWBP_S_PlayerCard_C::SkinName' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, TeamBorderColorStroke) == 0x000830, "Member 'UWBP_S_PlayerCard_C::TeamBorderColorStroke' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, TrackerItem1) == 0x000838, "Member 'UWBP_S_PlayerCard_C::TrackerItem1' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, TrackerItem2) == 0x000840, "Member 'UWBP_S_PlayerCard_C::TrackerItem2' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, TrackerWrapper) == 0x000848, "Member 'UWBP_S_PlayerCard_C::TrackerWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_S_PlayerCard_C, SkinAsset) == 0x000850, "Member 'UWBP_S_PlayerCard_C::SkinAsset' has a wrong offset!");

}

