#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_GodBuilderInfoCategory

#include "Basic.hpp"

#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_GodBuilderInfoCategory.WBP_G_GodBuilderInfoCategory_C.DisplayGodBuildInfo
// 0x0190 (0x0190 - 0x0000)
struct WBP_G_GodBuilderInfoCategory_C_DisplayGodBuildInfo final
{
public:
	struct FHWGodBuild                            GodBuild;                                          // 0x0000(0x0190)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_GodBuilderInfoCategory_C_DisplayGodBuildInfo) == 0x000008, "Wrong alignment on WBP_G_GodBuilderInfoCategory_C_DisplayGodBuildInfo");
static_assert(sizeof(WBP_G_GodBuilderInfoCategory_C_DisplayGodBuildInfo) == 0x000190, "Wrong size on WBP_G_GodBuilderInfoCategory_C_DisplayGodBuildInfo");
static_assert(offsetof(WBP_G_GodBuilderInfoCategory_C_DisplayGodBuildInfo, GodBuild) == 0x000000, "Member 'WBP_G_GodBuilderInfoCategory_C_DisplayGodBuildInfo::GodBuild' has a wrong offset!");

// Function WBP_G_GodBuilderInfoCategory.WBP_G_GodBuilderInfoCategory_C.ExecuteUbergraph_WBP_G_GodBuilderInfoCategory
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWGodBuild                            K2Node_Event_GodBuild;                             // 0x0008(0x0190)(ConstParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0198(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01B0(0x0018)()
};
static_assert(alignof(WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory) == 0x000008, "Wrong alignment on WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory");
static_assert(sizeof(WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory) == 0x0001C8, "Wrong size on WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory");
static_assert(offsetof(WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory, EntryPoint) == 0x000000, "Member 'WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory, K2Node_Event_GodBuild) == 0x000008, "Member 'WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory::K2Node_Event_GodBuild' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory, CallFunc_Conv_StringToText_ReturnValue) == 0x000198, "Member 'WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001B0, "Member 'WBP_G_GodBuilderInfoCategory_C_ExecuteUbergraph_WBP_G_GodBuilderInfoCategory::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_G_GodBuilderInfoCategory.WBP_G_GodBuilderInfoCategory_C.UpdateInfo
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_G_GodBuilderInfoCategory_C_UpdateInfo final
{
public:
	struct FHWGodBuild                            GodBuild;                                          // 0x0000(0x0190)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0190(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01A8(0x0018)()
};
static_assert(alignof(WBP_G_GodBuilderInfoCategory_C_UpdateInfo) == 0x000008, "Wrong alignment on WBP_G_GodBuilderInfoCategory_C_UpdateInfo");
static_assert(sizeof(WBP_G_GodBuilderInfoCategory_C_UpdateInfo) == 0x0001C0, "Wrong size on WBP_G_GodBuilderInfoCategory_C_UpdateInfo");
static_assert(offsetof(WBP_G_GodBuilderInfoCategory_C_UpdateInfo, GodBuild) == 0x000000, "Member 'WBP_G_GodBuilderInfoCategory_C_UpdateInfo::GodBuild' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderInfoCategory_C_UpdateInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000190, "Member 'WBP_G_GodBuilderInfoCategory_C_UpdateInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderInfoCategory_C_UpdateInfo, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001A8, "Member 'WBP_G_GodBuilderInfoCategory_C_UpdateInfo::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

}

