#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_JumpStampItemDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_JumpStampItemDisplay.WBP_S_JumpStampItemDisplay_C
// 0x0088 (0x06F8 - 0x0670)
class UWBP_S_JumpStampItemDisplay_C final : public UHWItemDisplayWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_S_CTADisplay_C*                    CTADisplay;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverGradient_Gold;                                // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke_FX;                                    // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke_White;                                 // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IsEquippedIndicator;                               // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          IsLockedIcon;                                      // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             IsOwned_Overlay;                                   // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          IsOwnedIcon;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               IsOwnedIconBackground;                             // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ListViewCardVFXIcon;                               // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 ListViewLoadingThrobber;                           // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      StatusSwitcher;                                    // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               UnownedTint;                                       // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowCTA;                                          // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_HandleEntryButtonHovered();
	void BP_HandleEntryButtonSelected();
	void BP_HandleEntryButtonUnhovered();
	void BP_HandleOnDisplayItemSet();
	void BP_HandleSetDisplayOwnershipIcons(bool InDisplayOwnershipIcons);
	void BP_HandleSetIsEquipped(bool InIsEquipped);
	void BP_HandleSetIsInteractable(bool InIsInteractable);
	void BP_HandleSetIsSelected(bool InIsSelected);
	void ExecuteUbergraph_WBP_S_JumpStampItemDisplay(int32 EntryPoint);
	void HandleEntryButtonHovered();
	void HandleEntryButtonSelected();
	void HandleEntryButtonUnhovered();
	void OnDisplayItemSet();
	void SelectEntry();
	void SetDisplayOwnershipIcons(bool bInDisplayOwnershipIcons);
	void SetIsEquipped(bool bInIsEquipped);
	void SetIsInteractable(bool bInIsInteractable);
	void SetIsSelected(bool bInIsSelected);
	void UpdateOwnershipIcons();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_JumpStampItemDisplay_C">();
	}
	static class UWBP_S_JumpStampItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_JumpStampItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_S_JumpStampItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_S_JumpStampItemDisplay_C");
static_assert(sizeof(UWBP_S_JumpStampItemDisplay_C) == 0x0006F8, "Wrong size on UWBP_S_JumpStampItemDisplay_C");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, UberGraphFrame) == 0x000670, "Member 'UWBP_S_JumpStampItemDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, CTADisplay) == 0x000678, "Member 'UWBP_S_JumpStampItemDisplay_C::CTADisplay' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, HoverGradient_Gold) == 0x000680, "Member 'UWBP_S_JumpStampItemDisplay_C::HoverGradient_Gold' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, HoverStroke_FX) == 0x000688, "Member 'UWBP_S_JumpStampItemDisplay_C::HoverStroke_FX' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, HoverStroke_White) == 0x000690, "Member 'UWBP_S_JumpStampItemDisplay_C::HoverStroke_White' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, IsEquippedIndicator) == 0x000698, "Member 'UWBP_S_JumpStampItemDisplay_C::IsEquippedIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, IsLockedIcon) == 0x0006A0, "Member 'UWBP_S_JumpStampItemDisplay_C::IsLockedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, IsOwned_Overlay) == 0x0006A8, "Member 'UWBP_S_JumpStampItemDisplay_C::IsOwned_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, IsOwnedIcon) == 0x0006B0, "Member 'UWBP_S_JumpStampItemDisplay_C::IsOwnedIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, IsOwnedIconBackground) == 0x0006B8, "Member 'UWBP_S_JumpStampItemDisplay_C::IsOwnedIconBackground' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, ListViewCardVFXIcon) == 0x0006C0, "Member 'UWBP_S_JumpStampItemDisplay_C::ListViewCardVFXIcon' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, ListViewLoadingThrobber) == 0x0006C8, "Member 'UWBP_S_JumpStampItemDisplay_C::ListViewLoadingThrobber' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, StatusSwitcher) == 0x0006D0, "Member 'UWBP_S_JumpStampItemDisplay_C::StatusSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, UnownedTint) == 0x0006D8, "Member 'UWBP_S_JumpStampItemDisplay_C::UnownedTint' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, SFXHover) == 0x0006E0, "Member 'UWBP_S_JumpStampItemDisplay_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, SFXClick) == 0x0006E8, "Member 'UWBP_S_JumpStampItemDisplay_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_S_JumpStampItemDisplay_C, bShowCTA) == 0x0006F0, "Member 'UWBP_S_JumpStampItemDisplay_C::bShowCTA' has a wrong offset!");

}

