#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_BuffWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_BuffWidget.WBP_G_V2_BuffWidget_C
// 0x0058 (0x0660 - 0x0608)
class UWBP_G_V2_BuffWidget_C final : public UHWBuffWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BuffIcon;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DurationText;                                      // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitArea;                                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stack_CircleFill;                                  // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Stack_Overlay;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           StackText;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stroke_Buff;                                       // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Stroke_DebuffRed;                                  // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      Stroke_Switcher;                                   // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             TooltipRef;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_BuffWidget_HitArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_BuffWidget_HitArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BuffDataUpdated();
	void ExecuteUbergraph_WBP_G_V2_BuffWidget(int32 EntryPoint);
	void SetBuffWidgetType(EHWBuffWidgetType BuffWidgetType);
	void UpdateCountdown();
	void UpdateStackCount();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_BuffWidget_C">();
	}
	static class UWBP_G_V2_BuffWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_BuffWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_BuffWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_BuffWidget_C");
static_assert(sizeof(UWBP_G_V2_BuffWidget_C) == 0x000660, "Wrong size on UWBP_G_V2_BuffWidget_C");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, UberGraphFrame) == 0x000608, "Member 'UWBP_G_V2_BuffWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, BuffIcon) == 0x000610, "Member 'UWBP_G_V2_BuffWidget_C::BuffIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, DurationText) == 0x000618, "Member 'UWBP_G_V2_BuffWidget_C::DurationText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, HitArea) == 0x000620, "Member 'UWBP_G_V2_BuffWidget_C::HitArea' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, Stack_CircleFill) == 0x000628, "Member 'UWBP_G_V2_BuffWidget_C::Stack_CircleFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, Stack_Overlay) == 0x000630, "Member 'UWBP_G_V2_BuffWidget_C::Stack_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, StackText) == 0x000638, "Member 'UWBP_G_V2_BuffWidget_C::StackText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, Stroke_Buff) == 0x000640, "Member 'UWBP_G_V2_BuffWidget_C::Stroke_Buff' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, Stroke_DebuffRed) == 0x000648, "Member 'UWBP_G_V2_BuffWidget_C::Stroke_DebuffRed' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, Stroke_Switcher) == 0x000650, "Member 'UWBP_G_V2_BuffWidget_C::Stroke_Switcher' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_BuffWidget_C, TooltipRef) == 0x000658, "Member 'UWBP_G_V2_BuffWidget_C::TooltipRef' has a wrong offset!");

}

