#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_GodBuilderViewer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Hemingway_structs.hpp"
#include "HemingwayUI_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_GodBuildListView_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature final
{
public:
	class UHWTabBarWidget*                        TabBarWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         TabIndex;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWTabChangeCause                             Cause;                                             // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature, TabBarWidget) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature::TabBarWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature, TabIndex) == 0x000008, "Member 'WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature::TabIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature, Cause) == 0x00000C, "Member 'WBP_G_GodBuilderViewer_C_BndEvt__WBP_G_GodBuilderViewer_TabBar_K2Node_ComponentBoundEvent_1_OnSelectedTabChanged__DelegateSignature::Cause' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.DisplayBuilds
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_GodBuilderViewer_C_DisplayBuilds final
{
public:
	TArray<class UHWGodBuildContainer*>           GodBuildList;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWGodBuildContainer*                   CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_DisplayBuilds) == 0x000008, "Wrong alignment on WBP_G_GodBuilderViewer_C_DisplayBuilds");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_DisplayBuilds) == 0x000028, "Wrong size on WBP_G_GodBuilderViewer_C_DisplayBuilds");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_DisplayBuilds, GodBuildList) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_DisplayBuilds::GodBuildList' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_DisplayBuilds, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000010, "Member 'WBP_G_GodBuilderViewer_C_DisplayBuilds::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_DisplayBuilds, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_G_GodBuilderViewer_C_DisplayBuilds::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_DisplayBuilds, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_G_GodBuilderViewer_C_DisplayBuilds::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_DisplayBuilds, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'WBP_G_GodBuilderViewer_C_DisplayBuilds::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.DisplayFullBuild
// 0x0190 (0x0190 - 0x0000)
struct WBP_G_GodBuilderViewer_C_DisplayFullBuild final
{
public:
	struct FHWGodBuild                            GodBuild;                                          // 0x0000(0x0190)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_DisplayFullBuild) == 0x000008, "Wrong alignment on WBP_G_GodBuilderViewer_C_DisplayFullBuild");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_DisplayFullBuild) == 0x000190, "Wrong size on WBP_G_GodBuilderViewer_C_DisplayFullBuild");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_DisplayFullBuild, GodBuild) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_DisplayFullBuild::GodBuild' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.ExecuteUbergraph_WBP_G_GodBuilderViewer
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWBuildsListDisplayType                      Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuilderSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHWCachedBuildType                            CallFunc_GetCachedBuildType_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWGodBuild                            CallFunc_GetCachedPrimaryBuild_OutGodBuild;        // 0x0018(0x0190)()
	bool                                          CallFunc_GetCachedPrimaryBuild_ReturnValue;        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AF[0x1];                                      // 0x01AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuildContainer*                   K2Node_DynamicCast_AsHWGod_Build_Container;        // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWTabBarWidget*                        K2Node_ComponentBoundEvent_TabBarWidget;           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_TabIndex;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWTabChangeCause                             K2Node_ComponentBoundEvent_Cause;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWBuildsListDisplayType                      Temp_byte_Variable_3;                              // 0x01DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCurrentBuildIsPrimary;               // 0x01DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DF[0x1];                                      // 0x01DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWBuildsListDisplayType                      K2Node_Select_Default_1;                           // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer) == 0x000008, "Wrong alignment on WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer) == 0x0001E8, "Wrong size on WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, EntryPoint) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, Temp_byte_Variable) == 0x000004, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, CallFunc_GetCachedBuildType_ReturnValue) == 0x000010, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::CallFunc_GetCachedBuildType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, CallFunc_GetCachedPrimaryBuild_OutGodBuild) == 0x000018, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::CallFunc_GetCachedPrimaryBuild_OutGodBuild' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, CallFunc_GetCachedPrimaryBuild_ReturnValue) == 0x0001A8, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::CallFunc_GetCachedPrimaryBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001A9, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, Temp_bool_Variable) == 0x0001AA, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, CallFunc_BooleanAND_ReturnValue) == 0x0001AB, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, Temp_byte_Variable_1) == 0x0001AC, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, Temp_byte_Variable_2) == 0x0001AD, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_Select_Default) == 0x0001AE, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_ComponentBoundEvent_Item) == 0x0001B0, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_ComponentBoundEvent_bIsSelected) == 0x0001B8, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_DynamicCast_AsHWGod_Build_Container) == 0x0001C0, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_DynamicCast_AsHWGod_Build_Container' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, CallFunc_RemoveViewRoute_ReturnValue) == 0x0001C9, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_ComponentBoundEvent_TabBarWidget) == 0x0001D0, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_ComponentBoundEvent_TabBarWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_ComponentBoundEvent_TabIndex) == 0x0001D8, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_ComponentBoundEvent_TabIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_ComponentBoundEvent_Cause) == 0x0001DC, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_ComponentBoundEvent_Cause' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, Temp_byte_Variable_3) == 0x0001DD, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_Event_bCurrentBuildIsPrimary) == 0x0001DE, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_Event_bCurrentBuildIsPrimary' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, Temp_int_Variable) == 0x0001E0, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer, K2Node_Select_Default_1) == 0x0001E4, "Member 'WBP_G_GodBuilderViewer_C_ExecuteUbergraph_WBP_G_GodBuilderViewer::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.OnCurrentViewingBuildIsPrimaryChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_GodBuilderViewer_C_OnCurrentViewingBuildIsPrimaryChanged final
{
public:
	bool                                          bCurrentBuildIsPrimary;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_OnCurrentViewingBuildIsPrimaryChanged) == 0x000001, "Wrong alignment on WBP_G_GodBuilderViewer_C_OnCurrentViewingBuildIsPrimaryChanged");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_OnCurrentViewingBuildIsPrimaryChanged) == 0x000001, "Wrong size on WBP_G_GodBuilderViewer_C_OnCurrentViewingBuildIsPrimaryChanged");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_OnCurrentViewingBuildIsPrimaryChanged, bCurrentBuildIsPrimary) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_OnCurrentViewingBuildIsPrimaryChanged::bCurrentBuildIsPrimary' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.OnPinBuild
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_GodBuilderViewer_C_OnPinBuild final
{
public:
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_OnPinBuild) == 0x000001, "Wrong alignment on WBP_G_GodBuilderViewer_C_OnPinBuild");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_OnPinBuild) == 0x000001, "Wrong size on WBP_G_GodBuilderViewer_C_OnPinBuild");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_OnPinBuild, CallFunc_GetIsEnabled_ReturnValue) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_OnPinBuild::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.PinBuild
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_GodBuilderViewer_C_PinBuild final
{
public:
	bool                                          CallFunc_RemoveViewRoute_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_PinBuild) == 0x000001, "Wrong alignment on WBP_G_GodBuilderViewer_C_PinBuild");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_PinBuild) == 0x000001, "Wrong size on WBP_G_GodBuilderViewer_C_PinBuild");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_PinBuild, CallFunc_RemoveViewRoute_ReturnValue) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_PinBuild::CallFunc_RemoveViewRoute_ReturnValue' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.ShowBuildLoading
// 0x0009 (0x0009 - 0x0000)
struct WBP_G_GodBuilderViewer_C_ShowBuildLoading final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_ShowBuildLoading) == 0x000001, "Wrong alignment on WBP_G_GodBuilderViewer_C_ShowBuildLoading");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_ShowBuildLoading) == 0x000009, "Wrong size on WBP_G_GodBuilderViewer_C_ShowBuildLoading");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, bShouldShow) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, Temp_bool_Variable) == 0x000003, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, K2Node_Select_Default) == 0x000007, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowBuildLoading, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_G_GodBuilderViewer_C_ShowBuildLoading::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.ShowContentLoading
// 0x0009 (0x0009 - 0x0000)
struct WBP_G_GodBuilderViewer_C_ShowContentLoading final
{
public:
	bool                                          bShouldShow;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_ShowContentLoading) == 0x000001, "Wrong alignment on WBP_G_GodBuilderViewer_C_ShowContentLoading");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_ShowContentLoading) == 0x000009, "Wrong size on WBP_G_GodBuilderViewer_C_ShowContentLoading");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, bShouldShow) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::bShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, Temp_bool_Variable) == 0x000003, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, K2Node_Select_Default) == 0x000007, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_ShowContentLoading, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_G_GodBuilderViewer_C_ShowContentLoading::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.UpdatePinButton
// 0x04C0 (0x04C0 - 0x0000)
struct WBP_G_GodBuilderViewer_C_UpdatePinButton final
{
public:
	struct FHWGodBuild                            GodBuild;                                          // 0x0000(0x0190)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UHWLocalPlayerLoadoutSubsystem*         CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHWInventoryItem>        CallFunc_GetSoftInventoryItemFromItemId_ReturnValue; // 0x0198(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWInventoryItem*                       K2Node_DynamicCast_AsHWInventory_Item;             // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWCharacterItem*                 K2Node_DynamicCast_AsHWCharacter_Item;             // 0x01E0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWGodLoadout                          CallFunc_GetGodLoadout_OutLoadout;                 // 0x01F0(0x0128)()
	bool                                          CallFunc_GetGodLoadout_ReturnValue;                // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWGodBuilderSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWGodBuild                            CallFunc_GetCachedPrimaryBuild_OutGodBuild;        // 0x0328(0x0190)()
	bool                                          CallFunc_GetCachedPrimaryBuild_ReturnValue;        // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GuidGuid_ReturnValue;            // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWCachedBuildType                            CallFunc_GetCachedBuildType_ReturnValue;           // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x04BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_UpdatePinButton) == 0x000008, "Wrong alignment on WBP_G_GodBuilderViewer_C_UpdatePinButton");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_UpdatePinButton) == 0x0004C0, "Wrong size on WBP_G_GodBuilderViewer_C_UpdatePinButton");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, GodBuild) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::GodBuild' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000190, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_GetSoftInventoryItemFromItemId_ReturnValue) == 0x000198, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_GetSoftInventoryItemFromItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x0001C0, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0001C8, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, K2Node_DynamicCast_AsHWInventory_Item) == 0x0001D0, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::K2Node_DynamicCast_AsHWInventory_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, K2Node_DynamicCast_AsHWCharacter_Item) == 0x0001E0, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::K2Node_DynamicCast_AsHWCharacter_Item' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_GetGodLoadout_OutLoadout) == 0x0001F0, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_GetGodLoadout_OutLoadout' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_GetGodLoadout_ReturnValue) == 0x000318, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_GetGodLoadout_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000320, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_GetCachedPrimaryBuild_OutGodBuild) == 0x000328, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_GetCachedPrimaryBuild_OutGodBuild' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_GetCachedPrimaryBuild_ReturnValue) == 0x0004B8, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_GetCachedPrimaryBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_NotEqual_GuidGuid_ReturnValue) == 0x0004B9, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_NotEqual_GuidGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_GetCachedBuildType_ReturnValue) == 0x0004BA, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_GetCachedBuildType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0004BB, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_Not_PreBool_ReturnValue) == 0x0004BC, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButton, CallFunc_BooleanAND_ReturnValue) == 0x0004BD, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.UpdatePinButtonState
// 0x0002 (0x0002 - 0x0000)
struct WBP_G_GodBuilderViewer_C_UpdatePinButtonState final
{
public:
	bool                                          Pinned;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unavailable;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_UpdatePinButtonState) == 0x000001, "Wrong alignment on WBP_G_GodBuilderViewer_C_UpdatePinButtonState");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_UpdatePinButtonState) == 0x000002, "Wrong size on WBP_G_GodBuilderViewer_C_UpdatePinButtonState");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButtonState, Pinned) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButtonState::Pinned' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_UpdatePinButtonState, Unavailable) == 0x000001, "Member 'WBP_G_GodBuilderViewer_C_UpdatePinButtonState::Unavailable' has a wrong offset!");

// Function WBP_G_GodBuilderViewer.WBP_G_GodBuilderViewer_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget, CallFunc_GetNumItems_ReturnValue) == 0x000008, "Member 'WBP_G_GodBuilderViewer_C_BP_GetDesiredFocusTarget::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
