#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V1_HUDEditor_EditableEntry

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V1_HUDEditor_EditableEntry.WBP_G_V1_HUDEditor_EditableEntry_C
// 0x0068 (0x06F0 - 0x0688)
class UWBP_G_V1_HUDEditor_EditableEntry_C final : public UHWHUDEditorEditableEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BaseFill;                                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BaseGradient;                                      // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         FieldContainer;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_138;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSlider*                              OpacityBar;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSlider*                              ScaleBar;                                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCheckBox*                            VisibilityCheckBox;                                // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           WidgetNameText;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnIsDirty;                                         // 0x06D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool bIsDragging)> OnIsDragging;                                   // 0x06E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_G_V1_HUDEditor_EditableEntry_OpacityBar_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WBP_G_V1_HUDEditor_EditableEntry_ScaleBar_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WBP_G_V1_HUDEditor_EditableEntry_VisibilityCheckBox_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void CustomModifierFieldAdded(class UHWHUDEditorEditableEntryCustomField* AddedCustomField);
	void CustomModifierFieldRemoved(class UHWHUDEditorEditableEntryCustomField* RemovedCustomField);
	void DisplayGenericModifierData(const struct FHWUIStyleLocalGenericModifier& GenericModifier);
	void DisplayLocalModifier(const struct FHWUIStyleLocalModifier& LocalModifier);
	void EntrySelectedStateChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_G_V1_HUDEditor_EditableEntry(int32 EntryPoint);
	void HandleIsDragging(class UHWDragArea* DragArea, bool bNewIsDragging);
	class UWidget* HandleOpacityNavigation(EUINavigation Navigation_0);
	class UWidget* HandleScaleNavigation(EUINavigation Navigation_0);
	void HandleSliderNavigation(bool bIsIncrement, class UHWSlider* Slider);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetHighilightState(bool bShouldHighlight);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V1_HUDEditor_EditableEntry_C">();
	}
	static class UWBP_G_V1_HUDEditor_EditableEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V1_HUDEditor_EditableEntry_C>();
	}
};
static_assert(alignof(UWBP_G_V1_HUDEditor_EditableEntry_C) == 0x000008, "Wrong alignment on UWBP_G_V1_HUDEditor_EditableEntry_C");
static_assert(sizeof(UWBP_G_V1_HUDEditor_EditableEntry_C) == 0x0006F0, "Wrong size on UWBP_G_V1_HUDEditor_EditableEntry_C");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, UberGraphFrame) == 0x000688, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, BaseFill) == 0x000690, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::BaseFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, BaseGradient) == 0x000698, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::BaseGradient' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, FieldContainer) == 0x0006A0, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::FieldContainer' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, HWImage_138) == 0x0006A8, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::HWImage_138' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, OpacityBar) == 0x0006B0, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::OpacityBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, ScaleBar) == 0x0006B8, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::ScaleBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, VisibilityCheckBox) == 0x0006C0, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::VisibilityCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, WidgetNameText) == 0x0006C8, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::WidgetNameText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, OnIsDirty) == 0x0006D0, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::OnIsDirty' has a wrong offset!");
static_assert(offsetof(UWBP_G_V1_HUDEditor_EditableEntry_C, OnIsDragging) == 0x0006E0, "Member 'UWBP_G_V1_HUDEditor_EditableEntry_C::OnIsDragging' has a wrong offset!");

}

