#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_GodBuilderInfoCategory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_GodBuilderInfoCategory.WBP_G_GodBuilderInfoCategory_C
// 0x0020 (0x0618 - 0x05F8)
class UWBP_G_GodBuilderInfoCategory_C final : public UHWItemStoreGodBuilderInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           DescriptionText;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_132;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           TitleText;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void DisplayGodBuildInfo(const struct FHWGodBuild& GodBuild);
	void ExecuteUbergraph_WBP_G_GodBuilderInfoCategory(int32 EntryPoint);
	void UpdateInfo(const struct FHWGodBuild& GodBuild);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_GodBuilderInfoCategory_C">();
	}
	static class UWBP_G_GodBuilderInfoCategory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_GodBuilderInfoCategory_C>();
	}
};
static_assert(alignof(UWBP_G_GodBuilderInfoCategory_C) == 0x000008, "Wrong alignment on UWBP_G_GodBuilderInfoCategory_C");
static_assert(sizeof(UWBP_G_GodBuilderInfoCategory_C) == 0x000618, "Wrong size on UWBP_G_GodBuilderInfoCategory_C");
static_assert(offsetof(UWBP_G_GodBuilderInfoCategory_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_GodBuilderInfoCategory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderInfoCategory_C, DescriptionText) == 0x000600, "Member 'UWBP_G_GodBuilderInfoCategory_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderInfoCategory_C, HWImage_132) == 0x000608, "Member 'UWBP_G_GodBuilderInfoCategory_C::HWImage_132' has a wrong offset!");
static_assert(offsetof(UWBP_G_GodBuilderInfoCategory_C, TitleText) == 0x000610, "Member 'UWBP_G_GodBuilderInfoCategory_C::TitleText' has a wrong offset!");

}

