#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ObjectiveHealthbar_Generic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_ObjectiveHealthbar_Generic.WBP_G_V2_ObjectiveHealthbar_Generic_C
// 0x0078 (0x06B0 - 0x0638)
class UWBP_G_V2_ObjectiveHealthbar_Generic_C final : public UHWObjectiveHealthbarWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_G_V2_ObjectiveHealthbar_Health_C*  HealthBar;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GS_V1_GANumberListener_C*          HealthListener;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              HealthSegments;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HealthText;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ObjectiveName;                                     // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Pip1;                                              // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Pip1_Wrap;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Pip2;                                              // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Pip2_Wrap;                                         // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Pip3;                                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Pip3_Wrap;                                         // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             TEMPPrototypeTowerStuff;                           // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         MaxHealth;                                         // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HealthThresholdMaxIndex;                           // 0x06A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Tower_C*                        AssociatedTower;                                   // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_Generic(int32 EntryPoint);
	void HandleTowerDestructionEvent(int32 Stage);
	void OnDestructionStageReached(int32 Stage, bool FinalStage);
	void OnHide();
	void OnShown();
	void OnTowerCanNoLongerSpawnFinalReward();
	void SetCharacterDisplay(const class AHWCharacter_Base* Character, const class UHWCharacterItem* CharacterItem);
	void SetFinalPipVisibility(class ABP_NPC_Tower_C* Tower);
	void SetHealthSegmentsBrush(int32 Index_0);
	void SetPipVisibility();
	void SetPipWrapperVisibility(int32 LastIndex, class AHWCharacter_Base* Tower);
	void ShowOrHidePrototypeStuff(class AHWCharacter_Base* Character);

	TArray<class UHWGameplayAttributeWidget*> GetAttributeWidgets() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_ObjectiveHealthbar_Generic_C">();
	}
	static class UWBP_G_V2_ObjectiveHealthbar_Generic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_ObjectiveHealthbar_Generic_C>();
	}
};
static_assert(alignof(UWBP_G_V2_ObjectiveHealthbar_Generic_C) == 0x000008, "Wrong alignment on UWBP_G_V2_ObjectiveHealthbar_Generic_C");
static_assert(sizeof(UWBP_G_V2_ObjectiveHealthbar_Generic_C) == 0x0006B0, "Wrong size on UWBP_G_V2_ObjectiveHealthbar_Generic_C");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, UberGraphFrame) == 0x000638, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, HealthBar) == 0x000640, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::HealthBar' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, HealthListener) == 0x000648, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::HealthListener' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, HealthSegments) == 0x000650, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::HealthSegments' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, HealthText) == 0x000658, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::HealthText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, ObjectiveName) == 0x000660, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::ObjectiveName' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, Pip1) == 0x000668, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::Pip1' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, Pip1_Wrap) == 0x000670, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::Pip1_Wrap' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, Pip2) == 0x000678, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::Pip2' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, Pip2_Wrap) == 0x000680, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::Pip2_Wrap' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, Pip3) == 0x000688, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::Pip3' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, Pip3_Wrap) == 0x000690, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::Pip3_Wrap' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, TEMPPrototypeTowerStuff) == 0x000698, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::TEMPPrototypeTowerStuff' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, MaxHealth) == 0x0006A0, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::MaxHealth' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, HealthThresholdMaxIndex) == 0x0006A4, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::HealthThresholdMaxIndex' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_ObjectiveHealthbar_Generic_C, AssociatedTower) == 0x0006A8, "Member 'UWBP_G_V2_ObjectiveHealthbar_Generic_C::AssociatedTower' has a wrong offset!");

}

