#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GlobalEmoteEquipWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GlobalEmoteEquipWidget.WBP_C_GlobalEmoteEquipWidget_C
// 0x0048 (0x0688 - 0x0640)
class UWBP_C_GlobalEmoteEquipWidget_C final : public UHWGlobalEmoteEquipWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              BlockerButton;                                     // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          CurrentEquippingItemImage;                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CurrentEquippingItemText;                          // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               EquippingBG;                                       // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           EquippingHeaderText;                               // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Shadow;                                            // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWListView*                            SlotList;                                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           UnlockMoreText;                                    // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_GlobalEmoteEquipWidget_HWButton_51_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GlobalEmoteEquipWidget_SlotList_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WBP_C_GlobalEmoteEquipWidget_SlotList_K2Node_ComponentBoundEvent_3_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void ExecuteUbergraph_WBP_C_GlobalEmoteEquipWidget(int32 EntryPoint);
	void OnHide();
	void OnShown();
	void Populate(const TArray<class UHWGlobalEmoteSlotData*>& ListData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GlobalEmoteEquipWidget_C">();
	}
	static class UWBP_C_GlobalEmoteEquipWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GlobalEmoteEquipWidget_C>();
	}
};
static_assert(alignof(UWBP_C_GlobalEmoteEquipWidget_C) == 0x000008, "Wrong alignment on UWBP_C_GlobalEmoteEquipWidget_C");
static_assert(sizeof(UWBP_C_GlobalEmoteEquipWidget_C) == 0x000688, "Wrong size on UWBP_C_GlobalEmoteEquipWidget_C");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, UberGraphFrame) == 0x000640, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, BlockerButton) == 0x000648, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::BlockerButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, CurrentEquippingItemImage) == 0x000650, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::CurrentEquippingItemImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, CurrentEquippingItemText) == 0x000658, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::CurrentEquippingItemText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, EquippingBG) == 0x000660, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::EquippingBG' has a wrong offset!");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, EquippingHeaderText) == 0x000668, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::EquippingHeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, Shadow) == 0x000670, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, SlotList) == 0x000678, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::SlotList' has a wrong offset!");
static_assert(offsetof(UWBP_C_GlobalEmoteEquipWidget_C, UnlockMoreText) == 0x000680, "Member 'UWBP_C_GlobalEmoteEquipWidget_C::UnlockMoreText' has a wrong offset!");

}

