#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PercentageTag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PercentageTag.WBP_S_PercentageTag_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PercentageTag_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PercentageTag_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_PercentageTag_C_PreConstruct");
static_assert(sizeof(WBP_S_PercentageTag_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_PercentageTag_C_PreConstruct");
static_assert(offsetof(WBP_S_PercentageTag_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_PercentageTag_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_PercentageTag.WBP_S_PercentageTag_C.ExecuteUbergraph_WBP_S_PercentageTag
// 0x0080 (0x0080 - 0x0000)
struct WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_1;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          K2Node_Select_Default;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default_2;                           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag) == 0x000008, "Wrong alignment on WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag");
static_assert(sizeof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag) == 0x000080, "Wrong size on WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, EntryPoint) == 0x000000, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, Temp_bool_Variable) == 0x000004, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, Temp_struct_Variable) == 0x000008, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, Temp_bool_Variable_1) == 0x000028, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, Temp_bool_Variable_2) == 0x000029, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, Temp_byte_Variable) == 0x00002A, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, Temp_byte_Variable_1) == 0x00002B, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, K2Node_Select_Default) == 0x00002D, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000030, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, K2Node_Select_Default_1) == 0x000038, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, K2Node_MakeStruct_Margin) == 0x000048, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, K2Node_MakeStruct_Margin_1) == 0x000058, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, K2Node_Select_Default_2) == 0x000068, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000078, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x00007C, "Member 'WBP_S_PercentageTag_C_ExecuteUbergraph_WBP_S_PercentageTag::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");

// Function WBP_S_PercentageTag.WBP_S_PercentageTag_C.DisplayDiscountPercentage
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_S_PercentageTag_C_DisplayDiscountPercentage final
{
public:
	int32                                         Discount;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PercentageTag_C_DisplayDiscountPercentage) == 0x000008, "Wrong alignment on WBP_S_PercentageTag_C_DisplayDiscountPercentage");
static_assert(sizeof(WBP_S_PercentageTag_C_DisplayDiscountPercentage) == 0x0000A0, "Wrong size on WBP_S_PercentageTag_C_DisplayDiscountPercentage");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, Discount) == 0x000000, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::Discount' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, Temp_bool_Variable) == 0x000004, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, K2Node_MakeArray_Array) == 0x000068, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, Temp_byte_Variable) == 0x000078, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, Temp_byte_Variable_1) == 0x000098, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PercentageTag_C_DisplayDiscountPercentage, K2Node_Select_Default) == 0x000099, "Member 'WBP_S_PercentageTag_C_DisplayDiscountPercentage::K2Node_Select_Default' has a wrong offset!");

}

