#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_CustomLobby_Title

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_CustomLobby_Title.WBP_C_CustomLobby_Title_C
// 0x0080 (0x0678 - 0x05F8)
class UWBP_C_CustomLobby_Title_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         CharCountGroup;                                    // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CharLimit;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           CurrentCharCount;                                  // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Divider;                                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GenericButton_C*                 EditButton2;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      EditSwitcher;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           GamepadRenamePromptText;                           // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RenamePrompt;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWEditableTextBox*                     TextInput;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      TextSwitcher;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           Title;                                             // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsInEditMode;                                     // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FText NewTitle)> OnFinishEditingLobbyTitle;                  // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEditingEnabled;                                   // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_CustomLobby_Title_EditButton2_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(class UWidget* Widget);
	void BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__WBP_C_CustomLobby_Title_TextInput_K2Node_ComponentBoundEvent_2_OnCharacterCountChanged__DelegateSignature(int32 NewCharacterCount, int32 CharacterLimit);
	void ExecuteUbergraph_WBP_C_CustomLobby_Title(int32 EntryPoint);
	void HandleInputStateChanged(ERH_INPUT_STATE InputState);
	void InitializeWidget();
	bool NavigateConfirm();
	void SetEditingEnabled(bool bEnabled_0);
	void SetEditMode(bool bEditMode);
	void SetLobbyName(const class FText& InLobbyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_CustomLobby_Title_C">();
	}
	static class UWBP_C_CustomLobby_Title_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_CustomLobby_Title_C>();
	}
};
static_assert(alignof(UWBP_C_CustomLobby_Title_C) == 0x000008, "Wrong alignment on UWBP_C_CustomLobby_Title_C");
static_assert(sizeof(UWBP_C_CustomLobby_Title_C) == 0x000678, "Wrong size on UWBP_C_CustomLobby_Title_C");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_CustomLobby_Title_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, CharCountGroup) == 0x000600, "Member 'UWBP_C_CustomLobby_Title_C::CharCountGroup' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, CharLimit) == 0x000608, "Member 'UWBP_C_CustomLobby_Title_C::CharLimit' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, CurrentCharCount) == 0x000610, "Member 'UWBP_C_CustomLobby_Title_C::CurrentCharCount' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, Divider) == 0x000618, "Member 'UWBP_C_CustomLobby_Title_C::Divider' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, EditButton2) == 0x000620, "Member 'UWBP_C_CustomLobby_Title_C::EditButton2' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, EditSwitcher) == 0x000628, "Member 'UWBP_C_CustomLobby_Title_C::EditSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, GamepadRenamePromptText) == 0x000630, "Member 'UWBP_C_CustomLobby_Title_C::GamepadRenamePromptText' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, RenamePrompt) == 0x000638, "Member 'UWBP_C_CustomLobby_Title_C::RenamePrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, TextInput) == 0x000640, "Member 'UWBP_C_CustomLobby_Title_C::TextInput' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, TextSwitcher) == 0x000648, "Member 'UWBP_C_CustomLobby_Title_C::TextSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, Title) == 0x000650, "Member 'UWBP_C_CustomLobby_Title_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, bIsInEditMode) == 0x000658, "Member 'UWBP_C_CustomLobby_Title_C::bIsInEditMode' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, OnFinishEditingLobbyTitle) == 0x000660, "Member 'UWBP_C_CustomLobby_Title_C::OnFinishEditingLobbyTitle' has a wrong offset!");
static_assert(offsetof(UWBP_C_CustomLobby_Title_C, bEditingEnabled) == 0x000670, "Member 'UWBP_C_CustomLobby_Title_C::bEditingEnabled' has a wrong offset!");

}

