#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodAbilityDisplay_ExtraAbility

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature
// 0x0700 (0x0700 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature final
{
public:
	struct FActiveGameplayEffect                  ActiveEffect;                                      // 0x0000(0x0400)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHWTrackedEffectData                   EffectData;                                        // 0x0400(0x0300)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature) == 0x000700, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature, ActiveEffect) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature::ActiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature, EffectData) == 0x000400, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_2_OnEffectTrackStarted__DelegateSignature::EffectData' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature
// 0x0700 (0x0700 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature final
{
public:
	struct FActiveGameplayEffect                  ActiveEffect;                                      // 0x0000(0x0400)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FHWTrackedEffectData                   EffectData;                                        // 0x0400(0x0300)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature) == 0x000700, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature, ActiveEffect) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature::ActiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature, EffectData) == 0x000400, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BndEvt__WBP_G_V2_GodIItemDisplayEntry_Utility_CooldownWidget_K2Node_ComponentBoundEvent_3_OnEffectTrackEnded__DelegateSignature::EffectData' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.Check Item Utility Fire
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire final
{
public:
	ETriggerEvent                                 KeyTriggerEvent;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetEquipmentLevel_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivateEquipmentAtLevel_ReturnValue;  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRefireTimeRemaining_ReturnValue;       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckAbilityCost_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetCurrentBlockedReason_ReturnValue;      // 0x0014(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCooldownActive_ReturnValue;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire) == 0x000028, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, KeyTriggerEvent) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::KeyTriggerEvent' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_GetEquipmentLevel_ReturnValue) == 0x000004, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_GetEquipmentLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_CanActivateEquipmentAtLevel_ReturnValue) == 0x000009, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_CanActivateEquipmentAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_GetRefireTimeRemaining_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_GetRefireTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_CheckAbilityCost_ReturnValue) == 0x000011, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_CheckAbilityCost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_GetCurrentBlockedReason_ReturnValue) == 0x000014, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_GetCurrentBlockedReason_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_IsCooldownActive_ReturnValue) == 0x00001D, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_IsCooldownActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000020, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Check_Item_Utility_Fire::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.DisplayAbilityPhase_Aiming
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Aiming final
{
public:
	EHWUIAbilityFlowPhase                         PreviousPhase;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Aiming) == 0x000001, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Aiming");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Aiming) == 0x000001, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Aiming");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Aiming, PreviousPhase) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Aiming::PreviousPhase' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.DisplayAbilityPhase_Fired
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Fired final
{
public:
	EHWUIAbilityFlowPhase                         PreviousPhase;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Fired) == 0x000001, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Fired");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Fired) == 0x000001, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Fired");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Fired, PreviousPhase) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Fired::PreviousPhase' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.DisplayAbilityPhase_Inactive
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Inactive final
{
public:
	EHWUIAbilityFlowPhase                         PreviousPhase;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Inactive) == 0x000001, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Inactive");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Inactive) == 0x000001, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Inactive");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Inactive, PreviousPhase) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_Inactive::PreviousPhase' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.DisplayAbilityPhase_PreFire
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_PreFire final
{
public:
	EHWUIAbilityFlowPhase                         PreviousPhase;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_PreFire) == 0x000001, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_PreFire");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_PreFire) == 0x000001, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_PreFire");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_PreFire, PreviousPhase) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayAbilityPhase_PreFire::PreviousPhase' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.DisplayEquipment
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment final
{
public:
	const class UHWEquipmentItem*                 EquipmentInfo;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment) == 0x000010, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment, EquipmentInfo) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment::EquipmentInfo' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.DisplayInputTag
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayInputTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayInputTag) == 0x000004, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayInputTag");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayInputTag) == 0x000008, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayInputTag");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayInputTag, Tag) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_DisplayInputTag::Tag' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility
// 0x0E10 (0x0E10 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffect                  K2Node_ComponentBoundEvent_ActiveEffect_1;         // 0x0008(0x0400)(ConstParm)
	struct FHWTrackedEffectData                   K2Node_ComponentBoundEvent_EffectData_1;           // 0x0408(0x0300)(ConstParm)
	struct FActiveGameplayEffect                  K2Node_ComponentBoundEvent_ActiveEffect;           // 0x0708(0x0400)(ConstParm)
	struct FHWTrackedEffectData                   K2Node_ComponentBoundEvent_EffectData;             // 0x0B08(0x0300)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0E08(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility) == 0x000E10, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility, K2Node_ComponentBoundEvent_ActiveEffect_1) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility::K2Node_ComponentBoundEvent_ActiveEffect_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility, K2Node_ComponentBoundEvent_EffectData_1) == 0x000408, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility::K2Node_ComponentBoundEvent_EffectData_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility, K2Node_ComponentBoundEvent_ActiveEffect) == 0x000708, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility::K2Node_ComponentBoundEvent_ActiveEffect' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility, K2Node_ComponentBoundEvent_EffectData) == 0x000B08, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility::K2Node_ComponentBoundEvent_EffectData' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility, CallFunc_PlayAnimationForward_ReturnValue) == 0x000E08, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_ExecuteUbergraph_WBP_G_V2_GodAbilityDisplay_ExtraAbility::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.InitializeWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget final
{
public:
	TDelegate<void(ETriggerEvent KeyTriggerEvent)> K2Node_CreateDelegate_OutputDelegate;             // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget) == 0x000018, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_InitializeWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.PlayPhaseAnimation
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation final
{
public:
	EHWUIAbilityFlowPhase                         PreviousPhase;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                PhaseWidget;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PhaseAnim;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bLoopAnimation;                                    // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation) == 0x000030, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation, PreviousPhase) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation::PreviousPhase' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation, PhaseWidget) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation::PhaseWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation, PhaseAnim) == 0x000010, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation::PhaseAnim' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation, bLoopAnimation) == 0x000018, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation::bLoopAnimation' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation, CallFunc_SelectInt_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_PlayPhaseAnimation::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.StopPhaseAnimation
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation final
{
public:
	EHWUIAbilityFlowPhase                         PhaseAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation) == 0x000010, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation, PhaseAnimation) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation::PhaseAnimation' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_StopPhaseAnimation::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.Update Grayscale
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCooldownActive_ReturnValue;             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale) == 0x000018, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, Temp_byte_Variable) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, Temp_byte_Variable_1) == 0x000001, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, Temp_bool_Variable) == 0x000002, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, Temp_bool_Variable_1) == 0x000005, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, CallFunc_IsCooldownActive_ReturnValue) == 0x000006, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::CallFunc_IsCooldownActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, CallFunc_SelectFloat_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, K2Node_Select_Default) == 0x000010, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, K2Node_Select_Default_1) == 0x000011, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000014, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_Update_Grayscale::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_GodAbilityDisplay_ExtraAbility.WBP_G_V2_GodAbilityDisplay_ExtraAbility_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodAbilityDisplay_ExtraAbility_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

