#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget.WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C
// 0x0070 (0x0690 - 0x0620)
class UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C final : public UHWEquipmentAcquisitionPopupWidget
{
public:
	class UHWImage*                               AbilityIcon;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             AbilityIcon_SizeBox;                               // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             AbilityInfo_SizeBox;                               // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         AbilityInfo_VerticalBox;                           // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           AcquisitionActionTextfield;                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWVerticalBox*                         Content_VerticalBox;                               // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Decoration_Overlay;                                // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           EquipmentNameTextfield;                            // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               LeftSection_BGFill;                                // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             MainBG_Overlay;                                    // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             MiniKScreenCallout_Overlay;                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWRichTextBlock*                       RichText;                                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             TopSection_Overlay;                                // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWEquipmentItem*                       EquipmentItem;                                     // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DisplayEquipment(const class UHWEquipmentInstance* EquipmentInstance);
	void HandleDisplayTimerFired();
	void UpdateLayout();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C">();
	}
	static class UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C>();
	}
};
static_assert(alignof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C) == 0x000008, "Wrong alignment on UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C");
static_assert(sizeof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C) == 0x000690, "Wrong size on UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, AbilityIcon) == 0x000620, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::AbilityIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, AbilityIcon_SizeBox) == 0x000628, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::AbilityIcon_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, AbilityInfo_SizeBox) == 0x000630, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::AbilityInfo_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, AbilityInfo_VerticalBox) == 0x000638, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::AbilityInfo_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, AcquisitionActionTextfield) == 0x000640, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::AcquisitionActionTextfield' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, Content_VerticalBox) == 0x000648, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::Content_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, Decoration_Overlay) == 0x000650, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::Decoration_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, EquipmentNameTextfield) == 0x000658, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::EquipmentNameTextfield' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, LeftSection_BGFill) == 0x000660, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::LeftSection_BGFill' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, MainBG_Overlay) == 0x000668, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::MainBG_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, MiniKScreenCallout_Overlay) == 0x000670, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::MiniKScreenCallout_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, RichText) == 0x000678, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::RichText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, TopSection_Overlay) == 0x000680, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::TopSection_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C, EquipmentItem) == 0x000688, "Member 'UWBP_G_V2_EquipmentAbilityAcquisitionPopupWidget_C::EquipmentItem' has a wrong offset!");

}

