#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_ItemsList_ItemEntry

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.DisplayEquipment
// 0x0088 (0x0088 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment final
{
public:
	const class UHWEquipmentItem*                 EquipmentInfo;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Temp_softobject_Variable;                          // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Select_Default_1;                           // 0x0048(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment) == 0x000088, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, EquipmentInfo) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::EquipmentInfo' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, Temp_byte_Variable) == 0x000008, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, Temp_byte_Variable_1) == 0x000009, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, Temp_bool_Variable) == 0x00000A, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, Temp_softobject_Variable) == 0x000010, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::Temp_softobject_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, Temp_bool_Variable_1) == 0x000038, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, CallFunc_HasTag_ReturnValue) == 0x000039, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, K2Node_Select_Default) == 0x00003A, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, CallFunc_IsValid_ReturnValue) == 0x00003B, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, K2Node_Select_Default_1) == 0x000048, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000070, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, K2Node_DynamicCast_AsTexture_2D) == 0x000078, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayEquipment::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.DisplayGold
// 0x0050 (0x0050 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold final
{
public:
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrice_ReturnValue;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0030(0x0018)()
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold) == 0x000050, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, Temp_struct_Variable) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, Temp_struct_Variable_1) == 0x000008, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, CallFunc_CanPurchase_ReturnValue) == 0x000010, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, Temp_bool_Variable) == 0x000020, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, K2Node_Select_Default) == 0x000024, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, CallFunc_GetPrice_ReturnValue) == 0x00002C, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::CallFunc_GetPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, CallFunc_Conv_IntToText_ReturnValue) == 0x000030, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000048, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayGold::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.DisplayIsSelected
// 0x000C (0x000C - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected final
{
public:
	int32                                         CallFunc_GetCurrentGold_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPrice_ReturnValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected) == 0x00000C, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected, CallFunc_GetCurrentGold_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected::CallFunc_GetCurrentGold_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected, CallFunc_GetPrice_ReturnValue) == 0x000004, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected::CallFunc_GetPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayIsSelected::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.DisplayOwnership
// 0x0002 (0x0002 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership final
{
public:
	bool                                          IsOwned;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnique;                                          // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership) == 0x000002, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership, IsOwned) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership::IsOwned' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership, IsUnique) == 0x000001, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DisplayOwnership::IsUnique' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.DoHover
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover final
{
public:
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover) == 0x000010, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover, CallFunc_CanPurchase_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoHover::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.DoUnhover
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover final
{
public:
	bool                                          CallFunc_CanPurchase_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover) == 0x000010, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover, CallFunc_CanPurchase_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover::CallFunc_CanPurchase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_DoUnhover::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry
// 0x0004 (0x0004 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry) == 0x000004, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry) == 0x000004, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_ItemEntry::EntryPoint' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.InOverState
// 0x0003 (0x0003 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState final
{
public:
	bool                                          bInOverState;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState) == 0x000003, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState, bInOverState) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState::bInOverState' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState, CallFunc_IsSelected_ReturnValue) == 0x000001, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_InOverState::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.OnDoubleClicked
// 0x0003 (0x0003 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked final
{
public:
	bool                                          CallFunc_GetIsUnique_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsOwned_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked) == 0x000003, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked, CallFunc_GetIsUnique_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked::CallFunc_GetIsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked, CallFunc_GetIsOwned_ReturnValue) == 0x000001, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked::CallFunc_GetIsOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_OnDoubleClicked::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.SetStrokeAndOpacity
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity final
{
public:
	bool                                          GoldStatus;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_10;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_2;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARHHUDCommon*                           CallFunc_GetLocalHUDAsRHCommon_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0064(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected_ReturnValue;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InOverState_bInOverState;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default_4;                           // 0x009C(0x0008)(NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_9;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_10;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_4;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity");
static_assert(sizeof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity) == 0x0000C0, "Wrong size on WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, GoldStatus) == 0x000000, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::GoldStatus' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_struct_Variable) == 0x000004, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable) == 0x00000C, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable) == 0x00000D, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_1) == 0x00000E, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_2) == 0x00000F, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_3) == 0x000010, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_4) == 0x000011, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_1) == 0x000012, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_5) == 0x000013, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_6) == 0x000014, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_2) == 0x000015, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_7) == 0x000016, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_8) == 0x000017, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_3) == 0x000018, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_9) == 0x000019, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_10) == 0x00001A, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_11) == 0x00001B, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_12) == 0x00001C, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_13) == 0x00001D, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_4) == 0x00001E, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_14) == 0x00001F, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_byte_Variable_15) == 0x000020, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_5) == 0x000021, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_real_Variable) == 0x000024, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_real_Variable_1) == 0x000028, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_6) == 0x00002C, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_real_Variable_2) == 0x000030, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_GetLocalHUDAsRHCommon_ReturnValue) == 0x000038, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_GetLocalHUDAsRHCommon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_GetCurrentInputState_ReturnValue) == 0x000041, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_SwitchEnum_CmpSuccess) == 0x000042, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_struct_Variable_1) == 0x000044, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_7) == 0x00004C, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_struct_Variable_2) == 0x000050, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_struct_Variable_3) == 0x000058, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, Temp_bool_Variable_8) == 0x000060, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default) == 0x000064, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_1) == 0x00006C, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_IsSelected_ReturnValue) == 0x00006D, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_IsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_SelectFloat_ReturnValue) == 0x000070, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_SelectFloat_ReturnValue_1) == 0x000078, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_2) == 0x000080, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_SelectFloat_ReturnValue_2) == 0x000088, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_SelectFloat_ReturnValue_3) == 0x000090, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_3) == 0x000098, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_InOverState_bInOverState) == 0x000099, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_InOverState_bInOverState' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_4) == 0x00009C, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_5) == 0x0000A4, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_6) == 0x0000A5, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_7) == 0x0000A6, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_8) == 0x0000A7, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_9) == 0x0000A8, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, K2Node_Select_Default_10) == 0x0000AC, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_SelectFloat_ReturnValue_4) == 0x0000B0, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_SelectFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0000B8, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1) == 0x0000BC, "Member 'WBP_S_GodBuilder_ItemsList_ItemEntry_C_SetStrokeAndOpacity::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast_1' has a wrong offset!");

// Function WBP_S_GodBuilder_ItemsList_ItemEntry.WBP_S_GodBuilder_ItemsList_ItemEntry_C.UpdateDetailLevel
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_S_GodBuilder_ItemsList_ItemEntry_C_UpdateDetailLevel final
{
public:
	EHWItemStoreGridDetailLevel                   DetailLevel;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_4;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_4;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_8;                              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_9;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_5;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_10;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_11;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_12;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_6;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_13;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_14;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_15;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_7;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_8;                              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_9;                              // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_10;                             // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_11;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_16;                             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_17;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Temp_byte_Variable_12;                             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_18;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_19;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_20;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_21;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_13;                             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_14;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_22;                             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_23;                             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_24;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_15;                             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable_25;                             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_26;                             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_27;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_16;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_17;                             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_18;                             // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable_19;                             // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Temp_byte_Variable_20;                             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
