#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_Scoreboard_Team

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.ExecuteUbergraph_WBP_G_V2_Scoreboard_Team
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWScoreboardPlayerWidget*              CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team) == 0x000028, "Wrong size on WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team, EntryPoint) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team, Temp_int_Variable) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000020, "Member 'WBP_G_V2_Scoreboard_Team_C_ExecuteUbergraph_WBP_G_V2_Scoreboard_Team::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_Scoreboard_Team_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.UpdatedFireGiantKills
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills final
{
public:
	int32                                         FireGiantKills;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills, FireGiantKills) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills::FireGiantKills' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedFireGiantKills::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.UpdatedGoldFuryKills
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_UpdatedGoldFuryKills final
{
public:
	int32                                         GoldFuryKills;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_UpdatedGoldFuryKills) == 0x000004, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_UpdatedGoldFuryKills");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_UpdatedGoldFuryKills) == 0x000004, "Wrong size on WBP_G_V2_Scoreboard_Team_C_UpdatedGoldFuryKills");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedGoldFuryKills, GoldFuryKills) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedGoldFuryKills::GoldFuryKills' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.UpdatedTotalAssists
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists final
{
public:
	int32                                         TotalAssists;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists, TotalAssists) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists::TotalAssists' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTotalAssists::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.UpdatedTotalDeaths
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths final
{
public:
	int32                                         TotalDeaths;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths, TotalDeaths) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths::TotalDeaths' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTotalDeaths::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.UpdatedTotalGold
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold final
{
public:
	int32                                         TeamGoldEarned;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold, TeamGoldEarned) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold::TeamGoldEarned' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTotalGold::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.UpdatedTotalKills
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills final
{
public:
	int32                                         TotalKills;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills) == 0x000020, "Wrong size on WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills, TotalKills) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills::TotalKills' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTotalKills::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.UpdatedTrackedTeam
// 0x0110 (0x0110 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam final
{
public:
	class AHWTeamState*                           NewTeamState;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHWSmiteTeamId                                Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0024(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_4;                            // 0x002C(0x0008)(NoDestructor, HasGetValueTypeHash)
	EHWSmiteTeamId                                Temp_byte_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0098(0x0018)()
	ETeamAttitude                                 Temp_byte_Variable_2;                              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_5;                            // 0x00B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_6;                            // 0x00BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_7;                            // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameHUD*                             CallFunc_GetLocalHUDAsGame_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHWTeamState*                           CallFunc_GetTrackedTeam_ReturnValue;               // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHWSmiteTeamId                                CallFunc_GetActorGameTeam_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGenericTeamId                         CallFunc_GetGenericTeamId_ReturnValue;             // 0x00E1(0x0001)(NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetLocalAttitudeTowardsTeamId_ReturnValue; // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3[0x1];                                       // 0x00E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x00E4(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x00EC(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x00F8(0x0018)()
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam) == 0x000110, "Wrong size on WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, NewTeamState) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::NewTeamState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_byte_Variable) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_struct_Variable) == 0x00000C, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_struct_Variable_2) == 0x00001C, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_struct_Variable_3) == 0x000024, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_struct_Variable_4) == 0x00002C, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_byte_Variable_1) == 0x000034, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_text_Variable) == 0x000038, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_text_Variable_1) == 0x000050, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_text_Variable_2) == 0x000068, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_text_Variable_3) == 0x000080, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_text_Variable_4) == 0x000098, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_byte_Variable_2) == 0x0000B0, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_struct_Variable_5) == 0x0000B4, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_struct_Variable_6) == 0x0000BC, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, Temp_struct_Variable_7) == 0x0000C4, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, CallFunc_GetLocalHUDAsGame_ReturnValue) == 0x0000D0, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::CallFunc_GetLocalHUDAsGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, CallFunc_GetTrackedTeam_ReturnValue) == 0x0000D8, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::CallFunc_GetTrackedTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, CallFunc_GetActorGameTeam_ReturnValue) == 0x0000E0, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::CallFunc_GetActorGameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, CallFunc_GetGenericTeamId_ReturnValue) == 0x0000E1, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::CallFunc_GetGenericTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, CallFunc_GetLocalAttitudeTowardsTeamId_ReturnValue) == 0x0000E2, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::CallFunc_GetLocalAttitudeTowardsTeamId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, K2Node_Select_Default) == 0x0000E4, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, K2Node_Select_Default_1) == 0x0000EC, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam, K2Node_Select_Default_2) == 0x0000F8, "Member 'WBP_G_V2_Scoreboard_Team_C_UpdatedTrackedTeam::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_G_V2_Scoreboard_Team.WBP_G_V2_Scoreboard_Team_C.BP_GetDesiredFocusTarget
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_DynamicCast_AsCommon_Activatable_Widget;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget) == 0x000030, "Wrong size on WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget, CallFunc_HasAnyChildren_ReturnValue) == 0x000010, "Member 'WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_AsCommon_Activatable_Widget) == 0x000018, "Member 'WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_AsCommon_Activatable_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000028, "Member 'WBP_G_V2_Scoreboard_Team_C_BP_GetDesiredFocusTarget::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

