#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_player_card_module

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "EPlayerCardStyle_structs.hpp"
#include "ELaterality_structs.hpp"
#include "UMG_structs.hpp"
#include "RallyHereStart_structs.hpp"


namespace SDK::Params
{

// Function WBP_player_card_module.WBP_player_card_module_C.AddShowPlayerCardAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_player_card_module_C_AddShowPlayerCardAnimation final
{
public:
	double                                        Delay;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_AddShowPlayerCardAnimation) == 0x000008, "Wrong alignment on WBP_player_card_module_C_AddShowPlayerCardAnimation");
static_assert(sizeof(WBP_player_card_module_C_AddShowPlayerCardAnimation) == 0x000008, "Wrong size on WBP_player_card_module_C_AddShowPlayerCardAnimation");
static_assert(offsetof(WBP_player_card_module_C_AddShowPlayerCardAnimation, Delay) == 0x000000, "Member 'WBP_player_card_module_C_AddShowPlayerCardAnimation::Delay' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.ExecuteUbergraph_WBP_player_card_module
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELaterality                                   Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELaterality                                   Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewSide                                     Temp_byte_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              Temp_byte_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              Temp_byte_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              Temp_byte_Variable_11;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedAlpha;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Delay;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float ElapsedTime, float ElapsedAlpha)> K2Node_CreateDelegate_OutputDelegate;     // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               K2Node_CustomEvent_InputState;                     // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EViewSide                                     K2Node_Event_Side;                                 // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              K2Node_Select_Default_3;                           // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ERH_INPUT_STATE InputState)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URH_RHFriendAndPlatformFriend*          K2Node_Event_Friend;                               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddTickAnimation_Duration_ImplicitCast;   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module) == 0x000008, "Wrong alignment on WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module");
static_assert(sizeof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module) == 0x0000E8, "Wrong size on WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, EntryPoint) == 0x000000, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable) == 0x000004, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_7) == 0x00000B, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_8) == 0x00000C, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_9) == 0x00000D, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_10) == 0x00000E, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_11) == 0x00000F, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_CustomEvent_ElapsedTime) == 0x000010, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_CustomEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_CustomEvent_ElapsedAlpha) == 0x000014, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_CustomEvent_ElapsedAlpha' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_CustomEvent_Delay) == 0x000018, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_12) == 0x000028, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000029, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_MakeVector2D_ReturnValue) == 0x000078, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_Event_IsDesignTime) == 0x000088, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_byte_Variable_13) == 0x000089, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_SwitchEnum_CmpSuccess) == 0x00008A, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_CustomEvent_InputState) == 0x00008B, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_CustomEvent_InputState' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_GetCurrentInputState_ReturnValue) == 0x00008C, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00008D, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_Select_Default) == 0x000090, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_Select_Default_1) == 0x000098, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_PlayAnimation_ReturnValue) == 0x0000A0, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_Select_Default_2) == 0x0000A8, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_Event_Side) == 0x0000A9, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_Event_Side' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_Select_Default_3) == 0x0000AA, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000AC, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_IsValid_ReturnValue) == 0x0000BC, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_Event_Friend) == 0x0000C0, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_Event_Friend' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C8, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, Temp_bool_Variable) == 0x0000C9, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, K2Node_Select_Default_4) == 0x0000CA, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000D0, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_AddTickAnimation_Duration_ImplicitCast) == 0x0000E0, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_AddTickAnimation_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x0000E4, "Member 'WBP_player_card_module_C_ExecuteUbergraph_WBP_player_card_module::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.FriendUpdate
// 0x0010 (0x0010 - 0x0000)
struct WBP_player_card_module_C_FriendUpdate final
{
public:
	class URH_RHFriendAndPlatformFriend*          Friend_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_FriendUpdate) == 0x000008, "Wrong alignment on WBP_player_card_module_C_FriendUpdate");
static_assert(sizeof(WBP_player_card_module_C_FriendUpdate) == 0x000010, "Wrong size on WBP_player_card_module_C_FriendUpdate");
static_assert(offsetof(WBP_player_card_module_C_FriendUpdate, Friend_0) == 0x000000, "Member 'WBP_player_card_module_C_FriendUpdate::Friend_0' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_FriendUpdate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'WBP_player_card_module_C_FriendUpdate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.Handle Input State Changed
// 0x0001 (0x0001 - 0x0000)
struct WBP_player_card_module_C_Handle_Input_State_Changed final
{
public:
	ERH_INPUT_STATE                               InputState;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_Handle_Input_State_Changed) == 0x000001, "Wrong alignment on WBP_player_card_module_C_Handle_Input_State_Changed");
static_assert(sizeof(WBP_player_card_module_C_Handle_Input_State_Changed) == 0x000001, "Wrong size on WBP_player_card_module_C_Handle_Input_State_Changed");
static_assert(offsetof(WBP_player_card_module_C_Handle_Input_State_Changed, InputState) == 0x000000, "Member 'WBP_player_card_module_C_Handle_Input_State_Changed::InputState' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.HideRankedBadge
// 0x0001 (0x0001 - 0x0000)
struct WBP_player_card_module_C_HideRankedBadge final
{
public:
	bool                                          Should_Hide;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_HideRankedBadge) == 0x000001, "Wrong alignment on WBP_player_card_module_C_HideRankedBadge");
static_assert(sizeof(WBP_player_card_module_C_HideRankedBadge) == 0x000001, "Wrong size on WBP_player_card_module_C_HideRankedBadge");
static_assert(offsetof(WBP_player_card_module_C_HideRankedBadge, Should_Hide) == 0x000000, "Member 'WBP_player_card_module_C_HideRankedBadge::Should_Hide' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.NavigateConfirm
// 0x0001 (0x0001 - 0x0000)
struct WBP_player_card_module_C_NavigateConfirm final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_NavigateConfirm) == 0x000001, "Wrong alignment on WBP_player_card_module_C_NavigateConfirm");
static_assert(sizeof(WBP_player_card_module_C_NavigateConfirm) == 0x000001, "Wrong size on WBP_player_card_module_C_NavigateConfirm");
static_assert(offsetof(WBP_player_card_module_C_NavigateConfirm, ReturnValue) == 0x000000, "Member 'WBP_player_card_module_C_NavigateConfirm::ReturnValue' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.OnContextMenuOpen
// 0x0001 (0x0001 - 0x0000)
struct WBP_player_card_module_C_OnContextMenuOpen final
{
public:
	EViewSide                                     side;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_OnContextMenuOpen) == 0x000001, "Wrong alignment on WBP_player_card_module_C_OnContextMenuOpen");
static_assert(sizeof(WBP_player_card_module_C_OnContextMenuOpen) == 0x000001, "Wrong size on WBP_player_card_module_C_OnContextMenuOpen");
static_assert(offsetof(WBP_player_card_module_C_OnContextMenuOpen, side) == 0x000000, "Member 'WBP_player_card_module_C_OnContextMenuOpen::side' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.OnRHFriendSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_player_card_module_C_OnRHFriendSet final
{
public:
	class URH_RHFriendAndPlatformFriend*          Friend_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_OnRHFriendSet) == 0x000008, "Wrong alignment on WBP_player_card_module_C_OnRHFriendSet");
static_assert(sizeof(WBP_player_card_module_C_OnRHFriendSet) == 0x000008, "Wrong size on WBP_player_card_module_C_OnRHFriendSet");
static_assert(offsetof(WBP_player_card_module_C_OnRHFriendSet, Friend_0) == 0x000000, "Member 'WBP_player_card_module_C_OnRHFriendSet::Friend_0' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_player_card_module_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_player_card_module_C_PreConstruct");
static_assert(sizeof(WBP_player_card_module_C_PreConstruct) == 0x000001, "Wrong size on WBP_player_card_module_C_PreConstruct");
static_assert(offsetof(WBP_player_card_module_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_player_card_module_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.SetPlayerCardStyle
// 0x0038 (0x0038 - 0x0000)
struct WBP_player_card_module_C_SetPlayerCardStyle final
{
public:
	EPlayerCardStyle                              PlayerCardStyle;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELaterality                                   Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELaterality                                   Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              Temp_byte_Variable_8;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerCardStyle                              Temp_byte_Variable_14;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_4;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_SetPlayerCardStyle) == 0x000008, "Wrong alignment on WBP_player_card_module_C_SetPlayerCardStyle");
static_assert(sizeof(WBP_player_card_module_C_SetPlayerCardStyle) == 0x000038, "Wrong size on WBP_player_card_module_C_SetPlayerCardStyle");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, PlayerCardStyle) == 0x000000, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::PlayerCardStyle' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable) == 0x000001, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_2) == 0x000003, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_3) == 0x000004, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_4) == 0x000005, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_5) == 0x000006, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_6) == 0x000007, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_7) == 0x000008, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_8) == 0x000009, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_9) == 0x00000A, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_10) == 0x00000B, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_11) == 0x00000C, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_12) == 0x00000D, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_13) == 0x00000E, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, Temp_byte_Variable_14) == 0x00000F, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, K2Node_Select_Default) == 0x000010, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, K2Node_Select_Default_1) == 0x000020, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, K2Node_Select_Default_2) == 0x000028, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, K2Node_Select_Default_3) == 0x000029, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetPlayerCardStyle, K2Node_Select_Default_4) == 0x000030, "Member 'WBP_player_card_module_C_SetPlayerCardStyle::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.SetVoiceState
// 0x0003 (0x0003 - 0x0000)
struct WBP_player_card_module_C_SetVoiceState final
{
public:
	bool                                          ShouldShow;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTalking;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMuted;                                           // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_SetVoiceState) == 0x000001, "Wrong alignment on WBP_player_card_module_C_SetVoiceState");
static_assert(sizeof(WBP_player_card_module_C_SetVoiceState) == 0x000003, "Wrong size on WBP_player_card_module_C_SetVoiceState");
static_assert(offsetof(WBP_player_card_module_C_SetVoiceState, ShouldShow) == 0x000000, "Member 'WBP_player_card_module_C_SetVoiceState::ShouldShow' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetVoiceState, IsTalking) == 0x000001, "Member 'WBP_player_card_module_C_SetVoiceState::IsTalking' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_SetVoiceState, IsMuted) == 0x000002, "Member 'WBP_player_card_module_C_SetVoiceState::IsMuted' has a wrong offset!");

// Function WBP_player_card_module.WBP_player_card_module_C.ShowPlayerCardAnimation
// 0x0008 (0x0008 - 0x0000)
struct WBP_player_card_module_C_ShowPlayerCardAnimation final
{
public:
	float                                         ElapsedTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedAlpha;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_player_card_module_C_ShowPlayerCardAnimation) == 0x000004, "Wrong alignment on WBP_player_card_module_C_ShowPlayerCardAnimation");
static_assert(sizeof(WBP_player_card_module_C_ShowPlayerCardAnimation) == 0x000008, "Wrong size on WBP_player_card_module_C_ShowPlayerCardAnimation");
static_assert(offsetof(WBP_player_card_module_C_ShowPlayerCardAnimation, ElapsedTime) == 0x000000, "Member 'WBP_player_card_module_C_ShowPlayerCardAnimation::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_player_card_module_C_ShowPlayerCardAnimation, ElapsedAlpha) == 0x000004, "Member 'WBP_player_card_module_C_ShowPlayerCardAnimation::ElapsedAlpha' has a wrong offset!");

}

