#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_GodItemDisplay

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.BP_OnHandleBackAction
// 0x0002 (0x0002 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSwappingActive_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction) == 0x000002, "Wrong size on WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction, CallFunc_GetIsSwappingActive_ReturnValue) == 0x000001, "Member 'WBP_G_V2_GodItemDisplay_C_BP_OnHandleBackAction::CallFunc_GetIsSwappingActive_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.EquipmentWidgetAdded
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded final
{
public:
	class UHWInventoryEquipmentWidget*            AddedEquipmentWidget;                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AHWSpectatorHUD*                        CallFunc_GetLocalHUDAsSpectator_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWActivatableEquipmentWidget*          K2Node_DynamicCast_AsHWActivatable_Equipment_Widget; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded) == 0x000008, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded) == 0x000028, "Wrong size on WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded, AddedEquipmentWidget) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded::AddedEquipmentWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded, CallFunc_GetLocalHUDAsSpectator_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded::CallFunc_GetLocalHUDAsSpectator_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded, K2Node_DynamicCast_AsHWActivatable_Equipment_Widget) == 0x000018, "Member 'WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded::K2Node_DynamicCast_AsHWActivatable_Equipment_Widget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_G_V2_GodItemDisplay_C_EquipmentWidgetAdded::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.EquipmentWidgetRemoved
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_EquipmentWidgetRemoved final
{
public:
	class UHWInventoryEquipmentWidget*            RemovedEquipmentWidget;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetRemoved) == 0x000008, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_EquipmentWidgetRemoved");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetRemoved) == 0x000008, "Wrong size on WBP_G_V2_GodItemDisplay_C_EquipmentWidgetRemoved");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_EquipmentWidgetRemoved, RemovedEquipmentWidget) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_EquipmentWidgetRemoved::RemovedEquipmentWidget' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.ExecuteUbergraph_WBP_G_V2_GodItemDisplay
// 0x0060 (0x0060 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERH_INPUT_STATE                               CallFunc_GetCurrentInputState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWBaseHUD*                             CallFunc_GetLocalHUDAsBase_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWTooltipWidgetManager*                CallFunc_GetTooltipWidgetManager_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0028(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay) == 0x000060, "Wrong size on WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay, EntryPoint) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay, CallFunc_GetLocalHUDAsBase_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay::CallFunc_GetLocalHUDAsBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay, CallFunc_GetCurrentInputState_ReturnValue) == 0x000010, "Member 'WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay::CallFunc_GetCurrentInputState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay, K2Node_Event_IsDesignTime) == 0x000011, "Member 'WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay, K2Node_SwitchEnum_CmpSuccess) == 0x000012, "Member 'WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay, CallFunc_GetLocalHUDAsBase_ReturnValue_1) == 0x000018, "Member 'WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay::CallFunc_GetLocalHUDAsBase_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay, CallFunc_GetTooltipWidgetManager_ReturnValue) == 0x000020, "Member 'WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay::CallFunc_GetTooltipWidgetManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay, CallFunc_GetCachedGeometry_ReturnValue) == 0x000028, "Member 'WBP_G_V2_GodItemDisplay_C_ExecuteUbergraph_WBP_G_V2_GodItemDisplay::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.GetCustomModifierValue
// 0x001C (0x001C - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue final
{
public:
	class FName                                   InCustomModifierName;                              // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWOrientation                                Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue) == 0x000004, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue) == 0x00001C, "Wrong size on WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue, InCustomModifierName) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue::InCustomModifierName' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue, ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue, Temp_byte_Variable) == 0x00000C, "Member 'WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue, K2Node_SwitchName_CmpSuccess) == 0x00000D, "Member 'WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue, Temp_real_Variable) == 0x000010, "Member 'WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue, Temp_real_Variable_1) == 0x000014, "Member 'WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue, K2Node_Select_Default) == 0x000018, "Member 'WBP_G_V2_GodItemDisplay_C_GetCustomModifierValue::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.GetLocalModifierTagOverride
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_GetLocalModifierTagOverride final
{
public:
	struct FGameplayTag                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_GetLocalModifierTagOverride) == 0x000004, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_GetLocalModifierTagOverride");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_GetLocalModifierTagOverride) == 0x000008, "Wrong size on WBP_G_V2_GodItemDisplay_C_GetLocalModifierTagOverride");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetLocalModifierTagOverride, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_GetLocalModifierTagOverride::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.GetWidgetName
// 0x0018 (0x0018 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_GetWidgetName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_GetWidgetName) == 0x000008, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_GetWidgetName");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_GetWidgetName) == 0x000018, "Wrong size on WBP_G_V2_GodItemDisplay_C_GetWidgetName");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_GetWidgetName, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_GetWidgetName::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.HandleCustomModifierUpdated
// 0x0078 (0x0078 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated final
{
public:
	struct FHWUIStyleLocalCustomModifier          InCustomModifier;                                  // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWOrientation                                Temp_byte_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWOrientation                                Temp_byte_Variable_1;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWOrientation                                K2Node_Select_Default;                             // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated) == 0x000008, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated) == 0x000078, "Wrong size on WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated, InCustomModifier) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated::InCustomModifier' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated, Temp_bool_Variable) == 0x000068, "Member 'WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated, Temp_byte_Variable) == 0x000069, "Member 'WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00006A, "Member 'WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated, K2Node_SwitchName_CmpSuccess) == 0x00006B, "Member 'WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated, Temp_byte_Variable_1) == 0x00006C, "Member 'WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated, K2Node_Select_Default) == 0x00006D, "Member 'WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000070, "Member 'WBP_G_V2_GodItemDisplay_C_HandleCustomModifierUpdated::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.InitializeDesignDisplay
// 0x0050 (0x0050 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay final
{
public:
	TArray<class UHWInventoryEquipmentWidget*>    ChildWidgets;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	EHWOrientation                                Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWOrientation                                Temp_byte_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWOrientation                                Temp_byte_Variable_2;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWOrientation                                K2Node_Select_Default;                             // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHWInventorySlot                       K2Node_MakeStruct_HWInventorySlot;                 // 0x0020(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UHWInventoryEquipmentWidget> CallFunc_GetEquipmentWidgetClassForSlot_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UHWInventoryEquipmentWidget*            CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay) == 0x000050, "Wrong size on WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, ChildWidgets) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::ChildWidgets' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, Temp_byte_Variable) == 0x000010, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, Temp_int_Variable) == 0x000014, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, Temp_byte_Variable_1) == 0x00001C, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, Temp_byte_Variable_2) == 0x00001E, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, K2Node_Select_Default) == 0x00001F, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, K2Node_MakeStruct_HWInventorySlot) == 0x000020, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::K2Node_MakeStruct_HWInventorySlot' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, CallFunc_GetEquipmentWidgetClassForSlot_ReturnValue) == 0x000030, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::CallFunc_GetEquipmentWidgetClassForSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, Temp_bool_Variable) == 0x000044, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, K2Node_Select_Default_1) == 0x000048, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_G_V2_GodItemDisplay_C_InitializeDesignDisplay::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_GodItemDisplay_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_GodItemDisplay.WBP_G_V2_GodItemDisplay_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetContainerDesiredFocusTarget_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget, CallFunc_GetContainerDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_G_V2_GodItemDisplay_C_BP_GetDesiredFocusTarget::CallFunc_GetContainerDesiredFocusTarget_ReturnValue' has a wrong offset!");

}

