#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Search_bar

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_Search_bar.WBP_Social_Search_bar_C
// 0x0090 (0x0648 - 0x05B8)
class UWBP_Social_Search_bar_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 background;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomBorder;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHEditableTextBox*                     InputText;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBorder;                                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightBorder;                                       // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButtonInner_C*             SubmitButton;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBorder;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FText SearchTerm)> OnSearchTermChange;                       // 0x0600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          TextIsDirty;                                       // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             SFXClick;                                          // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UninitializeWidget();
	void ShowVirtualKeyboard();
	void PlayHoverSFX();
	void PlayClickSFX();
	void OnSearchTextChange(const class FText& Text);
	bool NavigateConfirm();
	void InitializeWidget();
	void GamepadUnhover();
	void GamepadHover();
	void ExecuteUbergraph_WBP_Social_Search_bar(int32 EntryPoint);
	void DoSearch();
	void Clear();
	void BndEvt__SubmitButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature(class UWidget* Widget);
	void BndEvt__InputText_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_Search_bar_C">();
	}
	static class UWBP_Social_Search_bar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_Search_bar_C>();
	}
};
static_assert(alignof(UWBP_Social_Search_bar_C) == 0x000008, "Wrong alignment on UWBP_Social_Search_bar_C");
static_assert(sizeof(UWBP_Social_Search_bar_C) == 0x000648, "Wrong size on UWBP_Social_Search_bar_C");
static_assert(offsetof(UWBP_Social_Search_bar_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_Social_Search_bar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, Hover) == 0x0005C0, "Member 'UWBP_Social_Search_bar_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, background) == 0x0005C8, "Member 'UWBP_Social_Search_bar_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, BottomBorder) == 0x0005D0, "Member 'UWBP_Social_Search_bar_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, InputText) == 0x0005D8, "Member 'UWBP_Social_Search_bar_C::InputText' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, LeftBorder) == 0x0005E0, "Member 'UWBP_Social_Search_bar_C::LeftBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, RightBorder) == 0x0005E8, "Member 'UWBP_Social_Search_bar_C::RightBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, SubmitButton) == 0x0005F0, "Member 'UWBP_Social_Search_bar_C::SubmitButton' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, TopBorder) == 0x0005F8, "Member 'UWBP_Social_Search_bar_C::TopBorder' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, OnSearchTermChange) == 0x000600, "Member 'UWBP_Social_Search_bar_C::OnSearchTermChange' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, TextIsDirty) == 0x000610, "Member 'UWBP_Social_Search_bar_C::TextIsDirty' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, OnHovered) == 0x000618, "Member 'UWBP_Social_Search_bar_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, OnUnhovered) == 0x000628, "Member 'UWBP_Social_Search_bar_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, SFXClick) == 0x000638, "Member 'UWBP_Social_Search_bar_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Search_bar_C, SFXHover) == 0x000640, "Member 'UWBP_Social_Search_bar_C::SFXHover' has a wrong offset!");

}

