#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_SeasonShopHubWidget

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "DataTableSkinsCommon_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_SeasonShopHubWidget.WBP_C_SeasonShopHubWidget_C.BP_OnHandleBackAction
// 0x0002 (0x0002 - 0x0000)
struct WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction) == 0x000002, "Wrong size on WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction, CallFunc_IsOpen_ReturnValue) == 0x000001, "Member 'WBP_C_SeasonShopHubWidget_C_BP_OnHandleBackAction::CallFunc_IsOpen_ReturnValue' has a wrong offset!");

// Function WBP_C_SeasonShopHubWidget.WBP_C_SeasonShopHubWidget_C.ExecuteUbergraph_WBP_C_SeasonShopHubWidget
// 0x02D8 (0x02D8 - 0x0000)
struct WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class URHStoreItem*>                   K2Node_Event_SeasonItems;                          // 0x0040(0x0010)(ConstParm, ReferenceParm)
	class ACineCameraActor*                       K2Node_DynamicCast_AsCine_Camera_Actor;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FRH_LootId& SeasonLootId)> K2Node_CreateDelegate_OutputDelegate;     // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRH_LootId& SeasonLootId)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x0074(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpen_ReturnValue;                       // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_FromRoute;                            // 0x0088(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ToRoute;                              // 0x0090(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x00A0(0x0020)()
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesAnyTags_ReturnValue;               // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRH_LootId& SeasonLootId)> K2Node_CreateDelegate_OutputDelegate_2;   // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x00E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(const struct FRH_LootId& SeasonLootId)> K2Node_CreateDelegate_OutputDelegate_3;   // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_SeasonShopButton_C*              K2Node_DynamicCast_AsWBP_C_Season_Shop_Button;     // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           CallFunc_Array_Get_Item_1;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPlatformInventoryItem>  CallFunc_GetInventoryItem_ReturnValue;             // 0x0130(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWSeasonItem*                    K2Node_DynamicCast_AsHWSeason_Item;                // 0x0168(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x0178(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAssetRequestKey                       K2Node_MakeStruct_AssetRequestKey;                 // 0x0194(0x001C)(NoDestructor, HasGetValueTypeHash)
	class UHWAudioSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FHWAudioTrackPlayInfo                  K2Node_MakeStruct_HWAudioTrackPlayInfo;            // 0x01B8(0x0024)(NoDestructor)
	struct FAssetRequestKey                       K2Node_MakeStruct_AssetRequestKey_1;               // 0x01DC(0x001C)(NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_PlayMusicTrack_ReturnValue;               // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FHWAudioTrackPlayInfo                  K2Node_MakeStruct_HWAudioTrackPlayInfo_1;          // 0x0200(0x0024)(NoDestructor)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWAudioSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_PlayMusicTrack_ReturnValue_1;             // 0x0238(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           CallFunc_Array_Get_Item_2;                         // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0260(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UHWStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_3;                         // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_C_SeasonShopButton_C*              K2Node_DynamicCast_AsWBP_C_Season_Shop_Button_1;   // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URHStoreItem*                           CallFunc_Array_Get_Item_4;                         // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue_2;                 // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URHStoreItem*                           CallFunc_Array_Get_Item_5;                         // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHStoreItem*                           CallFunc_Array_Get_Item_6;                         // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BA[0x2];                                      // 0x02BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRH_LootId                             CallFunc_GetLootId_ReturnValue;                    // 0x02BC(0x0014)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget) == 0x000008, "Wrong alignment on WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget");
static_assert(sizeof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget) == 0x0002D8, "Wrong size on WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, EntryPoint) == 0x000000, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000038, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_Event_SeasonItems) == 0x000040, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_Event_SeasonItems' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_DynamicCast_AsCine_Camera_Actor) == 0x000050, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_DynamicCast_AsCine_Camera_Actor' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_IsOpen_ReturnValue) == 0x000084, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_IsOpen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_Event_FromRoute) == 0x000088, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_Event_FromRoute' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_Event_ToRoute) == 0x000090, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_Event_ToRoute' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000098, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0000A0, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, Temp_int_Loop_Counter_Variable_2) == 0x0000C0, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_MatchesAnyTags_ReturnValue) == 0x0000C4, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_MatchesAnyTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Not_PreBool_ReturnValue) == 0x0000C5, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000C8, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000CC, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetAllChildren_ReturnValue) == 0x0000E0, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Get_Item) == 0x000100, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000108, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_DynamicCast_AsWBP_C_Season_Shop_Button) == 0x000110, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_DynamicCast_AsWBP_C_Season_Shop_Button' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, Temp_int_Loop_Counter_Variable_3) == 0x00011C, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, Temp_int_Array_Index_Variable_3) == 0x000120, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Get_Item_1) == 0x000128, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetInventoryItem_ReturnValue) == 0x000130, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetInventoryItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000158, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Less_IntInt_ReturnValue_1) == 0x000160, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_DynamicCast_AsHWSeason_Item) == 0x000168, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_DynamicCast_AsHWSeason_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_DynamicCast_bSuccess_2) == 0x000170, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetItemDescription_ReturnValue) == 0x000178, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetItemDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Add_IntInt_ReturnValue_3) == 0x000190, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_MakeStruct_AssetRequestKey) == 0x000194, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_MakeStruct_AssetRequestKey' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0001B0, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_MakeStruct_HWAudioTrackPlayInfo) == 0x0001B8, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_MakeStruct_HWAudioTrackPlayInfo' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_MakeStruct_AssetRequestKey_1) == 0x0001DC, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_MakeStruct_AssetRequestKey_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_PlayMusicTrack_ReturnValue) == 0x0001F8, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_PlayMusicTrack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_MakeStruct_HWAudioTrackPlayInfo_1) == 0x000200, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_MakeStruct_HWAudioTrackPlayInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000228, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000230, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_PlayMusicTrack_ReturnValue_1) == 0x000238, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_PlayMusicTrack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_AddUnique_ReturnValue) == 0x000240, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000244, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Get_Item_2) == 0x000248, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Length_ReturnValue_2) == 0x000250, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Find_ReturnValue) == 0x000254, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Less_IntInt_ReturnValue_2) == 0x000258, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetAllChildren_ReturnValue_1) == 0x000260, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000270, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Get_Item_3) == 0x000278, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_DynamicCast_AsWBP_C_Season_Shop_Button_1) == 0x000280, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_DynamicCast_AsWBP_C_Season_Shop_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, K2Node_DynamicCast_bSuccess_3) == 0x000288, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Length_ReturnValue_3) == 0x00028C, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Less_IntInt_ReturnValue_3) == 0x000290, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000294, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Get_Item_4) == 0x000298, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Find_ReturnValue_1) == 0x0002A0, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Find_ReturnValue_2) == 0x0002A4, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Get_Item_5) == 0x0002A8, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Get_Item_6) == 0x0002B0, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Contains_ReturnValue) == 0x0002B8, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_Array_Contains_ReturnValue_1) == 0x0002B9, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetLootId_ReturnValue) == 0x0002BC, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetLootId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget, CallFunc_GetChildAt_ReturnValue_1) == 0x0002D0, "Member 'WBP_C_SeasonShopHubWidget_C_ExecuteUbergraph_WBP_C_SeasonShopHubWidget::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");

// Function WBP_C_SeasonShopHubWidget.WBP_C_SeasonShopHubWidget_C.InitializeWidget
// 0x0040 (0x0040 - 0x0000)
struct WBP_C_SeasonShopHubWidget_C_InitializeWidget final
{
public:
	TArray<class ACineCameraActor*>               CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x0000(0x0010)(ReferenceParm)
	class ACineCameraActor*                       CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ACineCameraActor>        CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopHubWidget_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_C_SeasonShopHubWidget_C_InitializeWidget");
static_assert(sizeof(WBP_C_SeasonShopHubWidget_C_InitializeWidget) == 0x000040, "Wrong size on WBP_C_SeasonShopHubWidget_C_InitializeWidget");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_InitializeWidget, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x000000, "Member 'WBP_C_SeasonShopHubWidget_C_InitializeWidget::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_InitializeWidget, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_C_SeasonShopHubWidget_C_InitializeWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_InitializeWidget, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000018, "Member 'WBP_C_SeasonShopHubWidget_C_InitializeWidget::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");

// Function WBP_C_SeasonShopHubWidget.WBP_C_SeasonShopHubWidget_C.OnGetIsSeasonOwned
// 0x0005 (0x0005 - 0x0000)
struct WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned) == 0x000001, "Wrong alignment on WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned");
static_assert(sizeof(WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned) == 0x000005, "Wrong size on WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned, IsValid) == 0x000000, "Member 'WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned::IsValid' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned, Temp_bool_Variable) == 0x000001, "Member 'WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned, Temp_byte_Variable) == 0x000002, "Member 'WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned, K2Node_Select_Default) == 0x000004, "Member 'WBP_C_SeasonShopHubWidget_C_OnGetIsSeasonOwned::K2Node_Select_Default' has a wrong offset!");

// Function WBP_C_SeasonShopHubWidget.WBP_C_SeasonShopHubWidget_C.OnPreviewSeason
// 0x0360 (0x0360 - 0x0000)
struct WBP_C_SeasonShopHubWidget_C_OnPreviewSeason final
{
public:
	struct FRH_LootId                             SeasonLootId;                                      // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            NewLocalVar;                                       // 0x0014(0x0014)(Edit, BlueprintVisible)
	TArray<class UWidget*>                        AllChildren;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           CallFunc_GetSeasonItemFromId_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0048(0x0018)()
	TSoftObjectPtr<class UPlatformInventoryItem>  CallFunc_GetInventoryItem_ReturnValue;             // 0x0060(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWSeasonItem*                    K2Node_DynamicCast_AsHWSeason_Item;                // 0x0098(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetSecondsRemainingInSeason_ReturnValue;  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemDescription_ReturnValue;           // 0x00B0(0x0018)()
	bool                                          CallFunc_LessEqual_Int64Int64_ReturnValue;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x00D0(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00F0(0x0018)()
	float                                         Temp_real_Variable;                                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHWStoreSubsystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0150(0x0014)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x016C(0x0014)()
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0184(0x0014)()
	bool                                          Temp_bool_Variable_5;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_4;                           // 0x019C(0x0014)()
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x01B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_C_SeasonShopButton_C*              K2Node_DynamicCast_AsWBP_C_Season_Shop_Button;     // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URHStoreItem*                           CallFunc_GetSeasonItemFromId_ReturnValue_1;        // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x01FC(0x0014)()
	class URHStoreItem*                           CallFunc_GetSeasonItemFromId_ReturnValue_2;        // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPlatformInventoryItem>  CallFunc_GetInventoryItem_ReturnValue_1;           // 0x0218(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWSeasonItem*                    K2Node_DynamicCast_AsHWSeason_Item_1;              // 0x0248(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0254(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARHHUDCommon*                           CallFunc_GetHUDCommon_HUD_Common;                  // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UHWInventoryItem>        CallFunc_GetSoftInventoryItemFromItemId_ReturnValue; // 0x0270(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class URH_PlayerInfo*                         CallFunc_GetLocalPlayerInfo_ReturnValue;           // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWInventoryItem*                       K2Node_DynamicCast_AsHWInventory_Item;             // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWPlayerInfo*                          CallFunc_GetLocalPlayerInfo_ReturnValue_1;         // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemTypeText_OutText;                  // 0x02C0(0x0018)()
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x02D8(0x0018)()
	class UIconInfo*                              CallFunc_GetIconInfoByTag_OutIcon;                 // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIconInfoByTag_ReturnValue;             // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconInfo*                              CallFunc_GetItemIconInfo_ReturnValue;              // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class URHStoreItemPrice* ItemPrice, const struct FGameplayTag& PriceGroupTag)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0308(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0318(0x0014)()
	bool                                          Temp_bool_Variable_6;                              // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default_6;                           // 0x0334(0x0014)()
