#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_Journeys_Abilities_Start

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Prototype_Journeys_Abilities_Start.WBP_G_Prototype_Journeys_Abilities_Start_C
// 0x0050 (0x0648 - 0x05F8)
class UWBP_G_Prototype_Journeys_Abilities_Start_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              ChallengeButton;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HWButton_103;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_7;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_133;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              TutorialButton;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              StartTutorial;                                     // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              StartChallenge;                                    // 0x0638(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__WBP_G_Prototype_Journeys_Abilities_Start_ChallengeButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_G_Prototype_Journeys_Relics_HWButton_62_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_G_Prototype_Journeys_Abilities_Start(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Prototype_Journeys_Abilities_Start_C">();
	}
	static class UWBP_G_Prototype_Journeys_Abilities_Start_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Prototype_Journeys_Abilities_Start_C>();
	}
};
static_assert(alignof(UWBP_G_Prototype_Journeys_Abilities_Start_C) == 0x000008, "Wrong alignment on UWBP_G_Prototype_Journeys_Abilities_Start_C");
static_assert(sizeof(UWBP_G_Prototype_Journeys_Abilities_Start_C) == 0x000648, "Wrong size on UWBP_G_Prototype_Journeys_Abilities_Start_C");
static_assert(offsetof(UWBP_G_Prototype_Journeys_Abilities_Start_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_Prototype_Journeys_Abilities_Start_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Journeys_Abilities_Start_C, ChallengeButton) == 0x000600, "Member 'UWBP_G_Prototype_Journeys_Abilities_Start_C::ChallengeButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Journeys_Abilities_Start_C, HWButton_103) == 0x000608, "Member 'UWBP_G_Prototype_Journeys_Abilities_Start_C::HWButton_103' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Journeys_Abilities_Start_C, HWImage_7) == 0x000610, "Member 'UWBP_G_Prototype_Journeys_Abilities_Start_C::HWImage_7' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Journeys_Abilities_Start_C, HWImage_133) == 0x000618, "Member 'UWBP_G_Prototype_Journeys_Abilities_Start_C::HWImage_133' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Journeys_Abilities_Start_C, TutorialButton) == 0x000620, "Member 'UWBP_G_Prototype_Journeys_Abilities_Start_C::TutorialButton' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Journeys_Abilities_Start_C, StartTutorial) == 0x000628, "Member 'UWBP_G_Prototype_Journeys_Abilities_Start_C::StartTutorial' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_Journeys_Abilities_Start_C, StartChallenge) == 0x000638, "Member 'UWBP_G_Prototype_Journeys_Abilities_Start_C::StartChallenge' has a wrong offset!");

}

