#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ConquestHUD_Legacy3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3
// 0x000C (0x000C - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsVisible;                           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3) == 0x000004, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3) == 0x00000C, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3, Temp_byte_Variable) == 0x000005, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3, K2Node_Event_bIsVisible) == 0x000007, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3::K2Node_Event_bIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3, K2Node_Select_Default) == 0x000008, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_ExecuteUbergraph_WBP_G_V2_ConquestHUD_Legacy3::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.GetPopupManager
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_GetPopupManager final
{
public:
	class URHPopupManager*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_GetPopupManager) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_GetPopupManager");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_GetPopupManager) == 0x000008, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_GetPopupManager");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetPopupManager, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetPopupManager::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.HandleItemStoreHidden
// 0x0078 (0x0078 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden final
{
public:
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0000(0x0020)(NoDestructor)
	EHWHUDLayoutPreset                            CallFunc_GetActiveHUDLayoutPreset_ReturnValue;     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWHUDLayoutPreset                            Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0028(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_Select_Default;                             // 0x0058(0x0020)(NoDestructor)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden) == 0x000078, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden, K2Node_MakeStruct_Anchors) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden, CallFunc_GetActiveHUDLayoutPreset_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden::CallFunc_GetActiveHUDLayoutPreset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden, Temp_byte_Variable) == 0x000021, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden, K2Node_MakeStruct_Anchors_1) == 0x000028, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000048, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden, K2Node_Select_Default) == 0x000058, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreHidden::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.HandleItemStoreLayoutChanged
// 0x0108 (0x0108 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged final
{
public:
	EHWItemStoreLayoutType                        ItemStoreLayoutType;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               Temp_struct_Variable;                              // 0x0008(0x0020)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x0028(0x0020)(NoDestructor)
	EHWHUDLayoutPreset                            CallFunc_GetActiveHUDLayoutPreset_ReturnValue;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors_1;                       // 0x0050(0x0020)(NoDestructor)
	EHWHUDLayoutPreset                            Temp_byte_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchors                               K2Node_MakeStruct_Anchors_2;                       // 0x0078(0x0020)(NoDestructor)
	struct FAnchors                               K2Node_Select_Default;                             // 0x0098(0x0020)(NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors_3;                       // 0x00B8(0x0020)(NoDestructor)
	struct FAnchors                               K2Node_Select_Default_1;                           // 0x00D8(0x0020)(NoDestructor)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged) == 0x000108, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, ItemStoreLayoutType) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::ItemStoreLayoutType' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, Temp_struct_Variable) == 0x000008, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, K2Node_MakeStruct_Anchors) == 0x000028, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, CallFunc_GetActiveHUDLayoutPreset_ReturnValue) == 0x000048, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::CallFunc_GetActiveHUDLayoutPreset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, K2Node_MakeStruct_Anchors_1) == 0x000050, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::K2Node_MakeStruct_Anchors_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, Temp_byte_Variable_1) == 0x000070, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, K2Node_MakeStruct_Anchors_2) == 0x000078, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::K2Node_MakeStruct_Anchors_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, K2Node_Select_Default) == 0x000098, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, K2Node_MakeStruct_Anchors_3) == 0x0000B8, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::K2Node_MakeStruct_Anchors_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, K2Node_Select_Default_1) == 0x0000D8, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x0000F8, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_HandleItemStoreLayoutChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.OnNetworkLagStateUpdated
// 0x0028 (0x0028 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated final
{
public:
	ENetworkPingState                             PingState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetworkLagState                              LagState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetworkLagState                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetworkPingState                             Temp_byte_Variable_4;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENetworkLagState                              Temp_byte_Variable_5;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated) == 0x000028, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, PingState) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::PingState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, LagState) == 0x000001, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::LagState' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_real_Variable) == 0x000004, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_real_Variable_1) == 0x000008, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_real_Variable_2) == 0x00000C, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_byte_Variable) == 0x000010, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_byte_Variable_1) == 0x000011, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_byte_Variable_2) == 0x000012, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_byte_Variable_3) == 0x000013, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_byte_Variable_4) == 0x000014, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, K2Node_Select_Default) == 0x000015, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, Temp_byte_Variable_5) == 0x000016, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, K2Node_Select_Default_1) == 0x000018, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated, K2Node_Select_Default_2) == 0x000020, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_OnNetworkLagStateUpdated::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.SetHelpTipVisibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_SetHelpTipVisibility final
{
public:
	bool                                          bIsVisible;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_SetHelpTipVisibility) == 0x000001, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_SetHelpTipVisibility");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_SetHelpTipVisibility) == 0x000001, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_SetHelpTipVisibility");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_SetHelpTipVisibility, bIsVisible) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_SetHelpTipVisibility::bIsVisible' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.SetReticleShape
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_SetReticleShape final
{
public:
	class UObject*                                NewReticleShape;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_SetReticleShape) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_SetReticleShape");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_SetReticleShape) == 0x000008, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_SetReticleShape");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_SetReticleShape, NewReticleShape) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_SetReticleShape::NewReticleShape' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.UpdateReticlePosition
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition final
{
public:
	struct FVector2D                              NewPosition;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition) == 0x000030, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition, NewPosition) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition::NewPosition' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition, CallFunc_BreakVector2D_X) == 0x000010, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition, CallFunc_MakeVector2D_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticlePosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.UpdateReticleTarget
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleTarget final
{
public:
	bool                                          bIsTargeting;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleTarget) == 0x000001, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleTarget");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleTarget) == 0x000001, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleTarget");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleTarget, bIsTargeting) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleTarget::bIsTargeting' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.UpdateReticleVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility) == 0x000001, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility) == 0x000005, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility, bVisible) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility::bVisible' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_UpdateReticleVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.AddTopViewRouteToWidgets
// 0x0078 (0x0078 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets final
{
public:
	struct FGameplayTagContainer                  ValidViewRoutes;                                   // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class UHWWidget*>                      Widgets;                                           // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UHWWidget*>                      Return;                                            // 0x0030(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class UHWWidget*>                      LocalNavWidgets;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class URHViewManager*                         CallFunc_GetViewManager_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class URHWidget*                              CallFunc_GetTopViewRouteWidget_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_GetTopViewRoute_ReturnValue;              // 0x0060(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	class UHWWidget*                              K2Node_DynamicCast_AsHWWidget;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets) == 0x000078, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, ValidViewRoutes) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::ValidViewRoutes' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, Widgets) == 0x000020, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::Widgets' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, Return) == 0x000030, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::Return' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, LocalNavWidgets) == 0x000040, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::LocalNavWidgets' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, CallFunc_GetViewManager_ReturnValue) == 0x000050, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::CallFunc_GetViewManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, CallFunc_GetTopViewRouteWidget_ReturnValue) == 0x000058, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::CallFunc_GetTopViewRouteWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, CallFunc_GetTopViewRoute_ReturnValue) == 0x000060, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::CallFunc_GetTopViewRoute_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, K2Node_DynamicCast_AsHWWidget) == 0x000068, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::K2Node_DynamicCast_AsHWWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, CallFunc_HasTag_ReturnValue) == 0x000071, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets, CallFunc_BooleanAND_ReturnValue) == 0x000072, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_AddTopViewRouteToWidgets::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.GetAutoBuyBuildSelectorWidget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_GetAutoBuyBuildSelectorWidget final
{
public:
	class UHWAutoBuyBuildSelector*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_GetAutoBuyBuildSelectorWidget) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_GetAutoBuyBuildSelectorWidget");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_GetAutoBuyBuildSelectorWidget) == 0x000008, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_GetAutoBuyBuildSelectorWidget");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetAutoBuyBuildSelectorWidget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetAutoBuyBuildSelectorWidget::ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.GetCanvasPanels
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels final
{
public:
	TArray<class UHWCanvasPanel*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWCanvasPanel*>                 K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels) == 0x000020, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetCanvasPanels::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.GetHUDNavigableWidgets
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets final
{
public:
	int32                                         ActiveWidgetIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWWidget*>                      ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	int32                                         CallFunc_GetEquipmentCount_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHWWidget*>                      K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets) == 0x000030, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets, ActiveWidgetIndex) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets::ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets, ReturnValue) == 0x000008, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets, CallFunc_GetEquipmentCount_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets::CallFunc_GetEquipmentCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets, K2Node_MakeArray_Array) == 0x000020, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetHUDNavigableWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.GetHWWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets final
{
public:
	TArray<class UHWWidget*>                      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWWidget*>                      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets) == 0x000020, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetHWWidgets::K2Node_MakeArray_Array' has a wrong offset!");

// Function WBP_G_V2_ConquestHUD_Legacy3.WBP_G_V2_ConquestHUD_Legacy3_C.GetScreenAlertManager
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ConquestHUD_Legacy3_C_GetScreenAlertManager final
{
public:
	class UHWScreenAlertManager*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ConquestHUD_Legacy3_C_GetScreenAlertManager) == 0x000008, "Wrong alignment on WBP_G_V2_ConquestHUD_Legacy3_C_GetScreenAlertManager");
static_assert(sizeof(WBP_G_V2_ConquestHUD_Legacy3_C_GetScreenAlertManager) == 0x000008, "Wrong size on WBP_G_V2_ConquestHUD_Legacy3_C_GetScreenAlertManager");
static_assert(offsetof(WBP_G_V2_ConquestHUD_Legacy3_C_GetScreenAlertManager, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ConquestHUD_Legacy3_C_GetScreenAlertManager::ReturnValue' has a wrong offset!");

}

