#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Prototype_TutorialOB_Instruction

#include "Basic.hpp"

#include "E_NPE_TriggerType_structs.hpp"
#include "RallyHereStart_structs.hpp"
#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Prototype_TutorialOB_Instruction.WBP_G_Prototype_TutorialOB_Instruction_C
// 0x00F8 (0x06F0 - 0x05F8)
class UWBP_G_Prototype_TutorialOB_Instruction_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               HWImage;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_1;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_2;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_3;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_5;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_6;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_7;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             HWOverlay1;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             HWOverlay1_1;                                      // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             HWOverlay1_2;                                      // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             HWOverlay1_3;                                      // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             HWOverlay2;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             HWOverlay2_1;                                      // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      HWWidgetSwitcher_0;                                // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             Prompt1;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             Prompt2;                                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PromptBack;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PromptForward;                                     // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PromptLeft;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             PromptRight;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PromptText;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Prototype_Tutorial_HUDHighlight_Glow_1;            // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Prototype_Tutorial_HUDHighlight_Glow_2;            // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Prototype_Tutorial_HUDHighlight_Glow_3;            // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Prototype_Tutorial_HUDHighlight_Glow_4;            // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Prototype_Tutorial_HUDHighlight_Glow_5;            // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               Prototype_Tutorial_HUDHighlight_Glow_6;            // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Guide_Instructions_C*               Instructions;                                      // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Show, const struct FGameplayTag& Input)> HUDHighlight;        // 0x06E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_G_Prototype_TutorialOB_Instruction(int32 EntryPoint);
	void HackyMovementKeyDetection(const struct FGameplayTag& InputTag);
	void HandleInstructionEvent(const struct FGameplayTag& EventTag, E_NPE_TriggerType EventType);
	void InitializeWidget();
	void OnNPEGuideCustomTrigger(const struct FGameplayTag& CustomTag, E_NPE_TriggerType Event, TArray<struct FS_NPE_Trigger_Event>& Events);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Prototype_TutorialOB_Instruction_C">();
	}
	static class UWBP_G_Prototype_TutorialOB_Instruction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Prototype_TutorialOB_Instruction_C>();
	}
};
static_assert(alignof(UWBP_G_Prototype_TutorialOB_Instruction_C) == 0x000008, "Wrong alignment on UWBP_G_Prototype_TutorialOB_Instruction_C");
static_assert(sizeof(UWBP_G_Prototype_TutorialOB_Instruction_C) == 0x0006F0, "Wrong size on UWBP_G_Prototype_TutorialOB_Instruction_C");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWImage) == 0x000600, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWImage' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWImage_1) == 0x000608, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWImage_2) == 0x000610, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWImage_2' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWImage_3) == 0x000618, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWImage_3' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWImage_5) == 0x000620, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWImage_5' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWImage_6) == 0x000628, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWImage_6' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWImage_7) == 0x000630, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWImage_7' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWOverlay1) == 0x000638, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWOverlay1' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWOverlay1_1) == 0x000640, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWOverlay1_1' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWOverlay1_2) == 0x000648, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWOverlay1_2' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWOverlay1_3) == 0x000650, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWOverlay1_3' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWOverlay2) == 0x000658, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWOverlay2' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWOverlay2_1) == 0x000660, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWOverlay2_1' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HWWidgetSwitcher_0) == 0x000668, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HWWidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Prompt1) == 0x000670, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Prompt1' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Prompt2) == 0x000678, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Prompt2' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, PromptBack) == 0x000680, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::PromptBack' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, PromptForward) == 0x000688, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::PromptForward' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, PromptLeft) == 0x000690, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::PromptLeft' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, PromptRight) == 0x000698, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::PromptRight' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, PromptText) == 0x0006A0, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::PromptText' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Prototype_Tutorial_HUDHighlight_Glow_1) == 0x0006A8, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Prototype_Tutorial_HUDHighlight_Glow_1' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Prototype_Tutorial_HUDHighlight_Glow_2) == 0x0006B0, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Prototype_Tutorial_HUDHighlight_Glow_2' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Prototype_Tutorial_HUDHighlight_Glow_3) == 0x0006B8, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Prototype_Tutorial_HUDHighlight_Glow_3' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Prototype_Tutorial_HUDHighlight_Glow_4) == 0x0006C0, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Prototype_Tutorial_HUDHighlight_Glow_4' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Prototype_Tutorial_HUDHighlight_Glow_5) == 0x0006C8, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Prototype_Tutorial_HUDHighlight_Glow_5' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Prototype_Tutorial_HUDHighlight_Glow_6) == 0x0006D0, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Prototype_Tutorial_HUDHighlight_Glow_6' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, Instructions) == 0x0006D8, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::Instructions' has a wrong offset!");
static_assert(offsetof(UWBP_G_Prototype_TutorialOB_Instruction_C, HUDHighlight) == 0x0006E0, "Member 'UWBP_G_Prototype_TutorialOB_Instruction_C::HUDHighlight' has a wrong offset!");

}

