#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spec_HUDScoreboard_GodAspect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_Spec_HUDScoreboard_GodAspect.WBP_G_Spec_HUDScoreboard_GodAspect_C
// 0x0028 (0x0770 - 0x0748)
class UWBP_G_Spec_HUDScoreboard_GodAspect_C final : public UHWActivatableEquipmentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0748(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               AspectArt;                                         // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               AspectIcon;                                        // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              HitBox;                                            // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Main_SizeBox;                                      // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_Scoreboard_ItemEntry_HitBox_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_G_V2_Scoreboard_ItemEntry_HitBox_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void DisplayEquipment(const class UHWEquipmentItem* EquipmentInfo);
	void ExecuteUbergraph_WBP_G_Spec_HUDScoreboard_GodAspect(int32 EntryPoint);
	void HoverStyling(bool bHovered);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_Spec_HUDScoreboard_GodAspect_C">();
	}
	static class UWBP_G_Spec_HUDScoreboard_GodAspect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_Spec_HUDScoreboard_GodAspect_C>();
	}
};
static_assert(alignof(UWBP_G_Spec_HUDScoreboard_GodAspect_C) == 0x000008, "Wrong alignment on UWBP_G_Spec_HUDScoreboard_GodAspect_C");
static_assert(sizeof(UWBP_G_Spec_HUDScoreboard_GodAspect_C) == 0x000770, "Wrong size on UWBP_G_Spec_HUDScoreboard_GodAspect_C");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_GodAspect_C, UberGraphFrame) == 0x000748, "Member 'UWBP_G_Spec_HUDScoreboard_GodAspect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_GodAspect_C, AspectArt) == 0x000750, "Member 'UWBP_G_Spec_HUDScoreboard_GodAspect_C::AspectArt' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_GodAspect_C, AspectIcon) == 0x000758, "Member 'UWBP_G_Spec_HUDScoreboard_GodAspect_C::AspectIcon' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_GodAspect_C, HitBox) == 0x000760, "Member 'UWBP_G_Spec_HUDScoreboard_GodAspect_C::HitBox' has a wrong offset!");
static_assert(offsetof(UWBP_G_Spec_HUDScoreboard_GodAspect_C, Main_SizeBox) == 0x000768, "Member 'UWBP_G_Spec_HUDScoreboard_GodAspect_C::Main_SizeBox' has a wrong offset!");

}

