#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_Store_LowScopeDeals

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_Store_LowScopeDeals.WBP_C_Store_LowScopeDeals_C
// 0x0098 (0x0798 - 0x0700)
class UWBP_C_Store_LowScopeDeals_C final : public UHWStoreLowScopeDeals
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWVerticalBox*                         ActionButton_VerticalBox;                          // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CollectionSimpleInfo_C*          CollectionSimpleInfo;                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSortableGridPanel*                   Entries;                                           // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_LobbyModelPlayer_C*              LobbyModelPlayer;                                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWWidgetSwitcher*                      OwnedStatusSwitcher;                               // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           OwnedText;                                         // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PremiumPriceDisplay;                               // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             PriceDisplay;                                      // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GemButton_Purple_C*              PurchaseButton;                                    // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           PurchaseButtonLabel;                               // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_StoreScreen_S_PurchaseDiamonds_C* PurchaseDiamondsButton;                           // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWCanvasPanel*                         ScreenCanvas;                                      // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ScrollHitbox;                                      // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWHorizontalBox*                       SkinVoiceBox;                                      // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_SkinVoicePreviewButton_C*        SkinVoicePreviewButton;                            // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UnlockCallout;                                     // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             VoiceButtonCallout;                                // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_GodDetails_Label_C*              WBP_C_GodDetails_Label;                            // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_Store_LowScopeDeals_PurchaseButton_K2Node_ComponentBoundEvent_0_OnHWButtonEvent__DelegateSignature();
	void BndEvt__WBP_C_Store_LowScopeDeals_SkinVoicePreviewButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void DisplayStoreItemWidgets(const TArray<class UHWStoreItemDisplayWidget*>& Widgets);
	void ExecuteUbergraph_WBP_C_Store_LowScopeDeals(int32 EntryPoint);
	void InitializeWidget();
	void OnDisplayItem(class UHWInventoryItem* Item);
	void OnDisplayPrice(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroupTag);
	void OnHide();
	void OnShown();
	void UninitializeWidget();

	class UWidget* BP_GetDesiredFocusTarget() const;
	class FText GetDefaultSelectDisplayName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_Store_LowScopeDeals_C">();
	}
	static class UWBP_C_Store_LowScopeDeals_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_Store_LowScopeDeals_C>();
	}
};
static_assert(alignof(UWBP_C_Store_LowScopeDeals_C) == 0x000008, "Wrong alignment on UWBP_C_Store_LowScopeDeals_C");
static_assert(sizeof(UWBP_C_Store_LowScopeDeals_C) == 0x000798, "Wrong size on UWBP_C_Store_LowScopeDeals_C");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, UberGraphFrame) == 0x000700, "Member 'UWBP_C_Store_LowScopeDeals_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, ActionButton_VerticalBox) == 0x000708, "Member 'UWBP_C_Store_LowScopeDeals_C::ActionButton_VerticalBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, CollectionSimpleInfo) == 0x000710, "Member 'UWBP_C_Store_LowScopeDeals_C::CollectionSimpleInfo' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, Entries) == 0x000718, "Member 'UWBP_C_Store_LowScopeDeals_C::Entries' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, LobbyModelPlayer) == 0x000720, "Member 'UWBP_C_Store_LowScopeDeals_C::LobbyModelPlayer' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, OwnedStatusSwitcher) == 0x000728, "Member 'UWBP_C_Store_LowScopeDeals_C::OwnedStatusSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, OwnedText) == 0x000730, "Member 'UWBP_C_Store_LowScopeDeals_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, PremiumPriceDisplay) == 0x000738, "Member 'UWBP_C_Store_LowScopeDeals_C::PremiumPriceDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, PriceDisplay) == 0x000740, "Member 'UWBP_C_Store_LowScopeDeals_C::PriceDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, PurchaseButton) == 0x000748, "Member 'UWBP_C_Store_LowScopeDeals_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, PurchaseButtonLabel) == 0x000750, "Member 'UWBP_C_Store_LowScopeDeals_C::PurchaseButtonLabel' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, PurchaseDiamondsButton) == 0x000758, "Member 'UWBP_C_Store_LowScopeDeals_C::PurchaseDiamondsButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, ScreenCanvas) == 0x000760, "Member 'UWBP_C_Store_LowScopeDeals_C::ScreenCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, ScrollHitbox) == 0x000768, "Member 'UWBP_C_Store_LowScopeDeals_C::ScrollHitbox' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, SkinVoiceBox) == 0x000770, "Member 'UWBP_C_Store_LowScopeDeals_C::SkinVoiceBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, SkinVoicePreviewButton) == 0x000778, "Member 'UWBP_C_Store_LowScopeDeals_C::SkinVoicePreviewButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, UnlockCallout) == 0x000780, "Member 'UWBP_C_Store_LowScopeDeals_C::UnlockCallout' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, VoiceButtonCallout) == 0x000788, "Member 'UWBP_C_Store_LowScopeDeals_C::VoiceButtonCallout' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_LowScopeDeals_C, WBP_C_GodDetails_Label) == 0x000790, "Member 'UWBP_C_Store_LowScopeDeals_C::WBP_C_GodDetails_Label' has a wrong offset!");

}

