#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_EventTextManager

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_EventTextManager.WBP_G_V2_EventTextManager_C.AddEntryToContainer
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_EventTextManager_C_AddEntryToContainer final
{
public:
	class UHWEventTextEntryWidget*                EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EventTextManager_C_AddEntryToContainer) == 0x000008, "Wrong alignment on WBP_G_V2_EventTextManager_C_AddEntryToContainer");
static_assert(sizeof(WBP_G_V2_EventTextManager_C_AddEntryToContainer) == 0x000020, "Wrong size on WBP_G_V2_EventTextManager_C_AddEntryToContainer");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_AddEntryToContainer, EntryWidget) == 0x000000, "Member 'WBP_G_V2_EventTextManager_C_AddEntryToContainer::EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_AddEntryToContainer, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_G_V2_EventTextManager_C_AddEntryToContainer::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_AddEntryToContainer, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000018, "Member 'WBP_G_V2_EventTextManager_C_AddEntryToContainer::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_EventTextManager.WBP_G_V2_EventTextManager_C.PreConstruct
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_EventTextManager_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHWEventTextEntryWidget*                CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EventTextManager_C_PreConstruct) == 0x000008, "Wrong alignment on WBP_G_V2_EventTextManager_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_EventTextManager_C_PreConstruct) == 0x000030, "Wrong size on WBP_G_V2_EventTextManager_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_EventTextManager_C_PreConstruct::IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_PreConstruct, Temp_int_Variable) == 0x000004, "Member 'WBP_G_V2_EventTextManager_C_PreConstruct::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_PreConstruct, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_G_V2_EventTextManager_C_PreConstruct::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_PreConstruct, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_G_V2_EventTextManager_C_PreConstruct::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_PreConstruct, K2Node_MakeStruct_Margin) == 0x000010, "Member 'WBP_G_V2_EventTextManager_C_PreConstruct::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_PreConstruct, CallFunc_Create_ReturnValue) == 0x000020, "Member 'WBP_G_V2_EventTextManager_C_PreConstruct::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_PreConstruct, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000028, "Member 'WBP_G_V2_EventTextManager_C_PreConstruct::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_EventTextManager.WBP_G_V2_EventTextManager_C.RemoveEntryFromContainer
// 0x0010 (0x0010 - 0x0000)
struct WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer final
{
public:
	class UHWEventTextEntryWidget*                EntryWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer) == 0x000008, "Wrong alignment on WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer");
static_assert(sizeof(WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer) == 0x000010, "Wrong size on WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer, EntryWidget) == 0x000000, "Member 'WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer::EntryWidget' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer, CallFunc_RemoveChild_ReturnValue) == 0x000008, "Member 'WBP_G_V2_EventTextManager_C_RemoveEntryFromContainer::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");

}

