#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ItemStore_RoleFilterEntry

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HemingwayUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ItemStore_RoleFilterEntry.WBP_G_V2_ItemStore_RoleFilterEntry_C.DisplayCharacterStatEntry
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayCharacterStatEntry final
{
public:
	struct FHWDataDisplay_CharacterStat           CharacterStatData;                                 // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayCharacterStatEntry) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayCharacterStatEntry");
static_assert(sizeof(WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayCharacterStatEntry) == 0x0000A0, "Wrong size on WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayCharacterStatEntry");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayCharacterStatEntry, CharacterStatData) == 0x000000, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayCharacterStatEntry::CharacterStatData' has a wrong offset!");

// Function WBP_G_V2_ItemStore_RoleFilterEntry.WBP_G_V2_ItemStore_RoleFilterEntry_C.DisplayKeywordEntry
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayKeywordEntry final
{
public:
	struct FHWDataDisplay_Keyword                 KeywordData;                                       // 0x0000(0x00F0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayKeywordEntry) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayKeywordEntry");
static_assert(sizeof(WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayKeywordEntry) == 0x0000F0, "Wrong size on WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayKeywordEntry");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayKeywordEntry, KeywordData) == 0x000000, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_DisplayKeywordEntry::KeywordData' has a wrong offset!");

// Function WBP_G_V2_ItemStore_RoleFilterEntry.WBP_G_V2_ItemStore_RoleFilterEntry_C.ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSelected_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry");
static_assert(sizeof(WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry) == 0x000040, "Wrong size on WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry, Temp_bool_Variable) == 0x000004, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry, Temp_struct_Variable) == 0x000008, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry, CallFunc_GetIsSelected_ReturnValue) == 0x000028, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry::CallFunc_GetIsSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry, K2Node_Select_Default) == 0x000030, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_ExecuteUbergraph_WBP_G_V2_ItemStore_RoleFilterEntry::K2Node_Select_Default' has a wrong offset!");

// Function WBP_G_V2_ItemStore_RoleFilterEntry.WBP_G_V2_ItemStore_RoleFilterEntry_C.OverrideTooltip
// 0x0208 (0x0208 - 0x0000)
struct WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip final
{
public:
	class UHWGodBuilderSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	EHWCachedBuildType                            CallFunc_GetCachedBuildType_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWGodBuild                            CallFunc_GetCachedPrimaryBuild_OutGodBuild;        // 0x0028(0x0190)()
	bool                                          CallFunc_GetCachedPrimaryBuild_ReturnValue;        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x01C0(0x0018)()
	EHWCachedBuildType                            Temp_byte_Variable;                                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x01E0(0x0018)()
	struct FGameplayTag                           CallFunc_GetFilterTag_ReturnValue;                 // 0x01F8(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip");
static_assert(sizeof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip) == 0x000208, "Wrong size on WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, Temp_text_Variable) == 0x000008, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, CallFunc_GetCachedBuildType_ReturnValue) == 0x000020, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::CallFunc_GetCachedBuildType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, CallFunc_GetCachedPrimaryBuild_OutGodBuild) == 0x000028, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::CallFunc_GetCachedPrimaryBuild_OutGodBuild' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, CallFunc_GetCachedPrimaryBuild_ReturnValue) == 0x0001B8, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::CallFunc_GetCachedPrimaryBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, CallFunc_GetText_ReturnValue) == 0x0001C0, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, Temp_byte_Variable) == 0x0001D8, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0001D9, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, K2Node_Select_Default) == 0x0001E0, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, CallFunc_GetFilterTag_ReturnValue) == 0x0001F8, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::CallFunc_GetFilterTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000200, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_OverrideTooltip::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore_RoleFilterEntry.WBP_G_V2_ItemStore_RoleFilterEntry_C.UpdateSelectedIndicator
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0028(0x0014)()
	bool                                          CallFunc_GetIsSelected_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator) == 0x000004, "Wrong alignment on WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator");
static_assert(sizeof(WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator) == 0x000040, "Wrong size on WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator, K2Node_MakeStruct_SlateColor_1) == 0x000014, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator, K2Node_MakeStruct_SlateColor_2) == 0x000028, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator, CallFunc_GetIsSelected_ReturnValue) == 0x00003C, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_UpdateSelectedIndicator::CallFunc_GetIsSelected_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ItemStore_RoleFilterEntry.WBP_G_V2_ItemStore_RoleFilterEntry_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ItemStore_RoleFilterEntry_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ItemStore_RoleFilterEntry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_G_V2_ItemStore_RoleFilterEntry_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_G_V2_ItemStore_RoleFilterEntry_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_G_V2_ItemStore_RoleFilterEntry_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_G_V2_ItemStore_RoleFilterEntry_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ItemStore_RoleFilterEntry_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

