#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_Search

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C
// 0x08C8 (0x0FD0 - 0x0708)
class UWBP_S_GodBuilder_Search_C final : public UHWGodBuilderSearchWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0708(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              AscendingSortButton;                               // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        AspectFilterEntry;                                 // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        CarryFilterEntry;                                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              ClickToCloseButton;                                // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        DateCreatedSortEntry;                              // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        DateModifiedSortEntry;                             // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              DescendingSortButton;                              // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        FavoritesSortEntry;                                // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        FillFilterEntry;                                   // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              FilterButton;                                      // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             FilterPrompt;                                      // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWBorder*                              FiltersBorder;                                     // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    GenericFilterGrid;                                 // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        JungleFilterEntry;                                 // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        MidFilterEntry;                                    // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    ModeFilterGrid;                                    // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        OfficialBuildFilterEntry;                          // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    RoleFilterGrid;                                    // 0x0798(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SearchButtonPrompt;                                // 0x07A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWEditableTextBox*                     SearchEditableTextBox;                             // 0x07A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             SearchTextPrompt;                                  // 0x07B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        SoloFilterEntry;                                   // 0x07B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SortDescText;                                      // 0x07C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWUniformGridPanel*                    SortFilterGrid;                                    // 0x07C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        SupportFilterEntry;                                // 0x07D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsShowingFilter;                                  // 0x07D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D9[0x7];                                      // 0x07D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SFXHover;                                          // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FButtonStyle                           SortButtonSelectedStyle;                           // 0x07F0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           SortButtonDefaultStyle;                            // 0x0BE0(0x03F0)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddModeFilters();
	void BndEvt__WBP_C_GodRoster_FilterWidget_AscendingSortButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_AscendingSortButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_ClickToCloseButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_DescendingSortButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_DescendingSortButton_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_FilterButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_FilterButton_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void ExecuteUbergraph_WBP_S_GodBuilder_Search(int32 EntryPoint);
	void HandleFilterEntryClicked(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry);
	void HandleModeFilterEntryClicked(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry);
	void HandleRoleFilterEntryClicked(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry);
	void HandleSortEntryClicked(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry);
	void InitializeEntries();
	void InitializeWidget();
	void PlayClickSFX();
	void PlayHoverSFX();
	void PreConstruct(bool IsDesignTime);
	void ToggleFilterDisplay();
	void UninitializeEntries();
	void UninitializeWidget();
	void UpdateSortDescription();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_Search_C">();
	}
	static class UWBP_S_GodBuilder_Search_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_Search_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_Search_C) == 0x000010, "Wrong alignment on UWBP_S_GodBuilder_Search_C");
static_assert(sizeof(UWBP_S_GodBuilder_Search_C) == 0x000FD0, "Wrong size on UWBP_S_GodBuilder_Search_C");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, UberGraphFrame) == 0x000708, "Member 'UWBP_S_GodBuilder_Search_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, AscendingSortButton) == 0x000710, "Member 'UWBP_S_GodBuilder_Search_C::AscendingSortButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, AspectFilterEntry) == 0x000718, "Member 'UWBP_S_GodBuilder_Search_C::AspectFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, CarryFilterEntry) == 0x000720, "Member 'UWBP_S_GodBuilder_Search_C::CarryFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, ClickToCloseButton) == 0x000728, "Member 'UWBP_S_GodBuilder_Search_C::ClickToCloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, DateCreatedSortEntry) == 0x000730, "Member 'UWBP_S_GodBuilder_Search_C::DateCreatedSortEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, DateModifiedSortEntry) == 0x000738, "Member 'UWBP_S_GodBuilder_Search_C::DateModifiedSortEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, DescendingSortButton) == 0x000740, "Member 'UWBP_S_GodBuilder_Search_C::DescendingSortButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, FavoritesSortEntry) == 0x000748, "Member 'UWBP_S_GodBuilder_Search_C::FavoritesSortEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, FillFilterEntry) == 0x000750, "Member 'UWBP_S_GodBuilder_Search_C::FillFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, FilterButton) == 0x000758, "Member 'UWBP_S_GodBuilder_Search_C::FilterButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, FilterPrompt) == 0x000760, "Member 'UWBP_S_GodBuilder_Search_C::FilterPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, FiltersBorder) == 0x000768, "Member 'UWBP_S_GodBuilder_Search_C::FiltersBorder' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, GenericFilterGrid) == 0x000770, "Member 'UWBP_S_GodBuilder_Search_C::GenericFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, JungleFilterEntry) == 0x000778, "Member 'UWBP_S_GodBuilder_Search_C::JungleFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, MidFilterEntry) == 0x000780, "Member 'UWBP_S_GodBuilder_Search_C::MidFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, ModeFilterGrid) == 0x000788, "Member 'UWBP_S_GodBuilder_Search_C::ModeFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, OfficialBuildFilterEntry) == 0x000790, "Member 'UWBP_S_GodBuilder_Search_C::OfficialBuildFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, RoleFilterGrid) == 0x000798, "Member 'UWBP_S_GodBuilder_Search_C::RoleFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SearchButtonPrompt) == 0x0007A0, "Member 'UWBP_S_GodBuilder_Search_C::SearchButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SearchEditableTextBox) == 0x0007A8, "Member 'UWBP_S_GodBuilder_Search_C::SearchEditableTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SearchTextPrompt) == 0x0007B0, "Member 'UWBP_S_GodBuilder_Search_C::SearchTextPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SoloFilterEntry) == 0x0007B8, "Member 'UWBP_S_GodBuilder_Search_C::SoloFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SortDescText) == 0x0007C0, "Member 'UWBP_S_GodBuilder_Search_C::SortDescText' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SortFilterGrid) == 0x0007C8, "Member 'UWBP_S_GodBuilder_Search_C::SortFilterGrid' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SupportFilterEntry) == 0x0007D0, "Member 'UWBP_S_GodBuilder_Search_C::SupportFilterEntry' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, bIsShowingFilter) == 0x0007D8, "Member 'UWBP_S_GodBuilder_Search_C::bIsShowingFilter' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SFXHover) == 0x0007E0, "Member 'UWBP_S_GodBuilder_Search_C::SFXHover' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SFXClick) == 0x0007E8, "Member 'UWBP_S_GodBuilder_Search_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SortButtonSelectedStyle) == 0x0007F0, "Member 'UWBP_S_GodBuilder_Search_C::SortButtonSelectedStyle' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_Search_C, SortButtonDefaultStyle) == 0x000BE0, "Member 'UWBP_S_GodBuilder_Search_C::SortButtonDefaultStyle' has a wrong offset!");

}

