#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GS_EndOfMatchDetailsPlayer

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function WBP_GS_EndOfMatchDetailsPlayer.WBP_GS_EndOfMatchDetailsPlayer_C.ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GS_EndOfMatchDetailsStat_C*        K2Node_DynamicCast_AsWBP_GS_End_Of_Match_Details_Stat; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEndOfMatchLobbyDetailsStat*          K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Stat; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildIndex_ReturnValue;                // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer) == 0x0000A0, "Wrong size on WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, EntryPoint) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, Temp_real_Variable) == 0x000004, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, Temp_real_Variable_1) == 0x000008, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, Temp_int_Variable) == 0x00000C, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, K2Node_DynamicCast_AsWBP_GS_End_Of_Match_Details_Stat) == 0x000048, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::K2Node_DynamicCast_AsWBP_GS_End_Of_Match_Details_Stat' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Less_IntInt_ReturnValue) == 0x000051, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_GetAllChildren_ReturnValue_1) == 0x000058, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Stat) == 0x000078, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Stat' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Less_IntInt_ReturnValue_1) == 0x000081, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_GetParent_ReturnValue) == 0x000088, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_GetChildIndex_ReturnValue) == 0x000090, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_GetChildIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, CallFunc_Percent_IntInt_ReturnValue) == 0x000094, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer, K2Node_Select_Default) == 0x000098, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_ExecuteUbergraph_WBP_GS_EndOfMatchDetailsPlayer::K2Node_Select_Default' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetailsPlayer.WBP_GS_EndOfMatchDetailsPlayer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndOfMatchDetailsPlayer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsPlayer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GS_EndOfMatchDetailsPlayer_C_PreConstruct");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsPlayer_C_PreConstruct) == 0x000001, "Wrong size on WBP_GS_EndOfMatchDetailsPlayer_C_PreConstruct");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetailsPlayer.WBP_GS_EndOfMatchDetailsPlayer_C.SetCharacterItem
// 0x0050 (0x0050 - 0x0000)
struct WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem final
{
public:
	const class UHWCharacterItem*                 InCharacterItem;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconTextureByTag_ReturnValue;          // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0030(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem) == 0x000050, "Wrong size on WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem, InCharacterItem) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem::InCharacterItem' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem, CallFunc_GetIconTextureByTag_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem::CallFunc_GetIconTextureByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem, CallFunc_GetItemName_ReturnValue) == 0x000030, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetCharacterItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetailsPlayer.WBP_GS_EndOfMatchDetailsPlayer_C.SetIsEnemy
// 0x0060 (0x0060 - 0x0000)
struct WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy final
{
public:
	bool                                          bInIsEnemy;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWEndOfMatchLobbyDetailsStat*          K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Stat; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy) == 0x000060, "Wrong size on WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, bInIsEnemy) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::bInIsEnemy' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, Temp_bool_Variable) == 0x000001, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, Temp_struct_Variable) == 0x000004, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, Temp_struct_Variable_1) == 0x00000C, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, K2Node_Select_Default) == 0x000020, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, CallFunc_GetAllChildren_ReturnValue) == 0x000028, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Stat) == 0x000050, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Details_Stat' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetIsEnemy::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetailsPlayer.WBP_GS_EndOfMatchDetailsPlayer_C.SetPlayerInfo
// 0x0008 (0x0008 - 0x0000)
struct WBP_GS_EndOfMatchDetailsPlayer_C_SetPlayerInfo final
{
public:
	class URH_PlayerInfo*                         PlayerInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsPlayer_C_SetPlayerInfo) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetailsPlayer_C_SetPlayerInfo");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsPlayer_C_SetPlayerInfo) == 0x000008, "Wrong size on WBP_GS_EndOfMatchDetailsPlayer_C_SetPlayerInfo");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_SetPlayerInfo, PlayerInfo) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_SetPlayerInfo::PlayerInfo' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetailsPlayer.WBP_GS_EndOfMatchDetailsPlayer_C.UpdatePlayerPlatformIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_GS_EndOfMatchDetailsPlayer_C_UpdatePlayerPlatformIcon final
{
public:
	ERHPlatformDisplayType                        PlatformType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsPlayer_C_UpdatePlayerPlatformIcon) == 0x000001, "Wrong alignment on WBP_GS_EndOfMatchDetailsPlayer_C_UpdatePlayerPlatformIcon");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsPlayer_C_UpdatePlayerPlatformIcon) == 0x000001, "Wrong size on WBP_GS_EndOfMatchDetailsPlayer_C_UpdatePlayerPlatformIcon");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_UpdatePlayerPlatformIcon, PlatformType) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_UpdatePlayerPlatformIcon::PlatformType' has a wrong offset!");

// Function WBP_GS_EndOfMatchDetailsPlayer.WBP_GS_EndOfMatchDetailsPlayer_C.BP_GetDesiredFocusTarget
// 0x0040 (0x0040 - 0x0000)
struct WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GS_EndOfMatchDetailsStat_C*        K2Node_DynamicCast_AsWBP_GS_End_Of_Match_Details_Stat; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget) == 0x000040, "Wrong size on WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WBP_GS_EndOfMatchDetailsPlayer_C_BP_GetDesiredFocusTarget::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
