#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_Search

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.AddModeFilters
// 0x0040 (0x0040 - 0x0000)
struct WBP_S_GodBuilder_Search_C_AddModeFilters final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_GodBuilder_SearchEntry_C*        CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_AddModeFilters) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_AddModeFilters");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_AddModeFilters) == 0x000040, "Wrong size on WBP_S_GodBuilder_Search_C_AddModeFilters");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_Divide_IntInt_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_Array_Get_Item) == 0x000014, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_AddModeFilters, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000038, "Member 'WBP_S_GodBuilder_Search_C_AddModeFilters::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_GodBuilder_Search_C_BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_S_GodBuilder_Search_C_BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_BndEvt__WBP_C_GodRoster_FilterWidget_SearchTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.ExecuteUbergraph_WBP_S_GodBuilder_Search
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search) == 0x000020, "Wrong size on WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search, EntryPoint) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'WBP_S_GodBuilder_Search_C_ExecuteUbergraph_WBP_S_GodBuilder_Search::K2Node_ComponentBoundEvent_Text' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.HandleFilterEntryClicked
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked final
{
public:
	struct FGameplayTag                           FilterTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        Entry;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked) == 0x000010, "Wrong size on WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked, FilterTag) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked::FilterTag' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked, Entry) == 0x000008, "Member 'WBP_S_GodBuilder_Search_C_HandleFilterEntryClicked::Entry' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.HandleModeFilterEntryClicked
// 0x0050 (0x0050 - 0x0000)
struct WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked final
{
public:
	struct FGameplayTag                           FilterTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        Entry;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked) == 0x000050, "Wrong size on WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, FilterTag) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::FilterTag' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, Entry) == 0x000008, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry) == 0x000040, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00004A, "Member 'WBP_S_GodBuilder_Search_C_HandleModeFilterEntryClicked::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.HandleRoleFilterEntryClicked
// 0x0058 (0x0058 - 0x0000)
struct WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked final
{
public:
	struct FGameplayTag                           FilterTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        Entry;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked) == 0x000058, "Wrong size on WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, FilterTag) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::FilterTag' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, Entry) == 0x000008, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, CallFunc_GetAllChildren_ReturnValue) == 0x000020, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000041, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry) == 0x000048, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WBP_S_GodBuilder_Search_C_HandleRoleFilterEntryClicked::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.HandleSortEntryClicked
// 0x0018 (0x0018 - 0x0000)
struct WBP_S_GodBuilder_Search_C_HandleSortEntryClicked final
{
public:
	struct FGameplayTag                           FilterTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        Entry;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_HandleSortEntryClicked) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_HandleSortEntryClicked");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_HandleSortEntryClicked) == 0x000018, "Wrong size on WBP_S_GodBuilder_Search_C_HandleSortEntryClicked");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleSortEntryClicked, FilterTag) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_HandleSortEntryClicked::FilterTag' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleSortEntryClicked, Entry) == 0x000008, "Member 'WBP_S_GodBuilder_Search_C_HandleSortEntryClicked::Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_HandleSortEntryClicked, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x000010, "Member 'WBP_S_GodBuilder_Search_C_HandleSortEntryClicked::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.InitializeEntries
// 0x0150 (0x0150 - 0x0000)
struct WBP_S_GodBuilder_Search_C_InitializeEntries final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry)> K2Node_CreateDelegate_OutputDelegate; // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_1; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0098(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& FilterTag, class UWBP_S_GodBuilder_SearchEntry_C* Entry)> K2Node_CreateDelegate_OutputDelegate_3; // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x00D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_2; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_3; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_3;             // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_3;                         // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_4; // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_InitializeEntries) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_InitializeEntries");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_InitializeEntries) == 0x000150, "Wrong size on WBP_S_GodBuilder_Search_C_InitializeEntries");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, Temp_int_Loop_Counter_Variable_1) == 0x000004, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, Temp_int_Loop_Counter_Variable_2) == 0x000010, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Add_IntInt_ReturnValue_2) == 0x000014, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, Temp_int_Loop_Counter_Variable_3) == 0x000020, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Add_IntInt_ReturnValue_3) == 0x000024, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_GetChildAt_ReturnValue) == 0x000030, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry) == 0x000038, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_CreateDelegate_OutputDelegate_1) == 0x000054, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_GetAllChildren_ReturnValue) == 0x000068, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, Temp_int_Array_Index_Variable_3) == 0x000078, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_1) == 0x000088, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_CreateDelegate_OutputDelegate_2) == 0x000098, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000AC, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_GetAllChildren_ReturnValue_1) == 0x0000C0, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Array_Get_Item_1) == 0x0000D0, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_GetAllChildren_ReturnValue_2) == 0x0000D8, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_GetAllChildren_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_2) == 0x0000E8, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_bSuccess_2) == 0x0000F0, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Array_Get_Item_2) == 0x0000F8, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_3) == 0x000100, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_bSuccess_3) == 0x000108, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Array_Length_ReturnValue_1) == 0x00010C, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Array_Length_ReturnValue_2) == 0x000110, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Less_IntInt_ReturnValue_1) == 0x000114, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Less_IntInt_ReturnValue_2) == 0x000115, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_GetAllChildren_ReturnValue_3) == 0x000118, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_GetAllChildren_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Array_Length_ReturnValue_3) == 0x000128, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Array_Get_Item_3) == 0x000130, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, CallFunc_Less_IntInt_ReturnValue_3) == 0x000138, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_4) == 0x000140, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_4' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeEntries, K2Node_DynamicCast_bSuccess_4) == 0x000148, "Member 'WBP_S_GodBuilder_Search_C_InitializeEntries::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.InitializeWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_S_GodBuilder_Search_C_InitializeWidget final
{
public:
	class UHWIconSubsystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWDataDisplay_Keywords*          CallFunc_GetKeywordsDataDisplay_ReturnValue;       // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReady_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_InitializeWidget) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_InitializeWidget");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_InitializeWidget) == 0x000028, "Wrong size on WBP_S_GodBuilder_Search_C_InitializeWidget");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_InitializeWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeWidget, CallFunc_GetKeywordsDataDisplay_ReturnValue) == 0x000008, "Member 'WBP_S_GodBuilder_Search_C_InitializeWidget::CallFunc_GetKeywordsDataDisplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeWidget, CallFunc_IsReady_ReturnValue) == 0x000010, "Member 'WBP_S_GodBuilder_Search_C_InitializeWidget::CallFunc_IsReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_InitializeWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_S_GodBuilder_Search_C_InitializeWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.PlayClickSFX
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GodBuilder_Search_C_PlayClickSFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_PlayClickSFX) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_Search_C_PlayClickSFX");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_PlayClickSFX) == 0x000001, "Wrong size on WBP_S_GodBuilder_Search_C_PlayClickSFX");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_PlayClickSFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_PlayClickSFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.PlayHoverSFX
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GodBuilder_Search_C_PlayHoverSFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_PlayHoverSFX) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_Search_C_PlayHoverSFX");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_PlayHoverSFX) == 0x000001, "Wrong size on WBP_S_GodBuilder_Search_C_PlayHoverSFX");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_PlayHoverSFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_PlayHoverSFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_GodBuilder_Search_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_Search_C_PreConstruct");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_GodBuilder_Search_C_PreConstruct");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.ToggleFilterDisplay
// 0x0005 (0x0005 - 0x0000)
struct WBP_S_GodBuilder_Search_C_ToggleFilterDisplay final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_ToggleFilterDisplay) == 0x000001, "Wrong alignment on WBP_S_GodBuilder_Search_C_ToggleFilterDisplay");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_ToggleFilterDisplay) == 0x000005, "Wrong size on WBP_S_GodBuilder_Search_C_ToggleFilterDisplay");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_ToggleFilterDisplay, Temp_bool_Variable) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_ToggleFilterDisplay::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_ToggleFilterDisplay, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_GodBuilder_Search_C_ToggleFilterDisplay::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_ToggleFilterDisplay, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_S_GodBuilder_Search_C_ToggleFilterDisplay::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_ToggleFilterDisplay, K2Node_Select_Default) == 0x000003, "Member 'WBP_S_GodBuilder_Search_C_ToggleFilterDisplay::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_ToggleFilterDisplay, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'WBP_S_GodBuilder_Search_C_ToggleFilterDisplay::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_S_GodBuilder_Search.WBP_S_GodBuilder_Search_C.UninitializeEntries
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_S_GodBuilder_Search_C_UninitializeEntries final
{
public:
	TArray<class UWidget*>                        FilterEntries;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_S_GodBuilder_SearchEntry_C*        K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry_1; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_2;             // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_3;             // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_S_GodBuilder_Search_C_UninitializeEntries) == 0x000008, "Wrong alignment on WBP_S_GodBuilder_Search_C_UninitializeEntries");
static_assert(sizeof(WBP_S_GodBuilder_Search_C_UninitializeEntries) == 0x0000B0, "Wrong size on WBP_S_GodBuilder_Search_C_UninitializeEntries");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, FilterEntries) == 0x000000, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::FilterEntries' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry) == 0x000030, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::K2Node_DynamicCast_AsWBP_S_God_Builder_Search_Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, CallFunc_GetAllChildren_ReturnValue) == 0x000048, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_GodBuilder_Search_C_UninitializeEntries, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'WBP_S_GodBuilder_Search_C_UninitializeEntries::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
