#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StoreScreen_S_PurchaseDiamonds

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_StoreScreen_S_PurchaseDiamonds.WBP_C_StoreScreen_S_PurchaseDiamonds_C
// 0x0050 (0x0648 - 0x05F8)
class UWBP_C_StoreScreen_S_PurchaseDiamonds_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               background;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BackgroundGradient;                                // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               FillSheen;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HoverStroke;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_296;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OutlineSheen;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_PercentageTag_C*                 PercentageDiscountTag;                             // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWButton*                              PurchaseDiamondsButton;                            // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             UnlockPremiumPrompt;                               // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_C_Store_LowScopeDeals_PurchaseDiamondsButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_C_Store_LowScopeDeals_PurchaseDiamondsButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_C_Store_LowScopeDeals_PurchaseDiamondsButton_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds(int32 EntryPoint);
	void InitializeWidget();
	void UninitializeWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_StoreScreen_S_PurchaseDiamonds_C">();
	}
	static class UWBP_C_StoreScreen_S_PurchaseDiamonds_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_StoreScreen_S_PurchaseDiamonds_C>();
	}
};
static_assert(alignof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C) == 0x000008, "Wrong alignment on UWBP_C_StoreScreen_S_PurchaseDiamonds_C");
static_assert(sizeof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C) == 0x000648, "Wrong size on UWBP_C_StoreScreen_S_PurchaseDiamonds_C");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, background) == 0x000600, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::background' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, BackgroundGradient) == 0x000608, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::BackgroundGradient' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, FillSheen) == 0x000610, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::FillSheen' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, HoverStroke) == 0x000618, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::HoverStroke' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, HWImage_296) == 0x000620, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::HWImage_296' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, OutlineSheen) == 0x000628, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::OutlineSheen' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, PercentageDiscountTag) == 0x000630, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::PercentageDiscountTag' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, PurchaseDiamondsButton) == 0x000638, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::PurchaseDiamondsButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreScreen_S_PurchaseDiamonds_C, UnlockPremiumPrompt) == 0x000640, "Member 'UWBP_C_StoreScreen_S_PurchaseDiamonds_C::UnlockPremiumPrompt' has a wrong offset!");

}

