#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToastNotification_Manager

#include "Basic.hpp"

#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ToastNotification_Manager.WBP_ToastNotification_Manager_C
// 0x0038 (0x0630 - 0x05F8)
class UWBP_ToastNotification_Manager_C final : public URHToastNotificationWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MobileLayout;                                      // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UVerticalBox*                           ChallengeNotificationContainer;                    // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NotificationContainer;                             // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           LocalizeTexts;                                     // 0x0618(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanDisplaySocialToasts;                            // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void PushAwardsEarnedInMatch();
	void OnToastNotificationReceived(const struct FToastData& ToastData);
	void OnToastIntroAnimFinished();
	void HandleToastNotificationRemove(class URHWidget* ToastNotification);
	void HandleChallengeToastNotificationRemove(class URHWidget* ToastNotification);
	void ExecuteUbergraph_WBP_ToastNotification_Manager(int32 EntryPoint);
	void DisplayToast(class UWBP_ToastNotifcation_Entry_C* Toast);
	void DisplayChallengeToast(class UWBP_Toast2_C* Toast);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ToastNotification_Manager_C">();
	}
	static class UWBP_ToastNotification_Manager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ToastNotification_Manager_C>();
	}
};
static_assert(alignof(UWBP_ToastNotification_Manager_C) == 0x000008, "Wrong alignment on UWBP_ToastNotification_Manager_C");
static_assert(sizeof(UWBP_ToastNotification_Manager_C) == 0x000630, "Wrong size on UWBP_ToastNotification_Manager_C");
static_assert(offsetof(UWBP_ToastNotification_Manager_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_ToastNotification_Manager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotification_Manager_C, MobileLayout) == 0x000600, "Member 'UWBP_ToastNotification_Manager_C::MobileLayout' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotification_Manager_C, ChallengeNotificationContainer) == 0x000608, "Member 'UWBP_ToastNotification_Manager_C::ChallengeNotificationContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotification_Manager_C, NotificationContainer) == 0x000610, "Member 'UWBP_ToastNotification_Manager_C::NotificationContainer' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotification_Manager_C, LocalizeTexts) == 0x000618, "Member 'UWBP_ToastNotification_Manager_C::LocalizeTexts' has a wrong offset!");
static_assert(offsetof(UWBP_ToastNotification_Manager_C, CanDisplaySocialToasts) == 0x000628, "Member 'UWBP_ToastNotification_Manager_C::CanDisplaySocialToasts' has a wrong offset!");

}

