#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_GodAscensionDescription

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_GodAscensionDescription.WBP_C_GodAscensionDescription_C
// 0x0020 (0x0618 - 0x05F8)
class UWBP_C_GodAscensionDescription_C final : public UHWWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              CloseButton;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_16;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_35;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_C_GodAscensionDescription(int32 EntryPoint);
	void BndEvt__WBP_C_GodAscensionDescription_CloseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_GodAscensionDescription_C">();
	}
	static class UWBP_C_GodAscensionDescription_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_GodAscensionDescription_C>();
	}
};
static_assert(alignof(UWBP_C_GodAscensionDescription_C) == 0x000008, "Wrong alignment on UWBP_C_GodAscensionDescription_C");
static_assert(sizeof(UWBP_C_GodAscensionDescription_C) == 0x000618, "Wrong size on UWBP_C_GodAscensionDescription_C");
static_assert(offsetof(UWBP_C_GodAscensionDescription_C, UberGraphFrame) == 0x0005F8, "Member 'UWBP_C_GodAscensionDescription_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscensionDescription_C, CloseButton) == 0x000600, "Member 'UWBP_C_GodAscensionDescription_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscensionDescription_C, HWImage_16) == 0x000608, "Member 'UWBP_C_GodAscensionDescription_C::HWImage_16' has a wrong offset!");
static_assert(offsetof(UWBP_C_GodAscensionDescription_C, HWImage_35) == 0x000610, "Member 'UWBP_C_GodAscensionDescription_C::HWImage_35' has a wrong offset!");

}

