#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Social_Platform_ID

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Social_Platform_ID.WBP_Social_Platform_ID_C
// 0x0018 (0x02D8 - 0x02C0)
class UWBP_Social_Platform_ID_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             NameLabel;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlatformIcon_C*                    PlatformIcon;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Social_Platform_ID(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Social_Platform_ID_C">();
	}
	static class UWBP_Social_Platform_ID_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Social_Platform_ID_C>();
	}
};
static_assert(alignof(UWBP_Social_Platform_ID_C) == 0x000008, "Wrong alignment on UWBP_Social_Platform_ID_C");
static_assert(sizeof(UWBP_Social_Platform_ID_C) == 0x0002D8, "Wrong size on UWBP_Social_Platform_ID_C");
static_assert(offsetof(UWBP_Social_Platform_ID_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Social_Platform_ID_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Platform_ID_C, NameLabel) == 0x0002C8, "Member 'UWBP_Social_Platform_ID_C::NameLabel' has a wrong offset!");
static_assert(offsetof(UWBP_Social_Platform_ID_C, PlatformIcon) == 0x0002D0, "Member 'UWBP_Social_Platform_ID_C::PlatformIcon' has a wrong offset!");

}

