#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StandardButtonSmall

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StandardButtonSmall.WBP_StandardButtonSmall_C
// 0x0128 (0x06E0 - 0x05B8)
class UWBP_StandardButtonSmall_C final : public URHWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowButton;                                        // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnClick;                                           // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Highlight;                                         // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BtnBkg;                                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBkgHover;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnBkgRedButton;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnClickImage;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnEdge;                                           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnEdgeHover;                                      // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnFrame;                                          // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BtnFrameHover;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BtnStandardWrapper;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ButtonText;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HitTarget;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               HoverWrapper;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyPrompt;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           KeyPromptContainer;                                // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeWrapper;                                       // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnClicked;                                 // 0x0650(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnHovered;                                 // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UWidget* Widget)> OnUnhovered;                               // 0x0670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   DefaultButtonText;                                 // 0x0680(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        DefaultWidth;                                      // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowPromptOnFocus;                                 // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsRedButton;                                       // 0x06A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6A2[0x6];                                      // 0x06A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DefaultHeight;                                     // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                ClickSmallBtnSFX;                                  // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                HoverSmallBtnSFX;                                  // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FKey                                   PromptKey;                                         // 0x06C0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsConfirm;                                         // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsCancel;                                          // 0x06D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void SetWidth(double InWidth);
	void SetKeyPrompt(const struct FKey& Prompt);
	void SetHeight(double NewHeight);
	void SetDefaultDisplay();
	void SetButtonText(const class FText& ButtonText_0);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	bool NavigateConfirm();
	void HandleInputStateChanged(ERH_INPUT_STATE InputState);
	void GetGamepadPromptKey(bool* HasValidKeyPrompt, struct FKey* GamepadKey);
	void GamepadUnhover();
	void GamepadHover();
	void GamepadConfirm();
	void ExecuteUbergraph_WBP_StandardButtonSmall(int32 EntryPoint);
	void Do_Unhover();
	void Do_Hover();
	void Construct();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StandardButtonSmall_C">();
	}
	static class UWBP_StandardButtonSmall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StandardButtonSmall_C>();
	}
};
static_assert(alignof(UWBP_StandardButtonSmall_C) == 0x000008, "Wrong alignment on UWBP_StandardButtonSmall_C");
static_assert(sizeof(UWBP_StandardButtonSmall_C) == 0x0006E0, "Wrong size on UWBP_StandardButtonSmall_C");
static_assert(offsetof(UWBP_StandardButtonSmall_C, UberGraphFrame) == 0x0005B8, "Member 'UWBP_StandardButtonSmall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, ShowButton) == 0x0005C0, "Member 'UWBP_StandardButtonSmall_C::ShowButton' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, OnClick) == 0x0005C8, "Member 'UWBP_StandardButtonSmall_C::OnClick' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, Highlight) == 0x0005D0, "Member 'UWBP_StandardButtonSmall_C::Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnBkg) == 0x0005D8, "Member 'UWBP_StandardButtonSmall_C::BtnBkg' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnBkgHover) == 0x0005E0, "Member 'UWBP_StandardButtonSmall_C::BtnBkgHover' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnBkgRedButton) == 0x0005E8, "Member 'UWBP_StandardButtonSmall_C::BtnBkgRedButton' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnClickImage) == 0x0005F0, "Member 'UWBP_StandardButtonSmall_C::BtnClickImage' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnEdge) == 0x0005F8, "Member 'UWBP_StandardButtonSmall_C::BtnEdge' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnEdgeHover) == 0x000600, "Member 'UWBP_StandardButtonSmall_C::BtnEdgeHover' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnFrame) == 0x000608, "Member 'UWBP_StandardButtonSmall_C::BtnFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnFrameHover) == 0x000610, "Member 'UWBP_StandardButtonSmall_C::BtnFrameHover' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, BtnStandardWrapper) == 0x000618, "Member 'UWBP_StandardButtonSmall_C::BtnStandardWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, ButtonText) == 0x000620, "Member 'UWBP_StandardButtonSmall_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, HitTarget) == 0x000628, "Member 'UWBP_StandardButtonSmall_C::HitTarget' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, HoverWrapper) == 0x000630, "Member 'UWBP_StandardButtonSmall_C::HoverWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, KeyPrompt) == 0x000638, "Member 'UWBP_StandardButtonSmall_C::KeyPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, KeyPromptContainer) == 0x000640, "Member 'UWBP_StandardButtonSmall_C::KeyPromptContainer' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, SizeWrapper) == 0x000648, "Member 'UWBP_StandardButtonSmall_C::SizeWrapper' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, OnClicked) == 0x000650, "Member 'UWBP_StandardButtonSmall_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, OnHovered) == 0x000660, "Member 'UWBP_StandardButtonSmall_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, OnUnhovered) == 0x000670, "Member 'UWBP_StandardButtonSmall_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, DefaultButtonText) == 0x000680, "Member 'UWBP_StandardButtonSmall_C::DefaultButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, DefaultWidth) == 0x000698, "Member 'UWBP_StandardButtonSmall_C::DefaultWidth' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, ShowPromptOnFocus) == 0x0006A0, "Member 'UWBP_StandardButtonSmall_C::ShowPromptOnFocus' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, IsRedButton) == 0x0006A1, "Member 'UWBP_StandardButtonSmall_C::IsRedButton' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, DefaultHeight) == 0x0006A8, "Member 'UWBP_StandardButtonSmall_C::DefaultHeight' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, ClickSmallBtnSFX) == 0x0006B0, "Member 'UWBP_StandardButtonSmall_C::ClickSmallBtnSFX' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, HoverSmallBtnSFX) == 0x0006B8, "Member 'UWBP_StandardButtonSmall_C::HoverSmallBtnSFX' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, PromptKey) == 0x0006C0, "Member 'UWBP_StandardButtonSmall_C::PromptKey' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, IsConfirm) == 0x0006D8, "Member 'UWBP_StandardButtonSmall_C::IsConfirm' has a wrong offset!");
static_assert(offsetof(UWBP_StandardButtonSmall_C, IsCancel) == 0x0006D9, "Member 'UWBP_StandardButtonSmall_C::IsCancel' has a wrong offset!");

}

