#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ResourceManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ResourceManager.WBP_G_V2_ResourceManager_C.ExecuteUbergraph_WBP_G_V2_ResourceManager
// 0x0050 (0x0050 - 0x0000)
struct WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_G_V2_GodManaAttribute_C*           CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager) == 0x000008, "Wrong alignment on WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager");
static_assert(sizeof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager) == 0x000050, "Wrong size on WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_BreakVector2D_X) == 0x000008, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_BreakVector2D_X_1) == 0x000018, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_BreakVector2D_Y_1) == 0x000020, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_AddChildToOverlay_ReturnValue) == 0x000038, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast) == 0x000040, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast) == 0x000044, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1) == 0x000048, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager, CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1) == 0x00004C, "Member 'WBP_G_V2_ResourceManager_C_ExecuteUbergraph_WBP_G_V2_ResourceManager::CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast_1' has a wrong offset!");

// Function WBP_G_V2_ResourceManager.WBP_G_V2_ResourceManager_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_G_V2_ResourceManager_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ResourceManager_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_G_V2_ResourceManager_C_PreConstruct");
static_assert(sizeof(WBP_G_V2_ResourceManager_C_PreConstruct) == 0x000001, "Wrong size on WBP_G_V2_ResourceManager_C_PreConstruct");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_G_V2_ResourceManager_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_G_V2_ResourceManager.WBP_G_V2_ResourceManager_C.GetAttributeWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ResourceManager_C_GetAttributeWidgets final
{
public:
	TArray<class UHWGameplayAttributeWidget*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayAttributeWidget*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_ResourceManager_C_GetAttributeWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_ResourceManager_C_GetAttributeWidgets");
static_assert(sizeof(WBP_G_V2_ResourceManager_C_GetAttributeWidgets) == 0x000020, "Wrong size on WBP_G_V2_ResourceManager_C_GetAttributeWidgets");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_GetAttributeWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ResourceManager_C_GetAttributeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ResourceManager_C_GetAttributeWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_ResourceManager_C_GetAttributeWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

