#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_TopStatsTeam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_TopStatsTeam.WBP_G_V2_TopStatsTeam_C
// 0x0060 (0x0738 - 0x06D8)
class UWBP_G_V2_TopStatsTeam_C final : public UHWTopStatsTeamWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWTextBlock*                           TopStatsText;                                      // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<struct FGameplayTag, class FText>        TagToText;                                         // 0x06E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_G_V2_TopStatsTeam(int32 EntryPoint);
	void HandleTrackedStatSet(const struct FGameplayTag& NewStatTag);
	void PreConstruct(bool IsDesignTime);
	void UpdatedTrackedTeam(class AHWTeamState* NewTeamState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_TopStatsTeam_C">();
	}
	static class UWBP_G_V2_TopStatsTeam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_TopStatsTeam_C>();
	}
};
static_assert(alignof(UWBP_G_V2_TopStatsTeam_C) == 0x000008, "Wrong alignment on UWBP_G_V2_TopStatsTeam_C");
static_assert(sizeof(UWBP_G_V2_TopStatsTeam_C) == 0x000738, "Wrong size on UWBP_G_V2_TopStatsTeam_C");
static_assert(offsetof(UWBP_G_V2_TopStatsTeam_C, UberGraphFrame) == 0x0006D8, "Member 'UWBP_G_V2_TopStatsTeam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsTeam_C, TopStatsText) == 0x0006E0, "Member 'UWBP_G_V2_TopStatsTeam_C::TopStatsText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_TopStatsTeam_C, TagToText) == 0x0006E8, "Member 'UWBP_G_V2_TopStatsTeam_C::TagToText' has a wrong offset!");

}

