#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_EventsScreen

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_EventsScreen.WBP_C_EventsScreen_C
// 0x0018 (0x0628 - 0x0610)
class UWBP_C_EventsScreen_C final : public UHWEventsScreenWidget
{
public:
	class UHWButton*                              HWButton_80;                                       // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             LeftTriggerPrompt;                                 // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_MultiPromptWidget_C*             RightPromptTrigger;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void InitializeWidget();
	void OnHide();
	void OnShown();
	void UninitializeWidget();

	struct FGameplayTag GetViewRedirectOnBackTag() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_EventsScreen_C">();
	}
	static class UWBP_C_EventsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_EventsScreen_C>();
	}
};
static_assert(alignof(UWBP_C_EventsScreen_C) == 0x000008, "Wrong alignment on UWBP_C_EventsScreen_C");
static_assert(sizeof(UWBP_C_EventsScreen_C) == 0x000628, "Wrong size on UWBP_C_EventsScreen_C");
static_assert(offsetof(UWBP_C_EventsScreen_C, HWButton_80) == 0x000610, "Member 'UWBP_C_EventsScreen_C::HWButton_80' has a wrong offset!");
static_assert(offsetof(UWBP_C_EventsScreen_C, LeftTriggerPrompt) == 0x000618, "Member 'UWBP_C_EventsScreen_C::LeftTriggerPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_C_EventsScreen_C, RightPromptTrigger) == 0x000620, "Member 'UWBP_C_EventsScreen_C::RightPromptTrigger' has a wrong offset!");

}

