#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dev_HUDPlaygroundHUDWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Hemingway_structs.hpp"


namespace SDK::Params
{

// Function WBP_Dev_HUDPlaygroundHUDWidget.WBP_Dev_HUDPlaygroundHUDWidget_C.CombatLogLoaded
// 0x0060 (0x0060 - 0x0000)
struct WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded final
{
public:
	class FString                                 LoadedCombatLog;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FHWCombatLogEvent>              CallFunc_ProcessCombatLogString_OutMatchEvents;    // 0x0010(0x0010)(ReferenceParm)
	struct FHWCombatLogTeamData                   CallFunc_ExtractTeams_ReturnValue;                 // 0x0020(0x0020)()
	TArray<struct FVector2D>                      CallFunc_GenerateTimeSeriesData_OutData;           // 0x0040(0x0010)(ReferenceParm)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded) == 0x000008, "Wrong alignment on WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded");
static_assert(sizeof(WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded) == 0x000060, "Wrong size on WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded, LoadedCombatLog) == 0x000000, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded::LoadedCombatLog' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded, CallFunc_ProcessCombatLogString_OutMatchEvents) == 0x000010, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded::CallFunc_ProcessCombatLogString_OutMatchEvents' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded, CallFunc_ExtractTeams_ReturnValue) == 0x000020, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded::CallFunc_ExtractTeams_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded, CallFunc_GenerateTimeSeriesData_OutData) == 0x000040, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded::CallFunc_GenerateTimeSeriesData_OutData' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded, K2Node_MakeStruct_LinearColor) == 0x000050, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_CombatLogLoaded::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function WBP_Dev_HUDPlaygroundHUDWidget.WBP_Dev_HUDPlaygroundHUDWidget_C.ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget
// 0x0058 (0x0058 - 0x0000)
struct WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWTimeSeriesDataSource*                CallFunc_SpawnObject_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHWWidget*                              CallFunc_GetRootUserWidget_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHWEndOfMatchLobbyWidget*               K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Widget;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMatchSessionId_ReturnValue;            // 0x0030(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget) == 0x000008, "Wrong alignment on WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget");
static_assert(sizeof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget) == 0x000058, "Wrong size on WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget, EntryPoint) == 0x000000, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget, CallFunc_SpawnObject_ReturnValue) == 0x000008, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget, CallFunc_GetRootUserWidget_ReturnValue) == 0x000018, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget::CallFunc_GetRootUserWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget, K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Widget) == 0x000020, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget::K2Node_DynamicCast_AsHWEnd_Of_Match_Lobby_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget, CallFunc_GetMatchSessionId_ReturnValue) == 0x000030, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget::CallFunc_GetMatchSessionId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_ExecuteUbergraph_WBP_Dev_HUDPlaygroundHUDWidget::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_Dev_HUDPlaygroundHUDWidget.WBP_Dev_HUDPlaygroundHUDWidget_C.Get_PlayerChaosText_Text
// 0x0030 (0x0030 - 0x0000)
struct WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text) == 0x000008, "Wrong alignment on WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text");
static_assert(sizeof(WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text) == 0x000030, "Wrong size on WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text, ReturnValue) == 0x000000, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerChaosText_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Dev_HUDPlaygroundHUDWidget.WBP_Dev_HUDPlaygroundHUDWidget_C.Get_PlayerOrderText_Text
// 0x0030 (0x0030 - 0x0000)
struct WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text) == 0x000008, "Wrong alignment on WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text");
static_assert(sizeof(WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text) == 0x000030, "Wrong size on WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text, ReturnValue) == 0x000000, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_Get_PlayerOrderText_Text::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Dev_HUDPlaygroundHUDWidget.WBP_Dev_HUDPlaygroundHUDWidget_C.GraphRoleComparison
// 0x0300 (0x0300 - 0x0000)
struct WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison final
{
public:
	class FString                                 Property;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Role;                                              // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Optional_Team;                                     // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0028(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_1;                            // 0x0040(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetNamesForRoles_OutNames;                // 0x0070(0x0010)(ReferenceParm)
	struct FHWCombatLogEventFilter                CallFunc_CreateFilterFor_OutRowFilter;             // 0x0080(0x00A0)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHWCombatLogEvent>              CallFunc_FilterMatchEvents_OutFilteredEvents;      // 0x0128(0x0010)(ReferenceParm)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FHWTimeValueArray> CallFunc_AggregateTimeSeries_OutGroupedTimeSeries; // 0x0140(0x0050)()
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FHWTimeValueArray                      CallFunc_Map_Find_Value;                           // 0x01A0(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetNamesForRoles_OutNames_1;              // 0x01B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHWCombatLogEventFilter                CallFunc_CreateFilterFor_OutRowFilter_1;           // 0x01D0(0x00A0)()
	int32                                         CallFunc_RandomInteger_ReturnValue_1;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHWCombatLogEvent>              CallFunc_FilterMatchEvents_OutFilteredEvents_1;    // 0x0278(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, struct FHWTimeValueArray> CallFunc_AggregateTimeSeries_OutGroupedTimeSeries_1; // 0x0298(0x0050)()
	struct FHWTimeValueArray                      CallFunc_Map_Find_Value_1;                         // 0x02E8(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison) == 0x000008, "Wrong alignment on WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison");
static_assert(sizeof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison) == 0x000300, "Wrong size on WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, Property) == 0x000000, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::Property' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, Role) == 0x000010, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::Role' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, Optional_Team) == 0x000020, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::Optional_Team' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, Temp_string_Variable) == 0x000028, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000039, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00003A, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_BooleanOR_ReturnValue) == 0x00003B, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, Temp_string_Variable_1) == 0x000040, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, K2Node_MakeStruct_LinearColor) == 0x000050, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, K2Node_MakeStruct_LinearColor_1) == 0x000060, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_GetNamesForRoles_OutNames) == 0x000070, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_GetNamesForRoles_OutNames' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_CreateFilterFor_OutRowFilter) == 0x000080, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_CreateFilterFor_OutRowFilter' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_FilterMatchEvents_OutFilteredEvents) == 0x000128, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_FilterMatchEvents_OutFilteredEvents' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_RandomInteger_ReturnValue) == 0x000138, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_AggregateTimeSeries_OutGroupedTimeSeries) == 0x000140, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_AggregateTimeSeries_OutGroupedTimeSeries' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_Array_Get_Item) == 0x000190, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_Map_Find_Value) == 0x0001A0, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_Map_Find_ReturnValue) == 0x0001B0, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_GetNamesForRoles_OutNames_1) == 0x0001B8, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_GetNamesForRoles_OutNames_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_Array_Length_ReturnValue_1) == 0x0001C8, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_CreateFilterFor_OutRowFilter_1) == 0x0001D0, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_CreateFilterFor_OutRowFilter_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_RandomInteger_ReturnValue_1) == 0x000270, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_RandomInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_FilterMatchEvents_OutFilteredEvents_1) == 0x000278, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_FilterMatchEvents_OutFilteredEvents_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_Array_Get_Item_1) == 0x000288, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_AggregateTimeSeries_OutGroupedTimeSeries_1) == 0x000298, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_AggregateTimeSeries_OutGroupedTimeSeries_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_Map_Find_Value_1) == 0x0002E8, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison, CallFunc_Map_Find_ReturnValue_1) == 0x0002F8, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_GraphRoleComparison::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function WBP_Dev_HUDPlaygroundHUDWidget.WBP_Dev_HUDPlaygroundHUDWidget_C.PullCombatLogForMatch
// 0x0038 (0x0038 - 0x0000)
struct WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch final
{
public:
	class FString                                 MatchID;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& LoadedCombatLog)> K2Node_CreateDelegate_OutputDelegate;      // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Parse_StringToGuid_OutGuid;               // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Parse_StringToGuid_Success;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch) == 0x000008, "Wrong alignment on WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch");
static_assert(sizeof(WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch) == 0x000038, "Wrong size on WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch, MatchID) == 0x000000, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch::MatchID' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch, CallFunc_Parse_StringToGuid_OutGuid) == 0x000020, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch::CallFunc_Parse_StringToGuid_OutGuid' has a wrong offset!");
static_assert(offsetof(WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch, CallFunc_Parse_StringToGuid_Success) == 0x000030, "Member 'WBP_Dev_HUDPlaygroundHUDWidget_C_PullCombatLogForMatch::CallFunc_Parse_StringToGuid_Success' has a wrong offset!");

}

