#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_CollectionSimpleInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "RallyHereIntegration_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_CollectionSimpleInfo.WBP_S_CollectionSimpleInfo_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_CollectionSimpleInfo_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_CollectionSimpleInfo_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_CollectionSimpleInfo_C_PreConstruct");
static_assert(sizeof(WBP_S_CollectionSimpleInfo_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_CollectionSimpleInfo_C_PreConstruct");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_CollectionSimpleInfo_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_CollectionSimpleInfo.WBP_S_CollectionSimpleInfo_C.ExecuteUbergraph_WBP_S_CollectionSimpleInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  K2Node_Select_Default;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo) == 0x000008, "Wrong alignment on WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo");
static_assert(sizeof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo) == 0x000020, "Wrong size on WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, EntryPoint) == 0x000000, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, Temp_byte_Variable) == 0x000004, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, K2Node_Event_IsDesignTime) == 0x000009, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000010, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo, K2Node_Select_Default) == 0x000018, "Member 'WBP_S_CollectionSimpleInfo_C_ExecuteUbergraph_WBP_S_CollectionSimpleInfo::K2Node_Select_Default' has a wrong offset!");

// Function WBP_S_CollectionSimpleInfo.WBP_S_CollectionSimpleInfo_C.DisplayCollectionItem
// 0x0050 (0x0050 - 0x0000)
struct WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem final
{
public:
	class UHWCollectionItem*                      InCollectionItem;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRH_ItemId                             InItemId;                                          // 0x0008(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0020(0x0018)()
	class FText                                   CallFunc_GetItemTypeText_OutText;                  // 0x0038(0x0018)()
};
static_assert(alignof(WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem) == 0x000008, "Wrong alignment on WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem");
static_assert(sizeof(WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem) == 0x000050, "Wrong size on WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem, InCollectionItem) == 0x000000, "Member 'WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem::InCollectionItem' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem, InItemId) == 0x000008, "Member 'WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem::InItemId' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem, CallFunc_GetItemName_ReturnValue) == 0x000020, "Member 'WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem::CallFunc_GetItemName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem, CallFunc_GetItemTypeText_OutText) == 0x000038, "Member 'WBP_S_CollectionSimpleInfo_C_DisplayCollectionItem::CallFunc_GetItemTypeText_OutText' has a wrong offset!");

}

