#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StoreChestButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_StoreChestButton.WBP_C_StoreChestButton_C
// 0x00F0 (0x0798 - 0x06A8)
class UWBP_C_StoreChestButton_C final : public UHWStoreChestEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWImage*                               BlackOutline;                                      // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               BlackOutline_1;                                    // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               CheckMark;                                         // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ChestCompletedText;                                // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               ChestImage;                                        // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           ChestProgressText;                                 // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ContentSlot;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DescriptionText;                                   // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           HeaderText;                                        // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Hovering;                                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage;                                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_1;                                         // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_123;                                       // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               HWImage_304;                                       // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               InnerStroke;                                       // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               NewHover;                                          // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               NewHover_1;                                        // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWImage*                               OuterStroke;                                       // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_S_CurrencyPriceDisplay_C*          PurchaseCurrencyDisplay;                           // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           SeasonTimeRemainingText;                           // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWOverlay*                             Selected;                                          // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shadow;                                            // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip;                              // 0x0760(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip_1;                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip_2;                            // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip_3;                            // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_C_ChestOwned_Pip_C*                WBP_C_ChestOwned_Pip_4;                            // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundBase*                             SFXClick;                                          // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SFXHover;                                          // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_WBP_C_StoreChestButton(int32 EntryPoint);
	void Hover(bool Index_0);
	void OnDisplayItem(class UHWInventoryItem* Item);
	void OnDisplayPrice(class URHStoreItemPrice* PriceItem, const struct FGameplayTag& PriceGroupTag);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnUpdateOwnershipCount(int32 CurrentOwnedCount, int32 TotalCount);
	void PlayClickSFX();
	void PlayHoverSFX();
	void Populate_Chest(class URHStoreItem* ChestItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_StoreChestButton_C">();
	}
	static class UWBP_C_StoreChestButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_StoreChestButton_C>();
	}
};
static_assert(alignof(UWBP_C_StoreChestButton_C) == 0x000008, "Wrong alignment on UWBP_C_StoreChestButton_C");
static_assert(sizeof(UWBP_C_StoreChestButton_C) == 0x000798, "Wrong size on UWBP_C_StoreChestButton_C");
static_assert(offsetof(UWBP_C_StoreChestButton_C, UberGraphFrame) == 0x0006A8, "Member 'UWBP_C_StoreChestButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, BlackOutline) == 0x0006B0, "Member 'UWBP_C_StoreChestButton_C::BlackOutline' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, BlackOutline_1) == 0x0006B8, "Member 'UWBP_C_StoreChestButton_C::BlackOutline_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, CheckMark) == 0x0006C0, "Member 'UWBP_C_StoreChestButton_C::CheckMark' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, ChestCompletedText) == 0x0006C8, "Member 'UWBP_C_StoreChestButton_C::ChestCompletedText' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, ChestImage) == 0x0006D0, "Member 'UWBP_C_StoreChestButton_C::ChestImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, ChestProgressText) == 0x0006D8, "Member 'UWBP_C_StoreChestButton_C::ChestProgressText' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, ContentSlot) == 0x0006E0, "Member 'UWBP_C_StoreChestButton_C::ContentSlot' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, DescriptionText) == 0x0006E8, "Member 'UWBP_C_StoreChestButton_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, HeaderText) == 0x0006F0, "Member 'UWBP_C_StoreChestButton_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, Hovering) == 0x0006F8, "Member 'UWBP_C_StoreChestButton_C::Hovering' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, HWImage) == 0x000700, "Member 'UWBP_C_StoreChestButton_C::HWImage' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, HWImage_1) == 0x000708, "Member 'UWBP_C_StoreChestButton_C::HWImage_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, HWImage_123) == 0x000710, "Member 'UWBP_C_StoreChestButton_C::HWImage_123' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, HWImage_304) == 0x000718, "Member 'UWBP_C_StoreChestButton_C::HWImage_304' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, InnerStroke) == 0x000720, "Member 'UWBP_C_StoreChestButton_C::InnerStroke' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, NewHover) == 0x000728, "Member 'UWBP_C_StoreChestButton_C::NewHover' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, NewHover_1) == 0x000730, "Member 'UWBP_C_StoreChestButton_C::NewHover_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, OuterStroke) == 0x000738, "Member 'UWBP_C_StoreChestButton_C::OuterStroke' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, PurchaseCurrencyDisplay) == 0x000740, "Member 'UWBP_C_StoreChestButton_C::PurchaseCurrencyDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, SeasonTimeRemainingText) == 0x000748, "Member 'UWBP_C_StoreChestButton_C::SeasonTimeRemainingText' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, Selected) == 0x000750, "Member 'UWBP_C_StoreChestButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, Shadow) == 0x000758, "Member 'UWBP_C_StoreChestButton_C::Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, WBP_C_ChestOwned_Pip) == 0x000760, "Member 'UWBP_C_StoreChestButton_C::WBP_C_ChestOwned_Pip' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, WBP_C_ChestOwned_Pip_1) == 0x000768, "Member 'UWBP_C_StoreChestButton_C::WBP_C_ChestOwned_Pip_1' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, WBP_C_ChestOwned_Pip_2) == 0x000770, "Member 'UWBP_C_StoreChestButton_C::WBP_C_ChestOwned_Pip_2' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, WBP_C_ChestOwned_Pip_3) == 0x000778, "Member 'UWBP_C_StoreChestButton_C::WBP_C_ChestOwned_Pip_3' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, WBP_C_ChestOwned_Pip_4) == 0x000780, "Member 'UWBP_C_StoreChestButton_C::WBP_C_ChestOwned_Pip_4' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, SFXClick) == 0x000788, "Member 'UWBP_C_StoreChestButton_C::SFXClick' has a wrong offset!");
static_assert(offsetof(UWBP_C_StoreChestButton_C, SFXHover) == 0x000790, "Member 'UWBP_C_StoreChestButton_C::SFXHover' has a wrong offset!");

}

