#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_ObjectiveHealthbar_GoldFury

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_G_V2_ObjectiveHealthbar_GoldFury.WBP_G_V2_ObjectiveHealthbar_GoldFury_C.ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_GoldFury
// 0x0004 (0x0004 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_GoldFury_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_GoldFury final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_GoldFury) == 0x000004, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_GoldFury_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_GoldFury");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_GoldFury) == 0x000004, "Wrong size on WBP_G_V2_ObjectiveHealthbar_GoldFury_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_GoldFury");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_GoldFury, EntryPoint) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_GoldFury_C_ExecuteUbergraph_WBP_G_V2_ObjectiveHealthbar_GoldFury::EntryPoint' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_GoldFury.WBP_G_V2_ObjectiveHealthbar_GoldFury_C.PlayShowAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_GoldFury_C_PlayShowAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_PlayShowAnim) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_GoldFury_C_PlayShowAnim");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_PlayShowAnim) == 0x000008, "Wrong size on WBP_G_V2_ObjectiveHealthbar_GoldFury_C_PlayShowAnim");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_PlayShowAnim, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_GoldFury_C_PlayShowAnim::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_GoldFury.WBP_G_V2_ObjectiveHealthbar_GoldFury_C.SetCharacterDisplay
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay final
{
public:
	const class AHWCharacter_Base*                Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UHWCharacterItem*                 CharacterItem;                                     // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetItemName_ReturnValue;                  // 0x0018(0x0018)()
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay) == 0x000030, "Wrong size on WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay, Character) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay::Character' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay, CharacterItem) == 0x000008, "Member 'WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay::CharacterItem' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay, CallFunc_GetItemName_ReturnValue) == 0x000018, "Member 'WBP_G_V2_ObjectiveHealthbar_GoldFury_C_SetCharacterDisplay::CallFunc_GetItemName_ReturnValue' has a wrong offset!");

// Function WBP_G_V2_ObjectiveHealthbar_GoldFury.WBP_G_V2_ObjectiveHealthbar_GoldFury_C.GetAttributeWidgets
// 0x0020 (0x0020 - 0x0000)
struct WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets final
{
public:
	TArray<class UHWGameplayAttributeWidget*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<class UHWGameplayAttributeWidget*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets) == 0x000008, "Wrong alignment on WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets");
static_assert(sizeof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets) == 0x000020, "Wrong size on WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets, ReturnValue) == 0x000000, "Member 'WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_G_V2_ObjectiveHealthbar_GoldFury_C_GetAttributeWidgets::K2Node_MakeArray_Array' has a wrong offset!");

}

