#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_GodBuilder_ItemsList_CategoryEntry

#include "Basic.hpp"

#include "HemingwayUI_structs.hpp"
#include "HemingwayUI_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_S_GodBuilder_ItemsList_CategoryEntry.WBP_S_GodBuilder_ItemsList_CategoryEntry_C
// 0x0020 (0x0720 - 0x0700)
class UWBP_S_GodBuilder_ItemsList_CategoryEntry_C final : public UHWGodBuilderItemsListCategoryEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHWButton*                              collapseButton;                                    // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             Main_SizeBox;                                      // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Item_Grid_Rows;                                    // 0x0718(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreLayoutType                        Layout;                                            // 0x071C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHWItemStoreGridDetailLevel                   Detail_Level;                                      // 0x071D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_G_V2_ItemStore_ItemCategoryWidget_collapseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	class UWidget* DoCustomNavigation(EUINavigation Navigation_0);
	void ExecuteUbergraph_WBP_S_GodBuilder_ItemsList_CategoryEntry(int32 EntryPoint);
	void GetIndex(int32* Index_0);
	void OnInitialized();
	void SetCategoryLabel(const class FText& Label);
	void UpdateDetailLevel(EHWItemStoreGridDetailLevel DetailLevel);
	void UpdateLayout(EHWItemStoreLayoutType Layout_0);

	class UWidget* BP_GetDesiredFocusTarget() const;
	class UPanelWidget* GetNavigationStitchEntry() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_S_GodBuilder_ItemsList_CategoryEntry_C">();
	}
	static class UWBP_S_GodBuilder_ItemsList_CategoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_S_GodBuilder_ItemsList_CategoryEntry_C>();
	}
};
static_assert(alignof(UWBP_S_GodBuilder_ItemsList_CategoryEntry_C) == 0x000008, "Wrong alignment on UWBP_S_GodBuilder_ItemsList_CategoryEntry_C");
static_assert(sizeof(UWBP_S_GodBuilder_ItemsList_CategoryEntry_C) == 0x000720, "Wrong size on UWBP_S_GodBuilder_ItemsList_CategoryEntry_C");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_CategoryEntry_C, UberGraphFrame) == 0x000700, "Member 'UWBP_S_GodBuilder_ItemsList_CategoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_CategoryEntry_C, collapseButton) == 0x000708, "Member 'UWBP_S_GodBuilder_ItemsList_CategoryEntry_C::collapseButton' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_CategoryEntry_C, Main_SizeBox) == 0x000710, "Member 'UWBP_S_GodBuilder_ItemsList_CategoryEntry_C::Main_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_CategoryEntry_C, Item_Grid_Rows) == 0x000718, "Member 'UWBP_S_GodBuilder_ItemsList_CategoryEntry_C::Item_Grid_Rows' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_CategoryEntry_C, Layout) == 0x00071C, "Member 'UWBP_S_GodBuilder_ItemsList_CategoryEntry_C::Layout' has a wrong offset!");
static_assert(offsetof(UWBP_S_GodBuilder_ItemsList_CategoryEntry_C, Detail_Level) == 0x00071D, "Member 'UWBP_S_GodBuilder_ItemsList_CategoryEntry_C::Detail_Level' has a wrong offset!");

}

