#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_V2_PlayerKDA

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_G_V2_PlayerKDA.WBP_G_V2_PlayerKDA_C
// 0x0018 (0x0650 - 0x0638)
class UWBP_G_V2_PlayerKDA_C final : public UHWPlayerKDAWidget
{
public:
	class UHWTextBlock*                           AssistsText;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           DeathsText;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWTextBlock*                           KillsText;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdatePlayerAssists(int32 OldAssists, int32 NewAssists);
	void UpdatePlayerDeaths(int32 OldDeaths, int32 NewDeaths);
	void UpdatePlayerKills(int32 OldKills, int32 NewKills);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_G_V2_PlayerKDA_C">();
	}
	static class UWBP_G_V2_PlayerKDA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_G_V2_PlayerKDA_C>();
	}
};
static_assert(alignof(UWBP_G_V2_PlayerKDA_C) == 0x000008, "Wrong alignment on UWBP_G_V2_PlayerKDA_C");
static_assert(sizeof(UWBP_G_V2_PlayerKDA_C) == 0x000650, "Wrong size on UWBP_G_V2_PlayerKDA_C");
static_assert(offsetof(UWBP_G_V2_PlayerKDA_C, AssistsText) == 0x000638, "Member 'UWBP_G_V2_PlayerKDA_C::AssistsText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PlayerKDA_C, DeathsText) == 0x000640, "Member 'UWBP_G_V2_PlayerKDA_C::DeathsText' has a wrong offset!");
static_assert(offsetof(UWBP_G_V2_PlayerKDA_C, KillsText) == 0x000648, "Member 'UWBP_G_V2_PlayerKDA_C::KillsText' has a wrong offset!");

}

