#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_S_PlayerContextMenu

#include "Basic.hpp"

#include "Hemingway_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C.ExecuteUbergraph_WBP_S_PlayerContextMenu
// 0x0010 (0x0010 - 0x0000)
struct WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu) == 0x000008, "Wrong alignment on WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu");
static_assert(sizeof(WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu) == 0x000010, "Wrong size on WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu, EntryPoint) == 0x000000, "Member 'WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu, CallFunc_GetDesiredFocusTarget_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerContextMenu_C_ExecuteUbergraph_WBP_S_PlayerContextMenu::CallFunc_GetDesiredFocusTarget_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C.InitializeEntryWidgets
// 0x0048 (0x0048 - 0x0000)
struct WBP_S_PlayerContextMenu_C_InitializeEntryWidgets final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_PlayerContextMenuEntry_C*        K2Node_DynamicCast_AsWBP_S_Player_Context_Menu_Entry; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets) == 0x000008, "Wrong alignment on WBP_S_PlayerContextMenu_C_InitializeEntryWidgets");
static_assert(sizeof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets) == 0x000048, "Wrong size on WBP_S_PlayerContextMenu_C_InitializeEntryWidgets");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, K2Node_DynamicCast_AsWBP_S_Player_Context_Menu_Entry) == 0x000038, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::K2Node_DynamicCast_AsWBP_S_Player_Context_Menu_Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_InitializeEntryWidgets, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_S_PlayerContextMenu_C_InitializeEntryWidgets::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_S_PlayerContextMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerContextMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_S_PlayerContextMenu_C_PreConstruct");
static_assert(sizeof(WBP_S_PlayerContextMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_S_PlayerContextMenu_C_PreConstruct");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_S_PlayerContextMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C.SetEntryBackgroundColors
// 0x0070 (0x0070 - 0x0000)
struct WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors final
{
public:
	int32                                         VisibleEntries;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0020(0x0014)()
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_S_PlayerContextMenuEntry_C*        K2Node_DynamicCast_AsWBP_S_Player_Context_Menu_Entry; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors) == 0x000008, "Wrong alignment on WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors");
static_assert(sizeof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors) == 0x000070, "Wrong size on WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, VisibleEntries) == 0x000000, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::VisibleEntries' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, Temp_int_Variable) == 0x000010, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, Temp_int_Variable_1) == 0x000014, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, CallFunc_Percent_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, K2Node_Select_Default) == 0x000020, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, CallFunc_GetAllChildren_ReturnValue) == 0x000038, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, K2Node_DynamicCast_AsWBP_S_Player_Context_Menu_Entry) == 0x000060, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::K2Node_DynamicCast_AsWBP_S_Player_Context_Menu_Entry' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors, CallFunc_IsVisible_ReturnValue) == 0x000069, "Member 'WBP_S_PlayerContextMenu_C_SetEntryBackgroundColors::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C.SetupEntryBindings
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_S_PlayerContextMenu_C_SetupEntryBindings final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerContextMenu_C_SetupEntryBindings) == 0x000004, "Wrong alignment on WBP_S_PlayerContextMenu_C_SetupEntryBindings");
static_assert(sizeof(WBP_S_PlayerContextMenu_C_SetupEntryBindings) == 0x0000B0, "Wrong size on WBP_S_PlayerContextMenu_C_SetupEntryBindings");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_2) == 0x000020, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_3) == 0x000030, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_4) == 0x000040, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_5) == 0x000050, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_6) == 0x000060, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_7) == 0x000070, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_8) == 0x000080, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_9) == 0x000090, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_SetupEntryBindings, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000A0, "Member 'WBP_S_PlayerContextMenu_C_SetupEntryBindings::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");

// Function WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C.ShowContextMenu
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_S_PlayerContextMenu_C_ShowContextMenu final
{
public:
	class URH_PlayerInfo*                         PlayerInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              ReferenceGeometry;                                 // 0x0008(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0018)()
	struct FGuid                                  CallFunc_GetRHPlayerUuid_ReturnValue;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0088(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x00C0(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_5;                              // 0x00E0(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x00F8(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x0110(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_8;                              // 0x0130(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UHWGameInstance*                        K2Node_DynamicCast_AsHWGame_Instance;              // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAllMuted_ReturnValue;                   // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRHPlayerMuteFlags                     CallFunc_GetPlayerMuteFlags_ReturnValue;           // 0x015A(0x0004)(NoDestructor)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0160(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0178(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0190(0x0018)()
	class FText                                   K2Node_Select_Default_3;                           // 0x01A8(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x01C0(0x0018)()
	bool                                          Temp_bool_Variable_4;                              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x01E0(0x0018)()
};
static_assert(alignof(WBP_S_PlayerContextMenu_C_ShowContextMenu) == 0x000008, "Wrong alignment on WBP_S_PlayerContextMenu_C_ShowContextMenu");
static_assert(sizeof(WBP_S_PlayerContextMenu_C_ShowContextMenu) == 0x0001F8, "Wrong size on WBP_S_PlayerContextMenu_C_ShowContextMenu");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, PlayerInfo) == 0x000000, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::PlayerInfo' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, ReferenceGeometry) == 0x000008, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::ReferenceGeometry' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable) == 0x000040, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, CallFunc_GetRHPlayerUuid_ReturnValue) == 0x000058, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::CallFunc_GetRHPlayerUuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_bool_Variable) == 0x000069, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_1) == 0x000070, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_2) == 0x000088, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_bool_Variable_1) == 0x0000A0, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_3) == 0x0000A8, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_4) == 0x0000C0, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_bool_Variable_2) == 0x0000D8, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_5) == 0x0000E0, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_6) == 0x0000F8, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_7) == 0x000110, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_bool_Variable_3) == 0x000128, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_8) == 0x000130, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000148, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, K2Node_DynamicCast_AsHWGame_Instance) == 0x000150, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::K2Node_DynamicCast_AsHWGame_Instance' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, CallFunc_IsAllMuted_ReturnValue) == 0x000159, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::CallFunc_IsAllMuted_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, CallFunc_GetPlayerMuteFlags_ReturnValue) == 0x00015A, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::CallFunc_GetPlayerMuteFlags_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, K2Node_Select_Default) == 0x000160, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, K2Node_Select_Default_1) == 0x000178, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, K2Node_Select_Default_2) == 0x000190, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, K2Node_Select_Default_3) == 0x0001A8, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_text_Variable_9) == 0x0001C0, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, Temp_bool_Variable_4) == 0x0001D8, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_ShowContextMenu, K2Node_Select_Default_4) == 0x0001E0, "Member 'WBP_S_PlayerContextMenu_C_ShowContextMenu::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C.UpdateEntryVisibility
// 0x0032 (0x0032 - 0x0000)
struct WBP_S_PlayerContextMenu_C_UpdateEntryVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_18;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowMuteAllButton_ReturnValue;      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowMuteVoiceButton_ReturnValue;    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowMuteVGSButton_ReturnValue;      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowMutePingsButton_ReturnValue;    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowActivateBoostButton_ReturnValue; // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowMuteTextButton_ReturnValue;     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowReportButton_ReturnValue;       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowTradeGodsButton_ReturnValue;    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowTradeRolesButton_ReturnValue;   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldShowViewProfileButton_ReturnValue;  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_9;                           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility) == 0x000001, "Wrong alignment on WBP_S_PlayerContextMenu_C_UpdateEntryVisibility");
static_assert(sizeof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility) == 0x000032, "Wrong size on WBP_S_PlayerContextMenu_C_UpdateEntryVisibility");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_2) == 0x000006, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_4) == 0x000007, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_5) == 0x000008, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_3) == 0x000009, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_7) == 0x00000B, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_4) == 0x00000C, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_8) == 0x00000D, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_9) == 0x00000E, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_5) == 0x00000F, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_10) == 0x000010, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_11) == 0x000011, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_6) == 0x000012, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_12) == 0x000013, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_13) == 0x000014, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_7) == 0x000015, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_14) == 0x000016, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_15) == 0x000017, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_8) == 0x000018, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_16) == 0x000019, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_17) == 0x00001A, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_bool_Variable_9) == 0x00001B, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_18) == 0x00001C, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, Temp_byte_Variable_19) == 0x00001D, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowMuteAllButton_ReturnValue) == 0x00001E, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowMuteAllButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowMuteVoiceButton_ReturnValue) == 0x00001F, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowMuteVoiceButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default) == 0x000020, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_1) == 0x000021, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowMuteVGSButton_ReturnValue) == 0x000022, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowMuteVGSButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_2) == 0x000023, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowMutePingsButton_ReturnValue) == 0x000024, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowMutePingsButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_3) == 0x000025, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowActivateBoostButton_ReturnValue) == 0x000026, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowActivateBoostButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_4) == 0x000027, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowMuteTextButton_ReturnValue) == 0x000028, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowMuteTextButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowReportButton_ReturnValue) == 0x000029, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowReportButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_5) == 0x00002A, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_6) == 0x00002B, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowTradeGodsButton_ReturnValue) == 0x00002C, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowTradeGodsButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowTradeRolesButton_ReturnValue) == 0x00002D, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowTradeRolesButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_7) == 0x00002E, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, CallFunc_ShouldShowViewProfileButton_ReturnValue) == 0x00002F, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::CallFunc_ShouldShowViewProfileButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_8) == 0x000030, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_UpdateEntryVisibility, K2Node_Select_Default_9) == 0x000031, "Member 'WBP_S_PlayerContextMenu_C_UpdateEntryVisibility::K2Node_Select_Default_9' has a wrong offset!");

// Function WBP_S_PlayerContextMenu.WBP_S_PlayerContextMenu_C.BP_GetDesiredFocusTarget
// 0x0040 (0x0040 - 0x0000)
struct WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget) == 0x000040, "Wrong size on WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_S_PlayerContextMenu_C_BP_GetDesiredFocusTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
