#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoucherOrder

#include "Basic.hpp"

#include "RallyHereStart_structs.hpp"
#include "RallyHereStart_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoucherOrder.WBP_VoucherOrder_C
// 0x0088 (0x0648 - 0x05C0)
class UWBP_VoucherOrder_C final : public URHVoucherOrder
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnShow;                                            // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UScaleBox*                              BGSplash;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StandardButtonMedium_C*            ClaimButton;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URHAsyncImage*                          DLCImage;                                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MultipleVoucherContainer;                          // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MultipleVoucherScrollBox;                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RedeemingOverlay;                                  // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Subtitle;                                          // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_113;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Header1_C*                         WBP_Header1;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ModalPopupContainer_C*             WBP_ModalPopupContainer;                           // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class URHStoreItem*>                   Voucher_Items;                                     // 0x0628(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsRedeeming;                                       // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ScrollDirection;                                   // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void TickScroll(float Percentage);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnShown();
	void OnScrollRight(EContextActionHoldReleaseState Status);
	void OnScrollLeft(EContextActionHoldReleaseState Status);
	void OnRedeemVouchersRequested(bool bSuccess);
	void OnRedeemDLC(class UWidget* Widget);
	void OnHide();
	void OnGetVoucherOrders(const TArray<class URHStoreItem*>& PurchaseItems, const TArray<TSoftObjectPtr<class UPlatformInventoryItem>>& CurrencyItems);
	bool NavigateBack();
	void InitializeWidgetNavigation();
	void InitializeWidget();
	void ExecuteUbergraph_WBP_VoucherOrder(int32 EntryPoint);
	void DisplayVoucherOrders();
	void AttemptGetOrder();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoucherOrder_C">();
	}
	static class UWBP_VoucherOrder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoucherOrder_C>();
	}
};
static_assert(alignof(UWBP_VoucherOrder_C) == 0x000008, "Wrong alignment on UWBP_VoucherOrder_C");
static_assert(sizeof(UWBP_VoucherOrder_C) == 0x000648, "Wrong size on UWBP_VoucherOrder_C");
static_assert(offsetof(UWBP_VoucherOrder_C, UberGraphFrame) == 0x0005C0, "Member 'UWBP_VoucherOrder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, OnShow) == 0x0005C8, "Member 'UWBP_VoucherOrder_C::OnShow' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, BGSplash) == 0x0005D0, "Member 'UWBP_VoucherOrder_C::BGSplash' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, ClaimButton) == 0x0005D8, "Member 'UWBP_VoucherOrder_C::ClaimButton' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, DLCImage) == 0x0005E0, "Member 'UWBP_VoucherOrder_C::DLCImage' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, MultipleVoucherContainer) == 0x0005E8, "Member 'UWBP_VoucherOrder_C::MultipleVoucherContainer' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, MultipleVoucherScrollBox) == 0x0005F0, "Member 'UWBP_VoucherOrder_C::MultipleVoucherScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, Overlay) == 0x0005F8, "Member 'UWBP_VoucherOrder_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, RedeemingOverlay) == 0x000600, "Member 'UWBP_VoucherOrder_C::RedeemingOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, Subtitle) == 0x000608, "Member 'UWBP_VoucherOrder_C::Subtitle' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, Throbber_113) == 0x000610, "Member 'UWBP_VoucherOrder_C::Throbber_113' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, WBP_Header1) == 0x000618, "Member 'UWBP_VoucherOrder_C::WBP_Header1' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, WBP_ModalPopupContainer) == 0x000620, "Member 'UWBP_VoucherOrder_C::WBP_ModalPopupContainer' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, Voucher_Items) == 0x000628, "Member 'UWBP_VoucherOrder_C::Voucher_Items' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, IsRedeeming) == 0x000638, "Member 'UWBP_VoucherOrder_C::IsRedeeming' has a wrong offset!");
static_assert(offsetof(UWBP_VoucherOrder_C, ScrollDirection) == 0x000640, "Member 'UWBP_VoucherOrder_C::ScrollDirection' has a wrong offset!");

}

