#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AsyncIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.ExecuteUbergraph_WBP_AsyncIcon
// 0x0050 (0x0050 - 0x0000)
struct WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class URHAsyncImage* Image)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URHAsyncImage*                          K2Node_CustomEvent_Image;                          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URHAsyncImage*                          K2Node_CustomEvent_Image_1;                        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentlyAsyncLoading_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class URHAsyncImage* Image)>   K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon");
static_assert(sizeof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon) == 0x000050, "Wrong size on WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon");
static_assert(offsetof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon, EntryPoint) == 0x000000, "Member 'WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon, K2Node_CustomEvent_Image) == 0x000018, "Member 'WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon::K2Node_CustomEvent_Image' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon, K2Node_CustomEvent_Image_1) == 0x000020, "Member 'WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon::K2Node_CustomEvent_Image_1' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon, CallFunc_IsCurrentlyAsyncLoading_ReturnValue) == 0x000028, "Member 'WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon::CallFunc_IsCurrentlyAsyncLoading_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon, CallFunc_GetBrushResourceAsTexture2D_ReturnValue) == 0x000030, "Member 'WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon::CallFunc_GetBrushResourceAsTexture2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'WBP_AsyncIcon_C_ExecuteUbergraph_WBP_AsyncIcon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.Get Material
// 0x0008 (0x0008 - 0x0000)
struct WBP_AsyncIcon_C_Get_Material final
{
public:
	class UMaterialInstanceDynamic*               MaterialInstanceDynamic;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_Get_Material) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_Get_Material");
static_assert(sizeof(WBP_AsyncIcon_C_Get_Material) == 0x000008, "Wrong size on WBP_AsyncIcon_C_Get_Material");
static_assert(offsetof(WBP_AsyncIcon_C_Get_Material, MaterialInstanceDynamic) == 0x000000, "Member 'WBP_AsyncIcon_C_Get_Material::MaterialInstanceDynamic' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.OnFinishLoad
// 0x0008 (0x0008 - 0x0000)
struct WBP_AsyncIcon_C_OnFinishLoad final
{
public:
	class URHAsyncImage*                          Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_OnFinishLoad) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_OnFinishLoad");
static_assert(sizeof(WBP_AsyncIcon_C_OnFinishLoad) == 0x000008, "Wrong size on WBP_AsyncIcon_C_OnFinishLoad");
static_assert(offsetof(WBP_AsyncIcon_C_OnFinishLoad, Image) == 0x000000, "Member 'WBP_AsyncIcon_C_OnFinishLoad::Image' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.OnStartLoad
// 0x0008 (0x0008 - 0x0000)
struct WBP_AsyncIcon_C_OnStartLoad final
{
public:
	class URHAsyncImage*                          Image;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_OnStartLoad) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_OnStartLoad");
static_assert(sizeof(WBP_AsyncIcon_C_OnStartLoad) == 0x000008, "Wrong size on WBP_AsyncIcon_C_OnStartLoad");
static_assert(offsetof(WBP_AsyncIcon_C_OnStartLoad, Image) == 0x000000, "Member 'WBP_AsyncIcon_C_OnStartLoad::Image' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_AsyncIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_AsyncIcon_C_PreConstruct");
static_assert(sizeof(WBP_AsyncIcon_C_PreConstruct) == 0x000001, "Wrong size on WBP_AsyncIcon_C_PreConstruct");
static_assert(offsetof(WBP_AsyncIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_AsyncIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.Set Brush From Icon Info
// 0x0010 (0x0010 - 0x0000)
struct WBP_AsyncIcon_C_Set_Brush_From_Icon_Info final
{
public:
	class UIconInfo*                              Icon_Info;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          MatchSize;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_Set_Brush_From_Icon_Info) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_Set_Brush_From_Icon_Info");
static_assert(sizeof(WBP_AsyncIcon_C_Set_Brush_From_Icon_Info) == 0x000010, "Wrong size on WBP_AsyncIcon_C_Set_Brush_From_Icon_Info");
static_assert(offsetof(WBP_AsyncIcon_C_Set_Brush_From_Icon_Info, Icon_Info) == 0x000000, "Member 'WBP_AsyncIcon_C_Set_Brush_From_Icon_Info::Icon_Info' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_Set_Brush_From_Icon_Info, MatchSize) == 0x000008, "Member 'WBP_AsyncIcon_C_Set_Brush_From_Icon_Info::MatchSize' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.Set Brush from Texture on Item
// 0x0038 (0x0038 - 0x0000)
struct WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item final
{
public:
	class UPlatformInventoryItem*                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MatchSize;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0010(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item");
static_assert(sizeof(WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item) == 0x000038, "Wrong size on WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item");
static_assert(offsetof(WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item, Item) == 0x000000, "Member 'WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item::Item' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item, MatchSize) == 0x000008, "Member 'WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item::MatchSize' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item, Texture) == 0x000010, "Member 'WBP_AsyncIcon_C_Set_Brush_from_Texture_on_Item::Texture' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.SetBrushFromSoftPath
// 0x0028 (0x0028 - 0x0000)
struct WBP_AsyncIcon_C_SetBrushFromSoftPath final
{
public:
	struct FSoftObjectPath                        Soft_Path;                                         // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          MatchSize;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_SetBrushFromSoftPath) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_SetBrushFromSoftPath");
static_assert(sizeof(WBP_AsyncIcon_C_SetBrushFromSoftPath) == 0x000028, "Wrong size on WBP_AsyncIcon_C_SetBrushFromSoftPath");
static_assert(offsetof(WBP_AsyncIcon_C_SetBrushFromSoftPath, Soft_Path) == 0x000000, "Member 'WBP_AsyncIcon_C_SetBrushFromSoftPath::Soft_Path' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_SetBrushFromSoftPath, MatchSize) == 0x000020, "Member 'WBP_AsyncIcon_C_SetBrushFromSoftPath::MatchSize' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.SetBrushFromSoftTexture
// 0x0030 (0x0030 - 0x0000)
struct WBP_AsyncIcon_C_SetBrushFromSoftTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          MatchSize;                                         // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_SetBrushFromSoftTexture) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_SetBrushFromSoftTexture");
static_assert(sizeof(WBP_AsyncIcon_C_SetBrushFromSoftTexture) == 0x000030, "Wrong size on WBP_AsyncIcon_C_SetBrushFromSoftTexture");
static_assert(offsetof(WBP_AsyncIcon_C_SetBrushFromSoftTexture, Texture) == 0x000000, "Member 'WBP_AsyncIcon_C_SetBrushFromSoftTexture::Texture' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_SetBrushFromSoftTexture, MatchSize) == 0x000028, "Member 'WBP_AsyncIcon_C_SetBrushFromSoftTexture::MatchSize' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.SetBrushFromTexture
// 0x0010 (0x0010 - 0x0000)
struct WBP_AsyncIcon_C_SetBrushFromTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          MatchSize;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_SetBrushFromTexture) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_SetBrushFromTexture");
static_assert(sizeof(WBP_AsyncIcon_C_SetBrushFromTexture) == 0x000010, "Wrong size on WBP_AsyncIcon_C_SetBrushFromTexture");
static_assert(offsetof(WBP_AsyncIcon_C_SetBrushFromTexture, Texture) == 0x000000, "Member 'WBP_AsyncIcon_C_SetBrushFromTexture::Texture' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_SetBrushFromTexture, MatchSize) == 0x000008, "Member 'WBP_AsyncIcon_C_SetBrushFromTexture::MatchSize' has a wrong offset!");

// Function WBP_AsyncIcon.WBP_AsyncIcon_C.SetMaterialToUse
// 0x0018 (0x0018 - 0x0000)
struct WBP_AsyncIcon_C_SetMaterialToUse final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AsyncIcon_C_SetMaterialToUse) == 0x000008, "Wrong alignment on WBP_AsyncIcon_C_SetMaterialToUse");
static_assert(sizeof(WBP_AsyncIcon_C_SetMaterialToUse) == 0x000018, "Wrong size on WBP_AsyncIcon_C_SetMaterialToUse");
static_assert(offsetof(WBP_AsyncIcon_C_SetMaterialToUse, Material) == 0x000000, "Member 'WBP_AsyncIcon_C_SetMaterialToUse::Material' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_SetMaterialToUse, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WBP_AsyncIcon_C_SetMaterialToUse::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_SetMaterialToUse, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_AsyncIcon_C_SetMaterialToUse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AsyncIcon_C_SetMaterialToUse, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000011, "Member 'WBP_AsyncIcon_C_SetMaterialToUse::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

