#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_Store_CurrencyPurchase

#include "Basic.hpp"

#include "HemingwayUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_C_Store_CurrencyPurchase.WBP_C_Store_CurrencyPurchase_C
// 0x0018 (0x0638 - 0x0620)
class UWBP_C_Store_CurrencyPurchase_C final : public UHWCurrencyPurchaseWidget
{
public:
	class UHWSortableGridPanel*                   EntryContainer;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHWSizeBox*                             LoadingThrobber_SizeBox;                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoadingThrobber_C*                 WBP_LoadingThrobber;                               // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool BP_OnHandleBackAction();
	void InitializeWidget();
	void OnAddedEntryWidget(class UHWCurrencyPurchaseEntryWidget* EntryWidget);
	void OnEntriesPopulated();
	void OnHide();
	void OnRemovedEntryWidget(class UHWCurrencyPurchaseEntryWidget* EntryWidget);
	void OnShown();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_C_Store_CurrencyPurchase_C">();
	}
	static class UWBP_C_Store_CurrencyPurchase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_C_Store_CurrencyPurchase_C>();
	}
};
static_assert(alignof(UWBP_C_Store_CurrencyPurchase_C) == 0x000008, "Wrong alignment on UWBP_C_Store_CurrencyPurchase_C");
static_assert(sizeof(UWBP_C_Store_CurrencyPurchase_C) == 0x000638, "Wrong size on UWBP_C_Store_CurrencyPurchase_C");
static_assert(offsetof(UWBP_C_Store_CurrencyPurchase_C, EntryContainer) == 0x000620, "Member 'UWBP_C_Store_CurrencyPurchase_C::EntryContainer' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_CurrencyPurchase_C, LoadingThrobber_SizeBox) == 0x000628, "Member 'UWBP_C_Store_CurrencyPurchase_C::LoadingThrobber_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_C_Store_CurrencyPurchase_C, WBP_LoadingThrobber) == 0x000630, "Member 'UWBP_C_Store_CurrencyPurchase_C::WBP_LoadingThrobber' has a wrong offset!");

}

