#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_C_StoreScreen_S_PurchaseDiamonds

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_C_StoreScreen_S_PurchaseDiamonds.WBP_C_StoreScreen_S_PurchaseDiamonds_C.ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds
// 0x0068 (0x0068 - 0x0000)
struct WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWClientHUD*                           CallFunc_GetLocalHUDAsClient_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenCurrencyPurchaseScreen_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0014(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x003C(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0050(0x0014)()
};
static_assert(alignof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds) == 0x000008, "Wrong alignment on WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds");
static_assert(sizeof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds) == 0x000068, "Wrong size on WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds");
static_assert(offsetof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds, EntryPoint) == 0x000000, "Member 'WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds, CallFunc_GetLocalHUDAsClient_ReturnValue) == 0x000008, "Member 'WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds::CallFunc_GetLocalHUDAsClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds, CallFunc_OpenCurrencyPurchaseScreen_ReturnValue) == 0x000010, "Member 'WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds::CallFunc_OpenCurrencyPurchaseScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds, K2Node_MakeStruct_SlateColor) == 0x000014, "Member 'WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds, K2Node_MakeStruct_SlateColor_2) == 0x00003C, "Member 'WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds, K2Node_MakeStruct_SlateColor_3) == 0x000050, "Member 'WBP_C_StoreScreen_S_PurchaseDiamonds_C_ExecuteUbergraph_WBP_C_StoreScreen_S_PurchaseDiamonds::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

}

