#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_G_Spec_HUDScoreboard_BuffWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_G_Spec_HUDScoreboard_BuffWidget.WBP_G_Spec_HUDScoreboard_BuffWidget_C.DisplayBuff
// 0x0030 (0x0030 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff final
{
public:
	bool                                          bBuffApplied;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UHWGameplayEffectUIBuffData*      UIData;                                            // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff) == 0x000030, "Wrong size on WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, bBuffApplied) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::bBuffApplied' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, UIData) == 0x000008, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::UIData' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, Temp_bool_Variable) == 0x000010, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, Temp_byte_Variable) == 0x000011, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, Temp_bool_Variable_1) == 0x000013, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, Temp_byte_Variable_2) == 0x000014, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, K2Node_Select_Default) == 0x000015, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, Temp_byte_Variable_3) == 0x000016, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, Temp_bool_Variable_2) == 0x000017, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, Temp_byte_Variable_4) == 0x000018, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, K2Node_Select_Default_1) == 0x000028, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff, K2Node_Select_Default_2) == 0x000029, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuff::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_BuffWidget.WBP_G_Spec_HUDScoreboard_BuffWidget_C.DisplayBuffDuration
// 0x0040 (0x0040 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration final
{
public:
	float                                         TimeRemaining;                                     // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHWGameHUD*                             CallFunc_GetLocalHUDAsGame_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_Timer_Duration_Display_OutText;    // 0x0018(0x0018)()
	double                                        CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration) == 0x000040, "Wrong size on WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration, TimeRemaining) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration::TimeRemaining' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration, CallFunc_GetLocalHUDAsGame_ReturnValue) == 0x000008, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration::CallFunc_GetLocalHUDAsGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000010, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration, CallFunc_Format_Timer_Duration_Display_OutText) == 0x000018, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration::CallFunc_Format_Timer_Duration_Display_OutText' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration, CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast) == 0x000030, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration::CallFunc_Format_Timer_Duration_Display_TimerAsSeconds_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_DisplayBuffDuration::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_G_Spec_HUDScoreboard_BuffWidget.WBP_G_Spec_HUDScoreboard_BuffWidget_C.FadeBuff
// 0x0008 (0x0008 - 0x0000)
struct WBP_G_Spec_HUDScoreboard_BuffWidget_C_FadeBuff final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_FadeBuff) == 0x000008, "Wrong alignment on WBP_G_Spec_HUDScoreboard_BuffWidget_C_FadeBuff");
static_assert(sizeof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_FadeBuff) == 0x000008, "Wrong size on WBP_G_Spec_HUDScoreboard_BuffWidget_C_FadeBuff");
static_assert(offsetof(WBP_G_Spec_HUDScoreboard_BuffWidget_C_FadeBuff, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WBP_G_Spec_HUDScoreboard_BuffWidget_C_FadeBuff::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

